<div class="post__wrapper">
    <header class="post__meta">
        <a href="https://habr.com/ru/users/atrosinenko/" class="post__user-info user-info" title="&#x410;&#x432;&#x442;&#x43E;&#x440; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438;">
            <img src="//habrastorage.org/getpro/habr/avatars/8f8/f3e/46b/8f8f3e46bca8b92fefc6717372c219bb.png" width="24" height="24" class="user-info__image-pic user-info__image-pic_small">
          <span class="user-info__nickname user-info__nickname_small">atrosinenko</span>
        </a>

      <span class="post__time" data-time_published="2020-01-21T14:06Z">&#x432;&#x447;&#x435;&#x440;&#x430; &#x432; 17:06</span>

      
    </header>

    <h1 class="post__title post__title_full">
      <span class="post__title-text">&#x427;&#x430;&#x441;&#x442;&#x44C; 6: &#x41F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; MemTest86+ &#x43D;&#x430; RISC-V</span>
    </h1>


      <ul class="post__hubs post__hubs_full-post inline-list">
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/crazydev/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;&#x41D;&#x435;&#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;&apos;); }">&#x41D;&#x435;&#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/open_source/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;Open source&apos;); }">Open source</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/assembler/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;Assembler&apos;); }">Assembler</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/c/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;C&apos;); }">C</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/hardware/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;&#x41A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x43D;&#x43E;&#x435; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x43E;&apos;); }">&#x41A;&#x43E;&#x43C;&#x43F;&#x44C;&#x44E;&#x442;&#x435;&#x440;&#x43D;&#x43E;&#x435; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x43E;</a>
          </li>
      </ul>

    <ul class="post__marks inline-list"></ul>

    <div class="post__body post__body_full">
      <div class="post__text post__text-html" id="post-content-body" data-io-article-url="https://habr.com/ru/post/484026/"><div style="text-align:center;"><img src="https://habrastorage.org/webt/ne/fb/ha/nefbhar5ihkfmvccfwp0jqrm78u.png"></div><br>
<p>&#x41D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435;, &#x43C;&#x430;&#x43B;&#x43E; &#x43A;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x430;&#x439;&#x442;&#x438;&#x448;&#x43D;&#x438;&#x43A;&#x443; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x44F;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435; Memtest86+ &#x2014; &#x43F;&#x43E;&#x436;&#x430;&#x43B;&#x443;&#x439;, &#x43E;&#x43D; &#x443;&#x436;&#x435; &#x441;&#x442;&#x430;&#x43B; &#x431;&#x43E;&#x43B;&#x435;&#x435;-&#x43C;&#x435;&#x43D;&#x435;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43E;&#x43C; &#x432; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x439; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x43D;&#x430; &#x41F;&#x41A;. &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x438;&#x437; <a href="https://habr.com/ru/post/459470/">&#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x438;&#x445; &#x447;&#x430;&#x441;&#x442;&#x435;&#x439;</a> &#x44F; &#x43D;&#x430;&#x442;&#x43A;&#x43D;&#x443;&#x43B;&#x441;&#x44F; &#x43D;&#x430; &#x431;&#x438;&#x442;&#x443;&#x44E; &#x43F;&#x43B;&#x430;&#x43D;&#x43A;&#x443; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;, &#x43F;&#x440;&#x438;&#x448;&#x435;&#x434;&#x448;&#x443;&#x44E; &#x432; &#x43A;&#x43E;&#x43C;&#x43F;&#x43B;&#x435;&#x43A;&#x442;&#x435; &#x441; &#x43F;&#x43B;&#x430;&#x442;&#x43E;&#x439;, &#x43E;&#x43D; (&#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x44E;&#x449;&#x438;&#x43C; DDR2 &#x43D;&#x435;&#x442;&#x431;&#x443;&#x43A;&#x43E;&#x43C;) &#x43A;&#x430;&#x437;&#x430;&#x43B;&#x441;&#x44F; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x44B;&#x43C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;&#x43C;. &#x414;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;, &#x447;&#x442;&#x43E; &#x442;&#x430;&#x43C; &#x432; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x435; &#x43D;&#x435;&#x441;&#x442;&#x430;&#x431;&#x438;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B; &#x431;&#x44B;&#x43B;&#x430; &#x432;&#x438;&#x434;&#x43D;&#x430; &#x43D;&#x435;&#x432;&#x43E;&#x43E;&#x440;&#x443;&#x436;&#x451;&#x43D;&#x43D;&#x44B;&#x43C; &#x433;&#x43B;&#x430;&#x437;&#x43E;&#x43C;. &#x412; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x445;&#x438;&#x442;&#x440;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445;, &#x441;&#x43B;&#x44B;&#x448;&#x430;&#x43B;, &#x447;&#x442;&#x43E; &#x43A;&#x440;&#x43E;&#x43C;&#x435; &#x431;&#x430;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#xAB;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x443;&#x43A;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x44F;&#xBB; &#x44F;&#x447;&#x435;&#x435;&#x43A; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x434;&#x43E; &#x431;&#x435;&#x441;&#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x44D;&#x442;&#x43E;&#x442; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x44B; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;, &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x432; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x435; DDR &#x432;&#x44B;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x441; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435;&#x439; &#x432;&#x435;&#x440;&#x43E;&#x44F;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E;. &#x412; &#x43E;&#x431;&#x449;&#x435;&#x43C; &#x447;&#x443;&#x434;&#x435;&#x441;&#x43D;&#x430;&#x44F; &#x432;&#x435;&#x449;&#x44C;, &#x436;&#x430;&#x43B;&#x44C;, &#x447;&#x442;&#x43E; &#x434;&#x430;&#x436;&#x435; &#x432; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E;: 86 &#x2014; &#xAB;&#x422;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x434;&#x43B;&#x44F; x86-&#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x44B;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#xBB;. &#x418;&#x43B;&#x438; &#x43D;&#x435;&#x442;?</p><br>
<p>&#x41F;&#x43E;&#x434; &#x43A;&#x430;&#x442;&#x43E;&#x43C; &#x432;&#x44B; &#x443;&#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x43C;&#x43E;&#x438; &#x43F;&#x43E;&#x43F;&#x44B;&#x442;&#x43A;&#x438; &#x43F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; MemTest86+ v5.1 &#x43D;&#x430; RISC-V &#x438; &#x43F;&#x440;&#x43E;&#x43C;&#x435;&#x436;&#x443;&#x442;&#x43E;&#x447;&#x43D;&#x44B;&#x439; &#x438;&#x442;&#x43E;&#x433;. <em>&#x421;&#x43F;&#x43E;&#x439;&#x43B;&#x435;&#x440;: &#x43E;&#x43D;&#x43E; &#x448;&#x435;&#x432;&#x435;&#x43B;&#x438;&#x442;&#x441;&#x44F;!</em></p><a name="habracut"></a><br>
<p><strong>DISCLAIMER: &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E; &#x43C;&#x43D;&#x43E;&#x439; &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x439; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x435; RocketChip &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x435;. &#x422;&#x43E;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438; &#x431;&#x435;&#x437;&#x43E;&#x43F;&#x430;&#x441;&#x43D;&#x43E;&#x441;&#x442;&#x44C; (&#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E; &#x43D;&#x430; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430;&#x445;) &#x43D;&#x435; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F;. &#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43D;&#x430; &#x441;&#x432;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x430;&#x445; &#x438; &#x440;&#x438;&#x441;&#x43A;. &#x412; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x43D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x43D;&#x438;&#x43A;&#x430;&#x43A; &#x43D;&#x435; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x437;&#x430;&#x440;&#x435;&#x437;&#x435;&#x440;&#x432;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;, &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43D;&#x438; &#x43F;&#x43E;&#x43F;&#x430;&#x43B;&#x438; &#x432; &#x434;&#x438;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D; RAM.</strong></p><br>
<p>&#x41A;&#x430;&#x43A; &#x44F; &#x443;&#x436;&#x435; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x43B;, &#x43D;&#x435; &#x442;&#x430;&#x43A; &#x434;&#x430;&#x432;&#x43D;&#x43E; &#x44F; &#x43A;&#x443;&#x43F;&#x438;&#x43B; &#x43D;&#x430; AliExpress &#x43F;&#x43B;&#x430;&#x442;&#x443; &#x441; Cyclone IV, &#x43D;&#x43E; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x44C; &#x432; &#x43D;&#x435;&#x439; &#x433;&#x43B;&#x44E;&#x447;&#x438;&#x43B;&#x430;. &#x41A; &#x441;&#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;, &#x43E;&#x434;&#x43D;&#x430; &#x438;&#x437; &#x432;&#x430;&#x436;&#x43D;&#x44B;&#x445; &#x444;&#x438;&#x447; &#x442;&#x43E;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x44B; &#x437;&#x430;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x445; DDR2 SO-DIMM &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439; &#x2014; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x436;&#x435;, &#x43A;&#x430;&#x43A; &#x432; &#x43C;&#x43E;&#x451;&#x43C; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x43C; &#x43D;&#x435;&#x442;&#x431;&#x443;&#x43A;&#x435;. &#x422;&#x435;&#x43C; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x435;&#x435;, &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C;, &#x442;&#x430;&#x43A; &#x441;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;, self-hosted &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; (&#x430; &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;, &#x435;&#x449;&#x451; &#x438; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x43B;&#x435;&#x440;&#x430;). &#x41F;&#x435;&#x440;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x430; &#x43E;&#x442;&#x43B;&#x430;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x438; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x432; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x44F;&#x445; &#x431;&#x438;&#x442;&#x43E;&#x439; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x43A;&#x430;&#x43A;-&#x442;&#x43E; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x43D;&#x435; &#x440;&#x430;&#x434;&#x43E;&#x432;&#x430;&#x43B;&#x430;. &#x41E;&#x441;&#x43E;&#x431;&#x43E; &#x43D;&#x435; &#x43D;&#x430;&#x434;&#x435;&#x44F;&#x441;&#x44C; &#x43D;&#x430; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x438; &#x43C;&#x44B;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x43E; &#x433;&#x43E;&#x442;&#x43E;&#x432;&#x44F;&#x441;&#x44C; &#x43E;&#x442;&#x43B;&#x43E;&#x436;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x435; &#x43D;&#x430; &#x43D;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x43E; &#x434;&#x43E;&#x43B;&#x433;&#x438;&#x439; &#x441;&#x440;&#x43E;&#x43A;, &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x43B; &#x43D;&#x430; &#x412;&#x438;&#x43A;&#x438;&#x43F;&#x435;&#x434;&#x438;&#x438; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44E; &#x43F;&#x440;&#x43E; Memtest86+ &#x438; &#x432;&#x43D;&#x435;&#x437;&#x430;&#x43F;&#x43D;&#x43E; &#x443;&#x432;&#x438;&#x434;&#x435;&#x43B; &#xAB;Written in: C and assembly&#xBB; &#x432; &#x43A;&#x430;&#x440;&#x442;&#x43E;&#x447;&#x43A;&#x435;. &#x425;&#x43C;, &#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x43E;&#x43D;, &#x445;&#x43E;&#x442;&#x44C; &#x438; &#xAB;...86&#xBB;, &#x43D;&#x43E; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D; &#x43D;&#x435; &#x446;&#x435;&#x43B;&#x438;&#x43A;&#x43E;&#x43C; &#x43D;&#x430; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x435;? &#x42D;&#x442;&#x43E; &#x43E;&#x431;&#x43D;&#x430;&#x434;&#x451;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;. &#x41E;&#x441;&#x442;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43B;&#x438;&#x448;&#x44C; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C; &#x441;&#x43E;&#x43E;&#x442;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x438;&#x435;.</p><br>
<p>&#x418;&#x442;&#x430;&#x43A;, &#x438;&#x434;&#x451;&#x43C; &#x43D;&#x430; <a href="http://www.memtest.org/" rel="nofollow">memtest.org</a> &#x438; &#x43A;&#x430;&#x447;&#x430;&#x435;&#x43C; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; 5.01 &#x43F;&#x43E;&#x434; GPL2. &#x414;&#x43B;&#x44F; &#x443;&#x434;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x430; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438; &#x44F; <a href="https://github.com/atrosinenko/memtest86-plus-riscv" rel="nofollow">&#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43B;&#x438;&#x43B;</a> &#x435;&#x451; &#x43D;&#x430; GitHub. &#x41A; &#x441;&#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;, &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x432; &#x430;&#x440;&#x445;&#x438;&#x432;&#x435; &#x441; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x438;&#x43A;&#x430;&#x43C;&#x438; &#x43D;&#x430;&#x441; &#x432;&#x441;&#x442;&#x440;&#x435;&#x447;&#x430;&#x435;&#x442; &#x444;&#x430;&#x439;&#x43B; <a href="https://github.com/atrosinenko/memtest86-plus-riscv/blob/68b365d13cf22accd52f88af49c33f57c6643ae5/README.background" rel="nofollow">README.background</a>, &#x43E;&#x437;&#x430;&#x433;&#x43B;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x439;</p><br>
<blockquote>The Anatomy &amp; Physiology of Memtest86-SMP</blockquote><p>&#x412; &#x43D;&#x451;&#x43C; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x43E; (&#x438; &#x434;&#x430;&#x436;&#x435; &#x441; &#x43A;&#x430;&#x440;&#x442;&#x438;&#x43D;&#x43A;&#x430;&#x43C;&#x438; &#x432; &#x432;&#x438;&#x434;&#x435; ASCII-art) &#x43E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x432;&#x430;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430; &#x43A;&#x43E;&#x434;&#x430;. &#x412; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x43C;&#x44B; &#x432;&#x438;&#x434;&#x438;&#x43C; <em>Binary layout</em>, &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x449;&#x438;&#x439; &#x438;&#x437; <code>bootsect.o</code>, <code>setup.o</code>, <code>head.o</code> &#x438; &#x43D;&#x435;&#x43A;&#x43E;&#x435;&#x433;&#x43E; <code>memtest_shared</code>. &#x41D;&#x435;&#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x438;&#x434;&#x435;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x442;&#x440;&#x438; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43D;&#x44B;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x438;&#x437; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x445; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x438;&#x43A;&#x43E;&#x432;. &#x41D;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x432;&#x437;&#x433;&#x43B;&#x44F;&#x434;, &#x432;&#x441;&#x451; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x43D;&#x430; C! &#x41D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;, &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E;...</p><br>
<p>&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x44F; &#x441;&#x43A;&#x43E;&#x43F;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B; <code>Makefile</code> &#x432; <code>Makefile.arch</code> &#x438; &#x43D;&#x430;&#x447;&#x430;&#x43B; &#x432;&#x441;&#x451; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x442;&#x44C;, &#x430; &#x447;&#x442;&#x43E; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x43F;&#x44B;&#x442;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x44B;&#x43A;&#x438;&#x43D;&#x443;&#x442;&#x44C;. &#x41F;&#x435;&#x440;&#x432;&#x44B;&#x43C; &#x434;&#x435;&#x43B;&#x43E;&#x43C; &#x43C;&#x43D;&#x435;, &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;, &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x43E;&#x432;&#x430;&#x43B;&#x441;&#x44F; &#x442;&#x443;&#x43B;&#x447;&#x435;&#x439;&#x43D; &#x434;&#x43B;&#x44F; RISC-V, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439;, &#x43A; &#x441;&#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;, &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x43B;&#x435;&#x436;&#x438;&#x442; &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x441;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x438;&#x445; &#x44D;&#x43A;&#x441;&#x43F;&#x435;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x421;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x44F; &#x434;&#x443;&#x43C;&#x430;&#x43B; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x440;&#x442; &#x43F;&#x43E;&#x434; 32-&#x431;&#x438;&#x442;&#x43D;&#x443;&#x44E; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x443;, &#x43D;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x432;&#x441;&#x43F;&#x43E;&#x43C;&#x43D;&#x438;&#x43B;, &#x447;&#x442;&#x43E; &#x432; &#x43F;&#x43B;&#x430;&#x442;&#x443; &#x437;&#x430;&#x43B;&#x438;&#x442; 64-&#x431;&#x438;&#x442;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;, &#x434;&#x430; &#x438; &#x442;&#x443;&#x43B;&#x447;&#x435;&#x439;&#x43D; &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x441; &#x43F;&#x440;&#x435;&#x444;&#x438;&#x43A;&#x441;&#x43E;&#x43C; <code>riscv64-</code>.</p><br>
<p><em>&#x41B;&#x438;&#x440;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x435; &#x43E;&#x442;&#x441;&#x442;&#x443;&#x43F;&#x43B;&#x435;&#x43D;&#x438;&#x435;:</em> &#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x435;&#x442;&#x441;&#x44F;, &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x43C; &#x434;&#x435;&#x43B;&#x43E;&#x43C; &#x441;&#x442;&#x43E;&#x438;&#x43B;&#x43E; &#x438;&#x437;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; 32- &#x438; 64-&#x431;&#x438;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430;. &#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x432; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x430; &#x43D;&#x435;&#x43F;&#x440;&#x438;&#x432;&#x438;&#x43B;&#x435;&#x433;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; ISA (Instruction Set Architecture) &#x43D;&#x430;&#x448;&#x451;&#x43B; &#x432; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x435; <code>1.3 RISC-V ISA Overview</code> &#x443;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435;:</p><br>
<blockquote>The main advantage of explicitly separating base ISAs is that each base ISA can be optimized for its needs without requiring to support all the operations needed for other base ISAs. For example, RV64I can omit instructions and CSRs that are only needed to cope with the narrower registers in RV32I. The RV32I variants can use encoding space otherwise reserved for instructions only required by wider address-space variants.</blockquote><p>&#x422;&#x430;&#x43A;&#x436;&#x435; &#x445;&#x43E;&#x447;&#x443; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x442;&#x443;&#x43B;&#x447;&#x435;&#x439;&#x43D; &#x441; &#x43F;&#x440;&#x435;&#x444;&#x438;&#x43A;&#x441;&#x43E;&#x43C; <code>riscv64-</code> &#x441;&#x43A;&#x43E;&#x440;&#x435;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43E;&#x431;&#x435;&#x440;&#x451;&#x442; &#x438; 32-&#x431;&#x438;&#x442;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C; &#x432;&#x44B;&#x431;&#x43E;&#x440;&#x435; &#x446;&#x435;&#x43B;&#x435;&#x432;&#x43E;&#x439; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x44B; &#x2014; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C; &#x43F;&#x43E;&#x437;&#x436;&#x435;.</p><br>
<p>&#x412; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x435; &#x43F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x441;&#x43C;&#x44B;&#x441;&#x43B; &#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x434; &#x440;&#x443;&#x43A;&#x43E;&#x439; &#x44D;&#x442;&#x438; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B;:</p><br>
<ul>
<li><a href="https://riscv.org/specifications/" rel="nofollow">The RISC-V Instruction Set Manual Volume I: Unprivileged ISA</a></li>
<li><a href="https://riscv.org/specifications/privileged-isa/" rel="nofollow">The RISC-V Instruction Set Manual Volume II: Privileged Architecture</a></li>
<li>&#x422;&#x430;&#x43A;&#x436;&#x435; &#x43D;&#x435; &#x43B;&#x438;&#x448;&#x43D;&#x438;&#x43C; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; <a href="https://sifive.cdn.prismic.io/sifive%2F834354f0-08e6-423c-bf1f-0cb58ef14061_fu540-c000-v1.0.pdf" rel="nofollow">SiFive FU540-C000 Manual</a> &#x2014; &#x43C;&#x430;&#x43D;&#x443;&#x430;&#x43B; &#x43D;&#x430; &#x447;&#x438;&#x43F;, &#x43F;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44E; &#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x433;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x441;&#x43E;&#x444;&#x442;-&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x443;, &#x447;&#x442;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x438; &#x432; &#x41F;&#x41B;&#x418;&#x421;</li>
</ul><br>
<h2 id="nastroyka-sborki">&#x41D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438;</h2><br>
<p>&#x414;&#x43B;&#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x43C;&#x441;&#x44F;: &#x445;&#x43E;&#x447;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x440;&#x442;, &#x43F;&#x440;&#x438;&#x433;&#x43E;&#x434;&#x43D;&#x44B;&#x439; &#x434;&#x43B;&#x44F; &#x434;&#x430;&#x43B;&#x44C;&#x43D;&#x435;&#x439;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43D;&#x43E;&#x441;&#x430; &#x43D;&#x430; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x44B;, &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x43E;&#x442; x86 &#x438; RISC-V. &#x422;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x430;&#x433;&#x430;&#x44E; &#x432;&#x44B;&#x43A;&#x438;&#x43D;&#x443;&#x442;&#x44C; &#x438;&#x437; &#x43A;&#x440;&#x43E;&#x441;&#x441;-&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43E;&#x447;&#x43D;&#x44B;&#x445; &#x434;&#x438;&#x441;&#x43A;&#x435;&#x442; &#x438; &#x43F;&#x440;&#x43E;&#x447;&#x443;&#x44E; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x443; x86.</p><br>
<p>&#x427;&#x442;&#x43E; &#x43C;&#x44B; &#x432; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x438;&#x43C;&#x435;&#x435;&#x43C;: &#x435;&#x441;&#x442;&#x44C; &#x442;&#x440;&#x438; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;: <code>bootsect.S</code>, <code>setup.S</code> &#x438; <code>head.S</code>. &#x41F;&#x435;&#x440;&#x432;&#x44B;&#x435; &#x434;&#x432;&#x430; &#x43D;&#x443;&#x436;&#x43D;&#x44B; &#x43B;&#x438;&#x448;&#x44C; &#x43F;&#x440;&#x438; &#x441;&#x442;&#x430;&#x440;&#x442;&#x435;, &#x430; &#x442;&#x440;&#x435;&#x442;&#x438;&#x439; &#x43D;&#x443;&#x436;&#x435;&#x43D; &#x438; &#x432;&#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x441;&#x442;&#x432;&#x438;&#x438; &#x43F;&#x440;&#x438; &#x440;&#x435;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x432; &#x434;&#x440;&#x443;&#x433;&#x443;&#x44E; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;. &#x414;&#x435;&#x43B;&#x43E; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x440;&#x43E;&#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x44C; &#xAB;&#x43F;&#x43E;&#x434; &#x441;&#x43E;&#x431;&#x43E;&#x439;&#xBB;, &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x443;&#x44E;&#x449;&#x435;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x441;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x435;&#x445;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x43E;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E;. &#x421;&#x438;&#x448;&#x43D;&#x44B;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x432; ELF, &#x438;&#x437; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x431;&#x435;&#x440;&#x443;&#x442;&#x441;&#x44F; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x438; &#x43A;&#x43E;&#x434;&#x430;, &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x438; &#x442;.&#x434;. &#x411;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x43D;&#x43E; &#x432; &#x432;&#x438;&#x434;&#x435; PIC (Position Independent Code) &#x2014; &#x43C;&#x435;&#x43D;&#x44F; &#x43F;&#x43E;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x443; &#x434;&#x430;&#x436;&#x435; &#x443;&#x434;&#x438;&#x432;&#x438;&#x43B;&#x43E;: &#x43A;&#x43E;&#x434; &#x445;&#x43E;&#x442;&#x44F; &#x438; freestanding (&#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x431;&#x435;&#x437; &#x44F;&#x434;&#x440;&#x430;, libc &#x438; &#x442;.&#x434;.), &#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x442;&#x430;&#x43A;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x44B;&#x435; &#x444;&#x438;&#x447;&#x438;.</p><br>
<p>&#x414;&#x430;&#x43B;&#x435;&#x435;, &#x432; Makefile&apos;&#x435; &#x43F;&#x435;&#x440;&#x438;&#x43E;&#x434;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43F;&#x43E;&#x43F;&#x430;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B;, &#x437;&#x430;&#x434;&#x430;&#x44E;&#x449;&#x438;&#x435; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x443;: <code>-march=i486</code>, <code>-m32</code> &#x438; &#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x435;. &#x41D;&#x430;&#x434;&#x43E; &#x431;&#x44B; &#x438; &#x43C;&#x43D;&#x435; &#x447;&#x442;&#x43E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C;, <del>&#x430; &#x442;&#x43E; &#x447;&#x451; &#x43A;&#x430;&#x43A; &#x43B;&#x43E;&#x445;</del>. &#x421; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x44B; &#x443; RISC-V &#x434;&#x435;&#x43B;&#x430; &#x43E;&#x431;&#x441;&#x442;&#x43E;&#x44F;&#x442; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x442;&#x430;&#x43A;: &#x435;&#x441;&#x442;&#x44C; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x44B; <code>rv32</code> &#x438; <code>rv64</code> (&#x432;&#x440;&#x43E;&#x434;&#x435;, &#x435;&#x441;&#x442;&#x44C; &#x435;&#x449;&#x451; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x440;&#x435;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x439; embedded &#x438; &#x43F;&#x440;&#x438;&#x43F;&#x430;&#x441;&#x451;&#x43D;&#x43D;&#x44B;&#x439; &#x43D;&#x430; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x435; <code>rv128</code>, &#x43D;&#x43E; &#x43D;&#x430;&#x441; &#x43E;&#x43D;&#x438; &#x43D;&#x435; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x443;&#x435;&#x442;), &#x430; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; ISA &#x43E;&#x431;&#x440;&#x430;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x438;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x435;&#x43C; &#x43A; &#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x435;&#x444;&#x438;&#x43A;&#x441;&#x443; &#x431;&#x443;&#x43A;&#x432;, &#x43E;&#x431;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x44E;&#x449;&#x438;&#x445; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x44F;: <code>i</code> &#x2014; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x439; &#x446;&#x435;&#x43B;&#x43E;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43D;&#x430;&#x431;&#x43E;&#x440; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x439;, <code>m</code> &#x2014; &#x446;&#x435;&#x43B;&#x43E;&#x447;&#x438;&#x441;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x443;&#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x438; &#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435;,&#x2026; &#x41A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;, &#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x431;&#x44B; &#x43E;&#x431;&#x43E;&#x439;&#x442;&#x438;&#x441;&#x44C; <code>rv64i</code>, &#x43D;&#x43E; &#x432;&#x440;&#x44F;&#x434; &#x43B;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x43F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; Memtest86 &#x43D;&#x430; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x443; &#x431;&#x435;&#x437; &#x443;&#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;. &#x41F;&#x440;&#x430;&#x432;&#x434;&#x430;, &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x442;&#x43E;&#x440; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#xAB;&#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43D;&#x44B;&#x445;&#xBB; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x439; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x44B; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x439;, &#x43D;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x440;&#x438;&#x441;&#x43A; &#x43E;&#x441;&#x442;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x438;&#x436;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; (&#x43D;&#x435; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F; &#x443;&#x436;&#x435; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x438;&#x43B;&#x438; &#x433;&#x434;&#x435;-&#x442;&#x43E; &#x432;&#x437;&#x44F;&#x442;&#x44C;).</p><br>
<p>&#x422;&#x430;&#x43A;&#x436;&#x435; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x430; ABI. &#x412; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x435;, &#x430;&#x437;&#x44B; calling convention &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x443;&#x436;&#x435; &#x432; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; <code>Volume I</code> &#x432; &#x447;&#x430;&#x441;&#x442;&#x438; &#xAB;RISC-V Assembly Programmer&#x2019;s Handbook&#xBB;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44E; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x432;&#x440;&#x43E;&#x434;&#x435;</p><br>
<pre><code class="plaintext">$ riscv64-linux-gnu-gcc-9 -mabi=help
riscv64-linux-gnu-gcc-9: error: unrecognized argument in option &#x2018;-mabi=help&#x2019;
riscv64-linux-gnu-gcc-9: note: valid arguments to &#x2018;-mabi=&#x2019; are: ilp32 ilp32d ilp32e ilp32f lp64 lp64d lp64f
riscv64-linux-gnu-gcc-9: fatal error: no input files
compilation terminated.</code></pre><br>
<p>&#x418; &#x43D;&#x435;&#x434;&#x43E;&#x43B;&#x433;&#x43E; &#x434;&#x443;&#x43C;&#x430;&#x44F;, &#x432;&#x43E;&#x437;&#x44C;&#x43C;&#x443; <code>lp64</code>. <em>&#x417;&#x430;&#x431;&#x435;&#x433;&#x430;&#x44F; &#x432;&#x43F;&#x435;&#x440;&#x451;&#x434; &#x441;&#x43A;&#x430;&#x436;&#x443;, &#x447;&#x442;&#x43E; &#x441; &#x44D;&#x442;&#x438;&#x43C; ABI &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x447;&#x43D;&#x44B;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x44B; &#x438;&#x437; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x439; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x43D;&#x435; &#x437;&#x430;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B;&#x438;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x432;&#x437;&#x44F;&#x43B; <code>lp64f</code>, &#x430; ARCH &#xAB;&#x43F;&#x440;&#x43E;&#x430;&#x43F;&#x433;&#x440;&#x435;&#x439;&#x434;&#x438;&#x43B;&#xBB; &#x434;&#x43E; <code>rv64imf</code>. &#x411;&#x435;&#x437; &#x43F;&#x430;&#x43D;&#x438;&#x43A;&#x438;, &#x44F; &#x43D;&#x435; &#x43F;&#x43B;&#x430;&#x43D;&#x438;&#x440;&#x443;&#x44E; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x432;&#x43E;&#x451;&#x43C; &#x43F;&#x43E;&#x440;&#x442;&#x435; floating point.</em></p><br>
<p>&#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x443;&#x433;&#x43B;&#x443;&#x431;&#x43B;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x43A;&#x440;&#x43E;&#x441;&#x441;-&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43B;&#x438;&#x43D;&#x43A;&#x435;&#x440;-&#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x43E;&#x432; &#x43A;&#x430;&#x43A;-&#x442;&#x43E; &#x43D;&#x435; &#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x2014; &#x438; &#x442;&#x430;&#x43A; &#x43D;&#x435; &#x441;&#x440;&#x430;&#x437;&#x443; &#x443;&#x434;&#x430;&#x43B;&#x43E;&#x441;&#x44C; <em>&#x43F;&#x43E;&#x434;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x43A;&#x43B;&#x44E;&#x447;&#x438; &#x43A; ld</em>, &#x440;&#x435;&#x448;&#x438;&#x43B; &#x43E;&#x431;&#x43E;&#x439;&#x442;&#x438;&#x441;&#x44C; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x43C; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x43C; <code>head.S</code>, &#x446;&#x435;&#x43F;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x43C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C;&#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;&#x43C;&#x438; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <code>memtest_shared.arch.lds</code>. &#x418;&#x437; &#x43D;&#x435;&#x433;&#x43E; &#x44F; &#x432;&#x44B;&#x43A;&#x438;&#x43D;&#x443;&#x43B; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x430; &#x438; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x443; (&#x432;&#x441;&#x451;-&#x442;&#x430;&#x43A;&#x438;, &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435; &#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x438;&#x437; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x432; Makefile&apos;&#x435;), &#x430; &#x442;&#x430;&#x43A;&#x436;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x437;&#x430;&#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B; <code>DISCARD</code> &#x432; &#x43A;&#x43E;&#x43D;&#x446;&#x435;, &#x441; &#x445;&#x43E;&#x434;&#x443; &#x43D;&#x435; &#x441;&#x443;&#x43C;&#x435;&#x432; &#x440;&#x430;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F;, &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x438; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43E;&#x447;&#x43D;&#x43E;&#x439; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x438; &#x43C;&#x43D;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x44B;. <em>(&#x417;&#x430;&#x431;&#x435;&#x433;&#x430;&#x44F; &#x432;&#x43F;&#x435;&#x440;&#x451;&#x434;: &#x43B;&#x430;&#x434;&#x43D;&#x43E; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43E;&#x447;&#x43D;&#x430;&#x44F; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44F;, &#x430; &#x432;&#x43E;&#x442; <code>.rela</code> &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x448;&#x43B;&#x43E;&#x441;&#x44C;)</em> &#x412;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F;, &#x432; x86-&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x43F;&#x43E;&#x434;&#x447;&#x451;&#x440;&#x43A;&#x438;&#x432;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C; &#x443;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; 64k &#x2014; &#x431;&#x443;&#x434;&#x443; &#x43D;&#x430;&#x434;&#x435;&#x44F;&#x442;&#x44C;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43A;&#x430;&#x43A;-&#x442;&#x43E; &#x441;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x43E; &#x441; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44F;&#x43C;&#x438; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x430; &#x438; &#x43D;&#x430; RISC-V &#x43D;&#x430;&#x441; &#x43D;&#x435; &#x43A;&#x430;&#x441;&#x430;&#x435;&#x442;&#x441;&#x44F;. &#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442;, &#x43A;&#x430;&#x43A; &#x438; &#x432; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x435;, &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; shared object &#x441; PIC, &#x438;&#x437; &#x43D;&#x435;&#x433;&#x43E; &#x432;&#x44B;&#x43A;&#x443;&#x441;&#x44B;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x434; &#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x44C;.</p><br>
<p>&#x421;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x435;&#x43C;&#x2026; &#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x44F;&#x446;&#x438;&#x44F; &#x432;&#x430;&#x43B;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x43C; &#x436;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x435; <code>reloc.c</code> &#x2014; &#x43E;&#x43D;, &#x43F;&#x43E;-&#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x43C;&#x443;, &#x432;&#x437;&#x44F;&#x442; &#x438;&#x437; &#x43A;&#x430;&#x43A;&#x43E;&#x433;&#x43E;-&#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; <code>ld-linux.so</code> &#x438; &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x435;&#x442; &#x437;&#x430; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443; Global Offset Table &#x438; &#x442;.&#x434;. &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; calling conventions &#x434;&#x43B;&#x44F; x86. &#x41E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x432; &#x43D;&#x451;&#x43C; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x43E;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x43F;&#x440;&#x44F;&#x43C;&#x443;&#x44E; &#x441; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x430;&#x43C;&#x438; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x445; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43E;&#x43A;. &#x41D;&#x43E; &#x43C;&#x44B;-&#x442;&#x43E; &#x43D;&#x430; RISC-V &#x2014; &#x43E;&#x43D;-&#x442;&#x43E; &#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43D; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; PIC, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x43C;&#x435;&#x43B;&#x43E; &#x432;&#x44B;&#x43A;&#x438;&#x434;&#x44B;&#x432;&#x430;&#x435;&#x43C; <code>reloc.c</code>. &#x414;&#x430;&#x43B;&#x435;&#x435; &#x442;&#x430;&#x43C; &#x435;&#x449;&#x451; &#x43F;&#x43E;&#x43F;&#x430;&#x434;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x438;, &#x43C;&#x435;&#x441;&#x442;&#x430;&#x43C;&#x438; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x44B;&#x435;. &#x41A; &#x441;&#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;, &#x43E;&#x43D;&#x438; &#x431;&#x44B;&#x43B;&#x438; &#x438;&#x43B;&#x438; &#x432; &#x43A;&#x43E;&#x434;&#x435; &#x442;&#x435;&#x441;&#x442;&#x43E;&#x432; &#x441;&#x440;&#x430;&#x437;&#x443; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x437;&#x430;&#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x43D;&#x430; C, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43E;&#x43D;&#x438; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x438;&#x440;&#x443;&#x44E;&#x442; (&#x438;&#x437; &#x43D;&#x438;&#x445; &#x44F; &#x432;&#x43D;&#x43E;&#x432;&#x44C; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x43F;&#x440;&#x430;&#x432;&#x43D;&#x44B;&#x435; &#x43A;&#x443;&#x441;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x430;, &#x43F;&#x435;&#x440;&#x435;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x43C;&#x44B;&#x435; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43E;&#x439; &#x43F;&#x440;&#x435;&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x430;) &#x438;&#x43B;&#x438; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x435;, &#x431;&#x435;&#x437; &#x447;&#x435;&#x433;&#x43E; &#x432; &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; (&#x43D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435;) &#x43E;&#x431;&#x43E;&#x439;&#x442;&#x438;&#x441;&#x44C; (&#x432;&#x440;&#x43E;&#x434;&#x435; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x44F;-&#x432;&#x44B;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x44D;&#x448;&#x430;, &#x432;&#x44B;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x44F; CPUID &#x438; &#x442;.&#x434;.). &#x41D;&#x430;&#x43A;&#x43E;&#x43D;&#x435;&#x446;, &#x431;&#x44B;&#x43B;&#x438; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x432;&#x435;&#x449;&#x438; &#x442;&#x438;&#x43F;&#x430; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x430; <code>rdtsc</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x44F; &#x431;&#x435;&#x437; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x442;&#x43E;&#x436;&#x435; &#x432;&#x44B;&#x43D;&#x435;&#x441; &#x432; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x44B;&#x439; &#x445;&#x435;&#x434;&#x435;&#x440; &#x438; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43B; &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x435;&#x439; &#x43D;&#x430; RISC-V.</p><br>
<p>&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x441;&#x44F; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433; <code>arch/i386</code>, &#x43A;&#x443;&#x434;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x435;&#x445;&#x430;&#x43B;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x435; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; PCI, &#x447;&#x442;&#x435;&#x43D;&#x438;&#x44F; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x438; &#x438;&#x437; &#x447;&#x438;&#x43F;&#x441;&#x435;&#x442;&#x43E;&#x432;, &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x44B;&#x435; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; memory-mapped &#x430;&#x434;&#x440;&#x435;&#x441;&#x43E;&#x432; &#x438; &#x442;.&#x434;. &#x422;&#x430;&#x43A;&#x436;&#x435; &#x442;&#x443;&#x434;&#x430; &#x443;&#x435;&#x445;&#x430;&#x43B;&#x43E; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; <code>test_start</code>, &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x449;&#x435;&#x435;&#x441;&#x44F; &#x442;&#x43E;&#x447;&#x43A;&#x43E;&#x439; &#x432;&#x445;&#x43E;&#x434;&#x430; &#x438;&#x437; <code>setup.S</code> &#x432; &#x43A;&#x43E;&#x434; &#x43D;&#x430; C. &#x414;&#x43E;&#x43B;&#x433;&#x43E; &#x43B;&#x438;, &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x43E; &#x43B;&#x438;, &#x43D;&#x43E; &#x437;&#x430;&#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x432; &#x432;&#x441;&#x451; &#x447;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438; &#x43F;&#x435;&#x440;&#x435;&#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x432; &#x43F;&#x43E;&#x434; RISC-V &#x432;&#x441;&#x451;, &#x447;&#x442;&#x43E; &#x437;&#x430;&#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x43B;&#x44C;&#x437;&#x44F; (&#x432;&#x440;&#x43E;&#x434;&#x435; <code>setup.S</code> &#x438; &#x43A;&#x43E;&#x434;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x43F;&#x43E;&#x440;&#x442;&#x43E;&#x43C; &#x432; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; SiFive), &#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B; &#x43A;&#x430;&#x442;&#x430;&#x43B;&#x43E;&#x433; <code>arch/riscv</code>, &#x441; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x432;&#x441;&#x451; &#x431;&#x43E;&#x43B;&#x435;&#x435;-&#x43C;&#x435;&#x43D;&#x435;&#x435; &#x441;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C;.</p><br>
<p>&#x422;&#x443;&#x442; &#x44F; &#x432;&#x44B;&#x43D;&#x443;&#x436;&#x434;&#x435;&#x43D; &#x443;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x441;&#x430;&#x43C;&#x438; &#x44D;&#x43A;&#x441;&#x43F;&#x435;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x447;&#x430;&#x441;&#x442;&#x438;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x434;&#x43E; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x430;&#x44F; <em>&#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;</em> &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#xAB;&#x445;&#x443;&#x434;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x44B;&#x43C;&#x44B;&#x441;&#x43B;&#x430;&#xBB;. &#x412;&#x43F;&#x440;&#x43E;&#x447;&#x435;&#x43C;, &#x44F; &#x441;&#x442;&#x430;&#x440;&#x430;&#x44E;&#x441;&#x44C; &#x43A;&#x430;&#x43A; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x443;&#x43C; &#x432;&#x435;&#x441;&#x442;&#x438; &#x438;&#x437;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x43D;&#x43E; &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x43B;&#x43E; &#x43E;&#x434;&#x43D;&#x443; &#x438;&#x437; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x44B;&#x445; &#x442;&#x440;&#x430;&#x435;&#x43A;&#x442;&#x43E;&#x440;&#x438;&#x439; <em>(&#x44F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x441;&#x442;, &#x44F; &#x442;&#x430;&#x43A; &#x43F;&#x43E;&#x43C;&#x43D;&#x44E;)</em>. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C;, &#x43A;&#x430;&#x43A; &#x432;&#x441;&#x451; &#x44D;&#x442;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C;.</p><br>
<h2 id="zapusk-na-zheleze">&#x417;&#x430;&#x43F;&#x443;&#x441;&#x43A; &#x43D;&#x430; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x435;</h2><br>
<p>&#x421;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x451;&#x43D; &#x43F;&#x440;&#x43E;&#x448;&#x43B;&#x44B;&#x445; &#x44D;&#x43A;&#x441;&#x43F;&#x435;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x43F;&#x44B;&#x43B;&#x438;&#x442;&#x441;&#x44F; &#xAB;&#x441;&#x442;&#x435;&#x43D;&#x434;&#xBB; &#x438;&#x437; Raspberry Pi, &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x451;&#x43D;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x441; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43E;&#x447;&#x43D;&#x43E;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x43E;&#x439;. &#x41F;&#x440;&#x43E;&#x432;&#x43E;&#x434;&#x430; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x438;&#x432;&#x430;&#x44E;&#x442; UART, JTAG &#x438; &#x430;&#x434;&#x430;&#x43F;&#x442;&#x435;&#x440; &#x441; SD-&#x43A;&#x430;&#x440;&#x442;&#x43E;&#x447;&#x43A;&#x43E;&#x439;. &#x412; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x443;&#x44E; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x44C; &#x437;&#x430;&#x448;&#x438;&#x442; &#x43D;&#x435;&#x43A;&#x438;&#x439; RV64-&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440; &#x441; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x43B;&#x435;&#x440;&#x43E;&#x43C; DDR2. &#x41A;&#x430;&#x43A; &#x438; &#x432; &#x43F;&#x440;&#x43E;&#x448;&#x43B;&#x44B;&#x435; &#x440;&#x430;&#x437;&#x44B;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E; &#xAB;&#x43C;&#x430;&#x43B;&#x438;&#x43D;&#x43A;&#x443;&#xBB;, &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x44E; &#x434;&#x43E; &#x43D;&#x435;&#x451; &#x434;&#x432;&#x435; SSH-&#x441;&#x435;&#x441;&#x441;&#x438;&#x438;, &#x43E;&#x434;&#x43D;&#x430; &#x438;&#x437; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x440;&#x430;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x442; 3333 &#x43F;&#x43E;&#x440;&#x442; TCP &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F; gdb &#x441; OpenOCD. &#x412; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x438;&#x437; &#x441;&#x435;&#x441;&#x441;&#x438;&#x439; &#x441;&#x442;&#x430;&#x440;&#x442;&#x443;&#x44E; minicom, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x442;&#x44C; &#x437;&#x430; UART, &#x432; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x2014; openocd, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x442;&#x43B;&#x430;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x441; &#x445;&#x43E;&#x441;&#x442;&#x430; &#x43F;&#x43E; JTAG. &#x412;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E; &#x43F;&#x438;&#x442;&#x430;&#x43D;&#x438;&#x435; &#x43F;&#x43B;&#x430;&#x442;&#x44B; &#x2014; &#x438; &#x43F;&#x43E;&#x431;&#x435;&#x436;&#x430;&#x43B;&#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438; &#x43E; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; &#x43E;&#x43D;&#x43E; &#x433;&#x440;&#x443;&#x437;&#x438;&#x442; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x441; SD.</p><br>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443;:</p><br>
<pre><code class="plaintext">riscv64-unknown-elf-gdb \
    -ex &apos;target remote 127.0.0.1:3333&apos; \
    -ex &apos;restore /path/to/memtest_shared.bin binary 0x80010000&apos; \
    -ex &apos;add-symbol-file /path/to/memtest_shared 0x80010000&apos;
    -ex &apos;set $pc=0x80010000&apos;</code></pre><br>
<p>&#x43E;&#x43F;&#x446;&#x438;&#x438; <code>-ex</code> &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443;&#x44E;&#x442; gdb &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x432;&#x438;&#x434;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x432;&#x432;&#x451;&#x43B; &#x44D;&#x442;&#x438; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B; &#x441; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438;:</p><br>
<ul>
<li>&#x43F;&#x435;&#x440;&#x432;&#x430;&#x44F; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x442; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441; OpenOCD</li>
<li>&#x432;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43A;&#x43E;&#x43F;&#x438;&#x440;&#x443;&#x435;&#x442; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x445;&#x43E;&#x441;&#x442;&#x430; &#x43F;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x430;&#x434;&#x440;&#x435;&#x441;&#x443;</li>
<li>&#x442;&#x440;&#x435;&#x442;&#x44C;&#x44F; &#x43E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x44F;&#x435;&#x442; gdb, &#x447;&#x442;&#x43E; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x44E; &#x43E;&#x431; &#x438;&#x441;&#x445;&#x43E;&#x434;&#x43D;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x431;&#x440;&#x430;&#x442;&#x44C; &#x438;&#x437; <em>&#x432;&#x43E;&#x442; &#x44D;&#x442;&#x43E;&#x433;&#x43E;</em> &#x444;&#x430;&#x439;&#x43B;&#x430;, &#x441; &#x443;&#x447;&#x451;&#x442;&#x43E;&#x43C; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43D; &#x43E;&#x431; &#x431;&#x44B;&#x43B; &#x43F;&#x43E; <em>&#x432;&#x43E;&#x442; &#x44D;&#x442;&#x43E;&#x43C;&#x443;</em> &#x430;&#x434;&#x440;&#x435;&#x441;&#x443; (&#x430; &#x43D;&#x435; &#x442;&#x43E;&#x43C;&#x443;, &#x447;&#x442;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x432; &#x43D;&#x451;&#x43C; &#x441;&#x430;&#x43C;&#x43E;&#x43C;)<br>
<ul>
<li>&#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;: &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B; &#x43C;&#x44B; &#x431;&#x435;&#x440;&#x451;&#x43C; &#x438;&#x437; ELF-&#x444;&#x430;&#x439;&#x43B;&#x430;, &#x430; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x435;&#x43C; &#xAB;&#x441;&#x44B;&#x440;&#x43E;&#x439;&#xBB; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x43D;&#x438;&#x43A;</li>
</ul></li>
<li>&#x43D;&#x430;&#x43A;&#x43E;&#x43D;&#x435;&#x446;, &#x447;&#x435;&#x442;&#x432;&#x451;&#x440;&#x442;&#x430;&#x44F; &#x43F;&#x440;&#x438;&#x43D;&#x443;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434;&#x438;&#x442; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x439; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B; &#x43D;&#x430; &#x43D;&#x430;&#x448; &#x43A;&#x43E;&#x434;</li>
</ul><br>
<p>&#x41A; &#x441;&#x43E;&#x436;&#x430;&#x43B;&#x435;&#x43D;&#x438;&#x44E;, &#x43D;&#x435; &#x432;&#x441;&#x451; &#x438;&#x434;&#x451;&#x442; &#x430;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43D;&#x43E; &#x433;&#x43B;&#x430;&#x434;&#x43A;&#x43E;, &#x438; &#x445;&#x43E;&#x442;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x438; &#x43A;&#x43E;&#x434;&#x430; &#x432; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x447;&#x438;&#x43A;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;, &#x43D;&#x43E; &#x432;&#x43E; &#x432;&#x441;&#x435;&#x445; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x2014; &#x43D;&#x443;&#x43B;&#x438;. &#x41D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435;, &#x435;&#x441;&#x43B;&#x438; &#x432; gdb &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443; &#x432;&#x438;&#x434;&#x430; <code>p &amp;global_var</code>, &#x43C;&#x44B;, &#x443;&#x432;&#x44B;, &#x443;&#x432;&#x438;&#x434;&#x438;&#x43C; &#x430;&#x434;&#x440;&#x435;&#x441; &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; &#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x430;&#x434;&#x440;&#x435;&#x441;&#x43E;&#x43C; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; (&#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x2014; <code>0x0</code>), &#x432; &#x43D;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <code>add-symbol-file</code>. &#x41A;&#x430;&#x43A; &#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x44C;&#x43D;&#x43E;&#x435;, &#x43D;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;, &#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x43B; &#x43A; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x430;&#x434;&#x440;&#x435;&#x441;&#x443; <code>0x80010000</code> &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E; &#x438; &#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x43B; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x447;&#x435;&#x440;&#x435;&#x437; <code>x/x 0xADDR</code>. &#x412;&#x43E;&#x43E;&#x431;&#x449;&#x435;-&#x442;&#x43E;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x430;&#x434;&#x440;&#x435;&#x441; &#x432; &#x43B;&#x438;&#x43D;&#x43A;&#x435;&#x440;-&#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x435;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; <em>&#x43D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;</em> &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43E;&#x432;&#x43F;&#x430;&#x434;&#x430;&#x442;&#x44C; &#x441; &#x430;&#x434;&#x440;&#x435;&#x441;&#x43E;&#x43C; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x432; <em>&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x442;&#x435;&#x441;&#x442;&#x43E;&#x432;&#x43E;&#x439; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438;</em>.</p><br>
<h2 id="osobennosti-relokacii-na-sovremennyh-arhitekturah">&#x41E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x440;&#x435;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x430; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x430;&#x445;</h2><br>
<p>&#x425;&#x43E;&#x440;&#x43E;&#x448;&#x43E;, &#x43A;&#x430;&#x43A; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x445;&#x443;&#x434;&#x43E;-&#x431;&#x435;&#x434;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x2014; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C;. &#x41D;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442;. &#x41F;&#x43E;&#x448;&#x430;&#x433;&#x43E;&#x432;&#x430;&#x44F; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x430; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;, &#x447;&#x442;&#x43E; &#x43C;&#x44B; &#x43F;&#x430;&#x434;&#x430;&#x435;&#x43C; &#x432; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; <code>switch_to_main_stack</code> &#x2014; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435;, &#x43E;&#x43D;&#x430; &#x432;&#x441;&#x451;-&#x442;&#x430;&#x43A;&#x438; &#x43F;&#x44B;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x440;&#x435;&#x43B;&#x43E;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;, &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x435;&#x433;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x447;&#x435;&#x43C;&#x443; &#x441;&#x442;&#x435;&#x43A;&#x443;.</p><br>
<p>&#x412;&#x441;&#x451; &#x442;&#x43E;&#x442; &#x436;&#x435; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x442;&#x43E;&#x43C; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438; &#x440;&#x430;&#x441;&#x441;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x43E; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;&#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x44F;&#x445; &#x438; &#x438;&#x445; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x435; &#x441; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x451;&#x43D;&#x43D;&#x44B;&#x43C; &#x438; &#x432;&#x44B;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; PIC:</p><br>
<p><img src="https://habrastorage.org/webt/vj/7-/_u/vj7-_uqmqyqjloo1webrgpqsdc8.png" alt="&#x41D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x441;&#x435;&#x432;&#x434;&#x43E;&#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438; RISC-V"></p><br>
<p>&#x41A;&#x430;&#x43A; &#x432;&#x438;&#x434;&#x438;&#x43C;, &#x43E;&#x431;&#x449;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430; &#x432; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; &#x43E;&#x442;&#x441;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43E;&#x442; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438;, &#x43F;&#x440;&#x438;&#x447;&#x451;&#x43C; &#x43F;&#x435;&#x440;&#x432;&#x430;&#x44F; &#x43F;&#x440;&#x438;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x432;&#x435;&#x440;&#x445;&#x43D;&#x44E;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x441;&#x43C;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F;, &#x430; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x439; <code>add</code> &#x434;&#x43E;&#x448;&#x43B;&#x438;&#x444;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43C;&#x43B;&#x430;&#x434;&#x448;&#x438;&#x435; &#x431;&#x438;&#x442;&#x44B;. &#x415;&#x434;&#x432;&#x430; &#x43B;&#x438; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x43F;&#x43E;&#x43C;&#x43E;&#x436;&#x435;&#x442; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x44A;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x432;&#x440;&#x43E;&#x434;&#x435;</p><br>
<pre><code class="cpp">struct vars * const v = &amp;variables;</code></pre><br>
<p>&#x410; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x431;&#x435;&#x440;&#x451;&#x43C; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E; RISC-V ELF psABI &#x441; <a href="https://github.com/riscv/riscv-elf-psabi-doc/blob/master/riscv-elf.md#relocations" rel="nofollow">&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x432;&#x438;&#x434;&#x43E;&#x432; &#x440;&#x435;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x439;</a> &#x438; &#x43F;&#x438;&#x448;&#x435;&#x43C; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x443;&#x44E; &#x447;&#x430;&#x441;&#x442;&#x44C; &#x434;&#x43B;&#x44F; <code>reloc.c</code>. &#x422;&#x443;&#x442; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x444;&#x430;&#x439;&#x43B;, &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;, &#x431;&#x44B;&#x43B; &#x432;&#x437;&#x44F;&#x442; &#x438;&#x437; &#x43A;&#x440;&#x43E;&#x441;&#x441;-&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430;. &#x422;&#x430;&#x43C; &#x434;&#x430;&#x436;&#x435; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x439; &#x440;&#x430;&#x437;&#x440;&#x44F;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x43C;&#x430;&#x43A;&#x440;&#x43E;&#x441;&#x44B; &#x432;&#x438;&#x434;&#x430; <code>ElfW(Addr)</code>, &#x440;&#x430;&#x441;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x44E;&#x449;&#x438;&#x435;&#x441;&#x44F; &#x432; <code>Elf32_Addr</code> &#x438;&#x43B;&#x438; <code>Elf64_Addr</code>. &#x41D;&#x435; &#x432;&#x435;&#x437;&#x434;&#x435;, &#x43F;&#x440;&#x430;&#x432;&#x434;&#x430;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x438;&#x445;, &#x433;&#x434;&#x435; &#x43E;&#x43D;&#x438; &#x43E;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x442; &#x432; &#x43E;&#x431;&#x449;&#x435;&#x43C; &#x43A;&#x43E;&#x434;&#x435; (&#x430; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x432; &#x43A;&#x43E;&#x434;&#x435; <a href="https://github.com/atrosinenko/memtest86-plus-riscv/blob/master/arch/riscv/reloc.inc.c" rel="nofollow"><code>arch/riscv/reloc.inc.c</code></a> &#x2014; &#x432;&#x441;&#x451;-&#x442;&#x430;&#x43A;&#x438; &#x434;&#x43B;&#x44F; RISC-V &#x43D;&#x435;&#x442; &#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x433;&#x43E; &#x441;&#x43C;&#x44B;&#x441;&#x43B;&#x430; &#x437;&#x430;&#x432;&#x44F;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x443;&#x44E; &#x440;&#x430;&#x437;&#x440;&#x44F;&#x434;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x442;&#x430;&#x43C; &#x433;&#x434;&#x435; &#x44D;&#x442;&#x43E; &#x43D;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F;).</p><br>
<p>&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; <code>switch_to_main_stack</code> &#x43D;&#x430;&#x447;&#x430;&#x43B; &#x43F;&#x440;&#x43E;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; (&#x43D;&#x435; &#x431;&#x435;&#x437; &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x439; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x43E;&#x439; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x438;, &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;). &#x414;&#x435;&#x431;&#x430;&#x433;&#x433;&#x435;&#x440; &#x436;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x43A;&#x440;&#x438;&#x432;&#x43E;. &#x41D;&#x443; &#x438; &#x43B;&#x430;&#x434;&#x43D;&#x43E; :(</p><br>
<h2 id="opredelenie-oborudovaniya">&#x41E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43E;&#x431;&#x43E;&#x440;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;</h2><br>
<p>&#x41A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;, &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x441;&#x442;&#x43E;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x432;&#x44B;&#x43A;&#x438;&#x43D;&#x443;&#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x431;&#x43E;&#x440;&#x443;&#x434;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x437;&#x430;&#x445;&#x430;&#x440;&#x434;&#x43A;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x44B;, &#x43D;&#x43E; &#x43F;&#x43E;&#x434; &#x43A;&#x430;&#x436;&#x434;&#x443;&#x44E; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x443;&#x44E; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x443; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x442;&#x44C; memtest &#x2014; &#x44D;&#x442;&#x43E; &#x434;&#x430;&#x436;&#x435; &#x43F;&#x43E; &#x43C;&#x435;&#x440;&#x43A;&#x430;&#x43C; &#x43C;&#x43E;&#x435;&#x439; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x439; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x447;&#x435;&#x440;&#x435;&#x441;&#x447;&#x443;&#x440; &#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x44C;&#x43D;&#x43E;. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x442;&#x44C; &#xAB;&#x43A;&#x430;&#x43A; &#x432;&#x437;&#x440;&#x43E;&#x441;&#x43B;&#x44B;&#x435; &#x441;&#x435;&#x440;&#x44C;&#x451;&#x437;&#x43D;&#x44B;&#x435; &#x43B;&#x44E;&#x434;&#x438;&#xBB;. &#x41A; &#x441;&#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E;, &#x43D;&#x430; RISC-V (&#x430; &#x43D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435;, &#x438; &#x43D;&#x430; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435; &#x441;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;) &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x43B; &#x43A;&#x43E;&#x434;&#x443; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x43D;&#x430; <a href="https://en.wikipedia.org/wiki/Device_tree" rel="nofollow">Device Tree Blob</a>, &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x439;&#x441;&#x44F; &#x441;&#x43A;&#x43E;&#x43C;&#x43F;&#x438;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x432;&#x435;&#x440;&#x441;&#x438;&#x435;&#x439; DTS-&#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x440;&#x43E;&#x434;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E;:</p><br>
<div class="spoiler"><b class="spoiler_title">zeowaa-1gb.dts</b><div class="spoiler_text"><pre><code class="plaintext">/dts-v1/;

/ {
        #address-cells = ^_^ltgt^_^;
        #size-cells = ^_^ltgt^_^;
        compatible = &quot;freechips,rocketchip-unknown-dev&quot;;
        model = &quot;freechips,rocketchip-unknown&quot;;
        chosen {
        bootargs = &quot;console=ttySIF0,125200 debug loglevel=7&quot;;
    };
        firmware {
        sifive,uboot = &quot;YYYY-MM-DD&quot;;
    };
    L16: aliases {
        serial0 = &amp;L8;
    };
        L15: cpus {
                #address-cells = ^_^ltgt^_^;
                #size-cells = ^_^lt&#xFFFD;gt^_^;
                timebase-frequency = ^_^lt&#xF4240;gt^_^;
                L5: cpu@0 {
                        device_type = &quot;cpu&quot;;
                        clock-frequency = ^_^lt&#xFFFD;gt^_^;
                        compatible = &quot;sifive,rocket0&quot;, &quot;riscv&quot;;
                        d-cache-block-size = ^_^ltgt^_^;
                        d-cache-sets = ^_^lt@gt^_^;
                        d-cache-size = ^_^lt&#x1000;gt^_^;
                        d-tlb-sets = ^_^ltgt^_^;
                        d-tlb-size = ^_^lt gt^_^;
                        i-cache-block-size = ^_^ltgt^_^;
                        i-cache-sets = ^_^lt@gt^_^;
                        i-cache-size = ^_^lt&#x1000;gt^_^;
                        i-tlb-sets = ^_^ltgt^_^;
                        i-tlb-size = ^_^lt gt^_^;
                        mmu-type = &quot;riscv,sv39&quot;;
                        next-level-cache = &lt;&amp;L10&gt;;
                        reg = &lt;0x0&gt;;
                        riscv,isa = &quot;rv64imafdc&quot;;
                        status = &quot;okay&quot;;
                        timebase-frequency = ^_^lt&#xF4240;gt^_^;
                        tlb-split;
                        L3: interrupt-controller {
                                #interrupt-cells = ^_^ltgt^_^;
                                compatible = &quot;riscv,cpu-intc&quot;;
                                interrupt-controller;
                        };
                };
        };
        L10: ram@80000000 {
                device_type = &quot;memory&quot;;
        reg = &lt;0x0 0x80000000 0x0 0x40000000&gt;;
        reg-names = &quot;mem&quot;;
    };
        L14: soc {
                #address-cells = ^_^ltgt^_^;
                #size-cells = ^_^ltgt^_^;
                compatible = &quot;freechips,rocketchip-unknown-soc&quot;, &quot;simple-bus&quot;;
                ranges;
                L1: clint@2000000 {
                        compatible = &quot;riscv,clint0&quot;;
                        interrupts-extended = &lt;&amp;L3 3 &amp;L3 7&gt;;
                        reg = &lt;0x2000000 0x10000&gt;;
                        reg-names = &quot;control&quot;;
                };
                L2: debug-controller@0 {
                        compatible = &quot;sifive,debug-013&quot;, &quot;riscv,debug-013&quot;;
                        interrupts-extended = &lt;&amp;L3 65535&gt;;
                        reg = &lt;0x0 0x1000&gt;;
                        reg-names = &quot;control&quot;;
                };
                L9: gpio@64002000 {
                        #gpio-cells = ^_^ltgt^_^;
                        #interrupt-cells = ^_^ltgt^_^;
                        compatible = &quot;sifive,gpio0&quot;;
                        gpio-controller;
                        interrupt-controller;
                        interrupt-parent = &lt;&amp;L0&gt;;
                        interrupts = &lt;3 4 5 6 7 8&gt;;
                        reg = &lt;0x64002000 0x1000&gt;;
                        reg-names = &quot;control&quot;;
                };
                L0: interrupt-controller@c000000 {
                        #interrupt-cells = ^_^ltgt^_^;
                        compatible = &quot;riscv,plic0&quot;;
                        interrupt-controller;
                        interrupts-extended = &lt;&amp;L3 11 &amp;L3 9&gt;;
                        reg = &lt;0xc000000 0x4000000&gt;;
                        reg-names = &quot;control&quot;;
                        riscv,max-priority = ^_^ltgt^_^;
                        riscv,ndev = ^_^ltgt^_^;
                };
                L6: rom@10000 {
                        compatible = &quot;sifive,maskrom0&quot;;
                        reg = &lt;0x10000 0x2000&gt;;
                        reg-names = &quot;mem&quot;;
                };
                L8: serial@64000000 {
                        compatible = &quot;sifive,uart0&quot;;
                        interrupt-parent = &lt;&amp;L0&gt;;
                        clocks = &lt;&amp;tlclk&gt;;
                        interrupts = ^_^ltgt^_^;
                        reg = &lt;0x64000000 0x1000&gt;;
                        reg-names = &quot;control&quot;;
                };
                L7: spi@64001000 {
                        #address-cells = ^_^ltgt^_^;
                        #size-cells = ^_^lt&#xFFFD;gt^_^;
                        compatible = &quot;sifive,spi0&quot;;
                        interrupt-parent = &lt;&amp;L0&gt;;
                        interrupts = ^_^ltgt^_^;
                        reg = &lt;0x64001000 0x1000&gt;;
                        clocks = &lt;&amp;tlclk&gt;;
                        reg-names = &quot;control&quot;;
                        L12: mmc@0 {
                                compatible = &quot;mmc-spi-slot&quot;;
                                disable-wp;
                                reg = &lt;0x0&gt;;
                                spi-max-frequency = ^_^lt&#xFFFD;gt^_^;
                                voltage-ranges = &lt;3300 3300&gt;;
                        };
                };
                tlclk: tlclk {
                        #clock-cells = ^_^lt&#xFFFD;gt^_^;
                        clock-frequency = ^_^lt&#xFFFD;gt^_^;
                        clock-output-names = &quot;tlclk&quot;;
                        compatible = &quot;fixed-clock&quot;;
                };
        };
};</code></pre></div></div><br>
<p>&#x41A;&#x43E;&#x433;&#x434;&#x430;-&#x442;&#x43E; &#x44F; &#x443;&#x436;&#x435; &#x440;&#x430;&#x437;&#x431;&#x438;&#x440;&#x430;&#x43B; ELF-&#x444;&#x430;&#x439;&#x43B;&#x44B;, &#x430; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; &#x441; FDT (flat device tree) &#x432;&#x43D;&#x43E;&#x432;&#x44C; &#x443;&#x431;&#x435;&#x436;&#x434;&#x430;&#x44E;&#x441;&#x44C;: &#x44D;&#x442;&#x438; <a href="https://github.com/devicetree-org/devicetree-specification/releases/download/v0.2/devicetree-specification-v0.2.pdf" rel="nofollow">&#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438;</a> &#x43F;&#x438;&#x448;&#x443;&#x442; <em>&#x434;&#x43E;&#x431;&#x440;&#x44B;&#x435; &#x437;&#x430;&#x431;&#x43E;&#x442;&#x43B;&#x438;&#x432;&#x44B;&#x435; &#x43B;&#x44E;&#x434;&#x438;</em> <del>(&#x435;&#x449;&#x451; &#x431;&#x44B;, &#x438;&#x43C; &#x436;&#x435; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x44D;&#x442;&#x43E; &#x441;&#x430;&#x43C;&#x438;&#x43C; &#x43F;&#x430;&#x440;&#x441;&#x438;&#x442;&#x44C;!)</del> &#x438; &#x440;&#x430;&#x437;&#x431;&#x43E;&#x440; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; (&#x43F;&#x43E; &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435;&#x439; &#x43C;&#x435;&#x440;&#x435;, &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x434;&#x43E;&#x432;&#x435;&#x440;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x432;&#x432;&#x43E;&#x434;) &#x43E;&#x441;&#x43E;&#x431;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C; &#x43D;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;. &#x422;&#x430;&#x43A; &#x438; &#x437;&#x434;&#x435;&#x441;&#x44C;: &#x432; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x438;&#x434;&#x451;&#x442; &#x43D;&#x435;&#x445;&#x438;&#x442;&#x440;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x430;-&#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x43A;, &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x430;&#x449;&#x430;&#x44F; magic number <code>0xd00dfeed</code> &#x438; &#x435;&#x449;&#x451; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x43E;&#x43B;&#x435;&#x439;. &#x41D;&#x430;&#x441; &#x438;&#x437; &#x43D;&#x438;&#x445; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x443;&#x44E;&#x442; &#x441;&#x43C;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x435; &#xAB;&#x43F;&#x43B;&#x43E;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x434;&#x435;&#x440;&#x435;&#x432;&#x430;&#xBB; <code>off_dt_struct</code> &#x438; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x44B; &#x441;&#x442;&#x440;&#x43E;&#x43A; <code>off_dt_strings</code>. &#x412;&#x43E;&#x43E;&#x431;&#x449;&#x435;-&#x442;&#x43E;, &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x435;&#x449;&#x451; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; <code>off_mem_rsvmap</code>, &#x43F;&#x435;&#x440;&#x435;&#x447;&#x438;&#x441;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x435; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x43D;&#x435; &#x441;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F;. &#x42F; &#x438;&#x445; &#x43F;&#x43E;&#x43A;&#x430; &#x438;&#x433;&#x43D;&#x43E;&#x440;&#x438;&#x440;&#x443;&#x44E; (&#x43D;&#x430; &#x43C;&#x43E;&#x435;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x435; &#x438;&#x445; &#x43D;&#x435;&#x442;), &#x43D;&#x43E; <strong>&#x43D;&#x435; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x44F;&#x439;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x43C;&#x430;</strong>.</p><br>
<p>&#x412; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x435;, &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x430; &#x43D;&#x435; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x433;&#x43E; &#x442;&#x440;&#x443;&#x434;&#x430;: &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x438;&#x434;&#x442;&#x438; &#x43F;&#x43E; &#x43F;&#x43B;&#x43E;&#x441;&#x43A;&#x43E;&#x43C;&#x443; &#x434;&#x435;&#x440;&#x435;&#x432;&#x443; &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; &#x442;&#x43E;&#x43A;&#x435;&#x43D;&#x430;&#x43C;&#x438;. <em>&#x41A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x44B;&#x445;</em> &#x442;&#x43E;&#x43A;&#x435;&#x43D;&#x43E;&#x432; &#x442;&#x440;&#x438;:</p><br>
<ul>
<li><code>FDT_BEGIN_NODE</code> &#x2014; &#x432; extra data, &#x43D;&#x435;&#x43F;&#x43E;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x435;&#x43C; &#x437;&#x430; &#x43D;&#x438;&#x43C;, &#x438;&#x434;&#x451;&#x442; &#x438;&#x43C;&#x44F; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x435;&#x432;&#x430; &#x432; &#x432;&#x438;&#x434;&#x435; &#x43D;&#x443;&#x43B;&#x44C;-&#x442;&#x435;&#x440;&#x43C;&#x438;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x438;&#x43C;&#x44F; &#x43D;&#x430; &#x441;&#x442;&#x435;&#x43A;</li>
<li><code>FDT_END_NODE</code> &#x2014; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x435;&#x432;&#x43E; &#x437;&#x430;&#x43A;&#x43E;&#x43D;&#x447;&#x438;&#x43B;&#x43E;&#x441;&#x44C;, &#x441;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x43C; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x441;&#x43E; &#x441;&#x442;&#x435;&#x43A;&#x430;</li>
<li><code>FDT_PROP</code> &#x2014; &#x442;&#x443;&#x442; &#x43C;&#x430;&#x43B;&#x43E;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x445;&#x438;&#x442;&#x440;&#x435;&#x435;: &#x437;&#x430; &#x43D;&#x438;&#x43C; &#x438;&#x434;&#x451;&#x442; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x430;, &#x437;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x438;&#x434;&#x451;&#x442; len &#x431;&#x430;&#x439;&#x442;&#x43E;&#x432; extra data. &#x418;&#x43C;&#x44F; &#x436;&#x435; &#xAB;&#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x439;&#xBB; &#x43B;&#x435;&#x436;&#x438;&#x442; &#x43F;&#x43E; &#x441;&#x43C;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44E; <code>nameoff</code> &#x432; string table<br>
<pre><code class="cpp">struct {
uint32_t len;
uint32_t nameoff;
}</code></pre></li>
</ul><br>
<p>&#x41D;&#x443;, &#x432; &#x43E;&#x431;&#x449;&#x435;&#x43C;, &#x438; &#x432;&#x441;&#x451;: &#x438;&#x434;&#x451;&#x43C; &#x43F;&#x43E; &#x44D;&#x442;&#x43E;&#x439; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x438;, &#x43D;&#x435; &#x437;&#x430;&#x431;&#x44B;&#x432;&#x430;&#x44F; &#x441;&#x43E;&#x431;&#x43B;&#x44E;&#x434;&#x430;&#x442;&#x44C; &#x432;&#x44B;&#x440;&#x430;&#x432;&#x43D;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430; 4 &#x431;&#x430;&#x439;&#x442;&#x430;. &#x410;&#x445; &#x434;&#x430;, &#x43B;&#x43E;&#x436;&#x43A;&#x430; &#x434;&#x451;&#x433;&#x442;&#x44F;: &#x447;&#x438;&#x441;&#x43B;&#x430; &#x432; FDT &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x44B; &#x432; big endian &#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#x435;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x435;&#x43D;&#x44C;&#x43A;&#x443;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E;</p><br>
<pre><code class="cpp">static inline uint32_t be32(uint32_t x)
{
    return (x &lt;&lt; 24) | (x &gt;&gt; 24) | ((x &amp; 0xff0000) &gt;&gt; 8) | ((x &amp; 0xff00) &lt;&lt; 8);
}</code></pre><br>
<p>&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x432; <code>riscv_entry</code> &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x43C; &#x434;&#x435;&#x43B;&#x43E;&#x43C; &#x43D;&#x430;&#x434;&#x43E; &#x440;&#x430;&#x441;&#x43F;&#x430;&#x440;&#x441;&#x438;&#x442;&#x44C; FDT, &#x430; &#x447;&#x430;&#x441;&#x442;&#x44C; <code>head.S</code>, &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x44E;&#x449;&#x430;&#x44F; &#x437;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x443; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x430; <code>riscv_entry</code>, &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x442;&#x430;&#x43A;</p><br>
<pre><code class="plaintext">    .globl startup_32
# &#x41D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; -- &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D;&#x430;&#x43C;...
startup_32:
    lla sp, boot_stack_top

    mv s0, a0 # s0, s1 -- callee-saved
    mv s1, a1

# ... &#x447;&#x438;&#x441;&#x442;&#x438;&#x43C; .bss

# &#x412;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x440;&#x435;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x44E;
    jal _dl_start
# &#x41F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x43C; &#x43D;&#x430; &#x448;&#x442;&#x430;&#x442;&#x43D;&#x443;&#x44E; &#x442;&#x43E;&#x447;&#x43A;&#x443; &#x432;&#x445;&#x43E;&#x434;&#x430;
    mv a0, s0
    mv a1, s1
    j riscv_entry</code></pre><br>
<p>&#x412; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x435; <code>a0</code> &#x43D;&#x430;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442;&#x441;&#x44F; hart id (hart &#x2014; &#x44D;&#x442;&#x43E; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x432;&#x440;&#x43E;&#x434;&#x435; &#x430;&#x43F;&#x43F;&#x430;&#x440;&#x430;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x43A;&#x430; &#x432; &#x442;&#x435;&#x440;&#x43C;&#x438;&#x43D;&#x43E;&#x43B;&#x43E;&#x433;&#x438;&#x438; RISC-V) &#x2014; &#x435;&#x433;&#x43E; &#x44F; &#x43F;&#x43E;&#x43A;&#x430; &#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;, &#x43C;&#x43D;&#x435; &#x431;&#x44B; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x440;&#x430;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F;. &#x412; <code>a1</code> &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A; &#x43A;&#x43B;&#x430;&#x434;&#x451;&#x442; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x43D;&#x430; FDT. &#x415;&#x433;&#x43E; &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; <code>void riscv_entry(ulong hartid, uint8_t *fdt_address)</code>.</p><br>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C;, &#x441; &#x43F;&#x43E;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x43F;&#x430;&#x440;&#x441;&#x438;&#x43B;&#x43A;&#x438; FDT &#x432; &#x43C;&#x43E;&#x451;&#x43C; &#x43A;&#x43E;&#x434;&#x435;, &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x43F;&#x43B;&#x430;&#x442;&#x44B; &#x441;&#x442;&#x430;&#x43B;&#x430; &#x442;&#x430;&#x43A;&#x43E;&#x439;:</p><br>
<ul>
<li>&#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x44C; &#x43F;&#x438;&#x442;&#x430;&#x43D;&#x438;&#x435;</li>
<li>&#x434;&#x43E;&#x436;&#x434;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438; U-Boot</li>
<li>&#x432;&#x432;&#x435;&#x441;&#x442;&#x438; &#x432; &#x43D;&#x435;&#x439; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x440;&#x438;&#x433;&#x43E;&#x442;&#x43E;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; FDT. &#x412; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x432; &#x43B;&#x438;&#x441;&#x442;&#x435; <code>/chosen/bootargs</code> &#x445;&#x440;&#x430;&#x43D;&#x438;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x430; &#x44F;&#x434;&#x440;&#x430;. &#x412;&#x441;&#x451; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x435;, &#x447;&#x442;&#x43E; &#x44F; &#x431;&#x435;&#x440;&#x443; &#x438;&#x437; FDT &#x2014; &#x434;&#x438;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D; RAM, &#x430;&#x434;&#x440;&#x435;&#x441; UART,&#x2026; &#x2014; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C;, &#x43A;&#x430;&#x43A; &#x435;&#x441;&#x442;&#x44C;<br>
<pre><code class="plaintext">run fdtsetup
fdt set /chosen bootargs &quot;console=ttyS0 btrace&quot;</code></pre></li>
<li>&#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B; <code>fdt addr</code> &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C; &#x430;&#x434;&#x440;&#x435;&#x441; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; FDT, &#x435;&#x441;&#x43B;&#x438; &#x435;&#x449;&#x451; &#x43D;&#x435; &#x441;&#x43C;&#x43E;&#x442;&#x440;&#x435;&#x43B;&#x438;</li>
</ul><br>
<p>&#x410; &#x441;&#x43E; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x44B; gdb &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x430;</p><br>
<ul>
<li><code>-ex &apos;set $a1=0xfdtaddr&apos;</code></li>
</ul><br>
<h2 id="vyvod-informacii-na-ekran">&#x412;&#x44B;&#x432;&#x43E;&#x434; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x430; &#x44D;&#x43A;&#x440;&#x430;&#x43D;</h2><br>
<p>&#x41A;&#x430;&#x43A; &#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x43A;&#x440;&#x43E;&#x43C;&#x435; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x445; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43E;&#x43A; &#x435;&#x441;&#x442;&#x44C; &#x435;&#x449;&#x451; &#x438; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x435; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440; <code>SCREEN_ADR</code> (&#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x442;&#x430;&#x43A;, &#x441; &#x43E;&#x434;&#x43D;&#x43E;&#x439; <code>D</code>), &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C;, &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x443;&#x44E; &#x442;&#x43E;&#x43C;&#x443;, &#x447;&#x442;&#x43E; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x430; &#x44D;&#x43A;&#x440;&#x430;&#x43D;. &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x44F; &#x43D;&#x430; &#x44D;&#x442;&#x43E; &#x43D;&#x430;&#x442;&#x43A;&#x43D;&#x443;&#x43B;&#x441;&#x44F;, &#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43B; &#x448;&#x438;&#x440;&#x43E;&#x43A;&#x438;&#x43C; &#x436;&#x435;&#x441;&#x442;&#x43E;&#x43C; &#x432;&#x441;&#x451;, &#x447;&#x442;&#x43E; &#x43D;&#x430; &#x43D;&#x435;&#x433;&#x43E; &#x441;&#x441;&#x44B;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x43F;&#x43E;&#x434; <code>#if HAS_SCREEN</code>, &#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x434;&#x43E;&#x43B;&#x433;&#x43E; &#x43E;&#x442;&#x43B;&#x430;&#x436;&#x438;&#x432;&#x430;&#x43B; &#x432;&#x441;&#x43B;&#x435;&#x43F;&#x443;&#x44E;. &#x414;&#x443;&#x43C;&#x430;&#x43B; &#x443;&#x436;&#x435; &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E; &#x440;&#x430;&#x437; &#x432; &#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E;-&#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x432;&#x44B;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43C;&#x43F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;, &#x43D;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x43B; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x442; &#x436;&#x435; &#x43A;&#x43E;&#x434; &#x443;&#x436; &#x431;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; escape-&#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x435;&#x439; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x438;&#x442; &#x432; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x440;&#x442;. &#x41E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x432;&#x441;&#x451; &#x443;&#x436;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x434;&#x43E; &#x43D;&#x430;&#x441;, &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x430;&#x43A;&#x43A;&#x443;&#x440;&#x430;&#x442;&#x43D;&#x435;&#x435; &#x440;&#x430;&#x441;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x434;&#x435;&#x444;&#x430;&#x439;&#x43D;&#x44B; &#x2014; &#x438; &#x432;&#x43E;&#x442; &#x43E;&#x43D;, &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44B;&#x439; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; (&#x43F;&#x440;&#x430;&#x432;&#x434;&#x430;, &#x447;&#x451;&#x440;&#x43D;&#x43E;-&#x431;&#x435;&#x43B;&#x44B;&#x439;) &#x432; &#x43E;&#x43A;&#x43D;&#x435; minicom&apos;&#x430;! (&#x41D;&#x430; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; HAS_SCREEN &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x2014; &#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x432;&#x451;&#x43B; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432; <code>dummy_con</code>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x443;&#x43C;&#x443; &#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x438;&#x437;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x434;.)</p><br>
<h2 id="otladka-na-qemu">&#x41E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x430; &#x43D;&#x430; QEMU</h2><br>
<p>&#x422;&#x430;&#x43A; &#x44F; &#x438; &#x43E;&#x442;&#x43B;&#x430;&#x436;&#x438;&#x432;&#x430;&#x43B; &#x432;&#x441;&#x451; &#x43D;&#x430; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x435;, &#x430; &#x441; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43F;&#x43E;&#x440; &#x2014; &#x434;&#x430;&#x436;&#x435; &#x43D;&#x435; &#x432;&#x441;&#x43B;&#x435;&#x43F;&#x443;&#x44E;. &#x41D;&#x43E; &#x432;&#x43E;&#x442; &#x442;&#x43E;&#x440;&#x43C;&#x43E;&#x437;&#x438;&#x442; &#x432;&#x441;&#x451; &#x43F;&#x43E; JTAG &#x2014; &#x436;&#x443;&#x442;&#x44C;! &#x427;&#x442;&#x43E; &#x436;&#x435;, &#x432; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x432;&#x441;&#x451; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x435;, &#x43D;&#x43E; &#x432;&#x43E;&#x442; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x443; &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x432;&#x435;&#x441;&#x442;&#x438; &#x43D;&#x430; QEMU. &#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x430; &#x44D;&#x43A;&#x441;&#x43F;&#x435;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x44C;&#x43D;&#x43E;&#x435;, &#x43D;&#x43E; &#x432;&#x435;&#x441;&#x44C;&#x43C;&#x430; &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435;&#x435; &#x43D;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; &#x441; &#x43F;&#x43B;&#x430;&#x442;&#x43E;&#x439;:</p><br>
<pre><code class="plaintext">$ qemu-system-riscv64 -M help
Supported machines are:
none                 empty machine
sifive_e             RISC-V Board compatible with SiFive E SDK
sifive_u             RISC-V Board compatible with SiFive U SDK
spike_v1.10          RISC-V Spike Board (Privileged ISA v1.10) (default)
spike_v1.9.1         RISC-V Spike Board (Privileged ISA v1.9.1)
virt                 RISC-V VirtIO Board (Privileged ISA v1.10)</code></pre><br>
<p>&#x421;&#x43C;&#x43E;&#x442;&#x440;&#x438;&#x43C;, &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x43F;&#x43B;&#x430;&#x442;&#x44B; &#x433;&#x43E;&#x442;&#x43E;&#x432; &#x44D;&#x43C;&#x443;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; QEMU. &#x41C;&#x435;&#x43D;&#x44F; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x435;&#x441;&#x443;&#x435;&#x442; <code>sifive_u</code>-&#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x43E;&#x435; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x43E;.</p><br>
<pre><code class="plaintext">$ qemu-system-riscv64 -M sifive_u,dumpdtb -m 1g # &#x41F;&#x43E;&#x447;&#x435;&#x43C;&#x443;-&#x442;&#x43E; QEMU &#x43F;&#x438;&#x448;&#x435;&#x442; &#x432; &#x444;&#x430;&#x439;&#x43B; &#x441; &#x438;&#x43C;&#x435;&#x43D;&#x435;&#x43C; on -- &#x431;&#x435;&#x437; strace &#x43D;&#x435; &#x440;&#x430;&#x437;&#x431;&#x435;&#x440;&#x451;&#x448;&#x44C;&#x441;&#x44F;
$ ls -l on
-rw-rw-r-- 1 trosinenko trosinenko 1923 &#x44F;&#x43D;&#x432; 19 20:14 on
$ dtc -I dtb &lt; on &gt; on.dts # &#x414;&#x435;&#x43A;&#x43E;&#x434;&#x438;&#x440;&#x443;&#x435;&#x43C; &#x444;&#x430;&#x439;&#x43B;
$ vim on.dts # &#x41F;&#x43E;&#x434;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x43C; bootargs
$ dtc &lt; on.dts &gt; on.dtb
&lt;stdout&gt;: Warning (clocks_property): /soc/ethernet@100900fc:clocks: cell 0 is not a phandle reference
&lt;stdout&gt;: Warning (clocks_property): /soc/ethernet@100900fc:clocks: cell 1 is not a phandle reference
&lt;stdout&gt;: Warning (clocks_property): /soc/ethernet@100900fc:clocks: cell 2 is not a phandle reference
&lt;stdout&gt;: Warning (interrupts_extended_property): /soc/interrupt-controller@c000000:interrupts-extended: cell 0 is not a phandle reference
&lt;stdout&gt;: Warning (interrupts_extended_property): /soc/interrupt-controller@c000000:interrupts-extended: cell 2 is not a phandle reference
&lt;stdout&gt;: Warning (interrupts_extended_property): /soc/clint@2000000:interrupts-extended: cell 0 is not a phandle reference
&lt;stdout&gt;: Warning (interrupts_extended_property): /soc/clint@2000000:interrupts-extended: cell 2 is not a phandle reference</code></pre><br>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x443; &#x43D;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#xAB;&#x438;&#x441;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x439;&#xBB; device tree blob. <strong>&#x41D;&#x435; &#x43C;&#x435;&#x43D;&#x44F;&#x44F; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; &#x412;&#x41C;</strong> (&#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x438;!), &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C;:</p><br>
<pre><code class="plaintext">qemu-system-riscv64 \
    -M sifive_u -m 1g \
    -serial stdio \
    -s -S</code></pre><br>
<p><code>-serial stdio</code> &#x43F;&#x435;&#x440;&#x435;&#x430;&#x434;&#x440;&#x435;&#x441;&#x443;&#x435;&#x442; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x43E;&#x440;&#x442; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x44C;, &#x432;&#x435;&#x434;&#x44C; &#x431;&#x443;&#x434;&#x443;&#x442; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; escape-&#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x41E;&#x43F;&#x446;&#x438;&#x438; <code>-s -S</code> &#x43F;&#x43E;&#x434;&#x43D;&#x438;&#x43C;&#x430;&#x44E;&#x442; gdbserver &#x438; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x44E;&#x442; VM &#x43D;&#x430; &#x43F;&#x430;&#x443;&#x437;&#x435;, &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;. &#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; <code>loader</code>, &#x43D;&#x43E; &#x442;&#x43E;&#x433;&#x434;&#x430; &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x44C; QEMU &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x440;&#x430;&#x437;.</p><br>
<p>&#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E;</p><br>
<pre><code class="plaintext">riscv64-unknown-elf-gdb \
    -ex &apos;target remote 127.0.0.1:1234&apos; \
    -ex &apos;restore /path/to/on.dtb binary 0x80100000&apos; \
    -ex &apos;restore /path/to/memtest_shared.bin binary 0x80020000&apos; \
    -ex &apos;add-symbol-file memtest_shared 0x80100000&apos; \
    -ex &apos;set $a1=0x80020000&apos; \
    -ex &apos;set $pc=0x80100000&apos;</code></pre><br>
<p>&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x432;&#x441;&#x451; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x435;&#x435;, &#x447;&#x435;&#x43C; &#x448;&#x443;&#x441;&#x442;&#x440;&#x43E;!</p><br>
<h2 id="obschiy-princip-raboty">&#x41E;&#x431;&#x449;&#x438;&#x439; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;</h2><br>
<p>&#x41C;&#x43D;&#x43E;&#x433;&#x438;&#x435;, &#x43D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435;, &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x44E;&#x442;, &#x43D;&#x43E; &#x443; Memtest86+ &#x435;&#x441;&#x442;&#x44C; &#x440;&#x435;&#x436;&#x438;&#x43C; <code>btrace</code>, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43E;&#x43D; &#x43F;&#x43E; &#x446;&#x438;&#x43A;&#x43B;&#x443; &#x43F;&#x438;&#x448;&#x435;&#x442; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x43E;&#x43D; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x441;&#x435;&#x439;&#x447;&#x430;&#x441; (&#x441;&#x43D;&#x438;&#x43C;&#x43E;&#x43A; &#x438;&#x437; &#x442;&#x435;&#x440;&#x43C;&#x438;&#x43D;&#x430;&#x43B;&#x430;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x438;&#x434;&#x451;&#x442; &#x432;&#x44B;&#x432;&#x43E;&#x434; QEMU):</p><br>
<p><img src="https://habrastorage.org/webt/su/lr/qh/sulrqhzmiona327osxqzaikijf0.png" alt="btrace mode"></p><br>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x430;&#x43A; &#x443;&#x434;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x438;&#x43D;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;, memtest &#x43D;&#x430;&#x447;&#x430;&#x43B; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x43A;&#x43E;&#x43D;&#x441;&#x43E;&#x43B;&#x438; &#x441;&#x432;&#x43E;&#x451; &#x43E;&#x43A;&#x43D;&#x43E; &#x438; &#x43F;&#x430;&#x434;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x442;&#x435;&#x441;&#x442;&#x430;&#x445;. &#x418;&#x43D;&#x43E;&#x433;&#x434;&#x430; &#x43E;&#x43D; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x43B; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x43E;&#x435; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x438;&#x43B; &#x43C;&#x43E;&#x439; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A; &#x43F;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x439; (&#x442;&#x43E;&#x447;&#x43D;&#x435;&#x435;, trap): &#x435;&#x441;&#x43B;&#x438; &#x43F;&#x440;&#x438;&#x433;&#x43B;&#x44F;&#x434;&#x435;&#x442;&#x44C;&#x441;&#x44F;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x445; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x439;, &#x447;&#x442;&#x43E; &#x443; QEMU &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x44C;-&#x442;&#x43E; &#x431;&#x438;&#x442;&#x430;&#x44F;! &#x443;&#x432;&#x438;&#x434;&#x435;&#x442;&#x44C; &#xAB;&#x437;&#x430;&#x43F;&#x43B;&#x430;&#x442;&#x43A;&#x443;&#xBB; &#x441; &#x43D;&#x430;&#x434;&#x43F;&#x438;&#x441;&#x44C;&#x44E; <code>Illegal instruction</code> &#x438; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430;&#x43C;&#x438;, &#x432;&#x44B;&#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x438;&#x437; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x43E;&#x432;. &#x417;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443; &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x435;&#x442; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440; <code>mcause</code> (&#x43F;&#x43E;&#x447;&#x435;&#x43C;&#x443;?), &#x437;&#x430; &#x432;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x2014; <code>mepc</code> (&#x433;&#x434;&#x435;?), &#x437;&#x430; &#x442;&#x440;&#x435;&#x442;&#x44C;&#x44E; &#x2014; <code>mtval</code> (&#x432; &#x441;&#x432;&#x44F;&#x437;&#x438; &#x441; &#x43A;&#x430;&#x43A;&#x438;&#x43C; &#x430;&#x434;&#x440;&#x435;&#x441;&#x43E;&#x43C;?), &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x430;&#x43A;&#x442;&#x443;&#x430;&#x43B;&#x435;&#x43D; &#x43D;&#x435; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430;.</p><br>
<p><img src="https://habrastorage.org/webt/lc/is/ho/lcishowkkjngpnorx_gkyav-svg.png" alt="Illegal instruction"></p><br>
<p>&#x412; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x435;&#x439;&#x448;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;, &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x430; &#x43E;&#x448;&#x438;&#x431;&#x43E;&#x43A; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x435;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x442;&#x430;&#x43A;:</p><br>
<p><strong>head.S:</strong></p><br>
<pre><code class="plaintext"># &#x41F;&#x440;&#x438; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x440;&#x435;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x432;&#x44B;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x43C; &#x430;&#x434;&#x440;&#x435;&#x441; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;
# &#x41C;&#x43B;&#x430;&#x434;&#x448;&#x438;&#x439; &#x431;&#x438;&#x442; = 0 --- &#x43E;&#x434;&#x438;&#x43D; &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x435;&#x445;, &#x43D;&#x435; &#x432;&#x435;&#x43A;&#x442;&#x43E;&#x440;
# &#x412; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x435;, &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x435; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x439;, &#x43D;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x43E; &#x433;&#x440;&#x443;&#x441;&#x442;&#x43D;&#x43E;&#x43C;...
    lla t1, _trap_entry
    csrw mtvec, t1
# ...
_trap_entry:
    csrr a0, mcause
    csrr a1, mepc
    csrr a2, mtval
    jal riscv_trap_entry</code></pre><br>
<p>&#x410; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x430;&#x43A;&#x43A;&#x443;&#x440;&#x430;&#x442;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x43B;&#x43E;&#x436;&#x438;&#x43B;&#x438; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; calling convention, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C;. &#x418;&#x434;&#x435;&#x44F; &#x441; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;&#x43E;&#x43C; &#x441;&#x442;&#x440;&#x43E;&#x43A; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43B;&#x430;&#x441;&#x44C; &#x438; &#x432; memtest, &#x438; &#x432; &#x43A;&#x43E;&#x434;&#x435; HiFive_U-Boot, &#x430; &#x441;&#x430;&#x43C;&#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x432;&#x437;&#x44F;&#x442;&#x44B; &#x438;&#x437; <code>Volume II</code>:</p><br>
<p><strong>arch.c:</strong></p><br>
<pre><code class="cpp">static const char *errors[] = {
    &quot;Instruction address misaligned&quot;,
    &quot;Instruction access fault&quot;,
    &quot;Illegal instruction&quot;,
    &quot;Breakpoint&quot;,
    &quot;Load address misaligned&quot;,
    &quot;Load access fault&quot;,
    &quot;Store/AMO address misaligned&quot;,
    &quot;Store/AMO access fault&quot;,
    ^_^quotquot^_^, ^_^quot	quot^_^, ^_^quot
quot^_^, ^_^quotquot^_^,
    &quot;Instruction page fault&quot;,
    &quot;Load page fault&quot;,
    ^_^quotquot^_^,
    &quot;Store/AMO page fault&quot;,
};

void riscv_trap_entry(ulong cause, ulong epc, ulong tval)
{
    char buf[32];

    cprint(12, 0, &quot;EXCP:                                  &quot;);
    if (cause &lt; sizeof(errors) / sizeof(errors[0])) {
        cprint(12, 8, errors[cause]);
    } else {
        itoa(buf, cause);
        cprint(12, 8, buf);
    }

    cprint(13, 0, &quot;PC:                                    &quot;);
    hprint3(13, 8, epc, 8);

    cprint(14, 0, &quot;Addr:                                  &quot;);
    hprint3(14, 8, tval, 8);

    HALT();
}</code></pre><br>
<p>&#x41E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x434;&#x43B;&#x438;&#x438;&#x438;&#x438;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x438; &#x441; &#x43F;&#x440;&#x43E;&#x431;&#x435;&#x43B;&#x430;&#x43C;&#x438; &#x2014; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#xAB;&#x440;&#x430;&#x441;&#x447;&#x438;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x441;&#x442;&#x43E;&#xBB; &#x43F;&#x43E;&#x434; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F;. &#x412; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;, &#x43E;&#x43D;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x438;&#x448;&#x443;&#x442; &#xAB;&#x43F;&#x43E;&#x434;&#x43B;&#x43E;&#x436;&#x43A;&#x443;&#xBB; &#x440;&#x43E;&#x432;&#x43D;&#x43E; &#x43F;&#x43E; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x434;&#x43B;&#x438;&#x43D;&#x435;, &#x438; &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430; &#x43D;&#x435; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x43E;, &#x433;&#x434;&#x435; &#x433;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x430;.</p><br>
<p>&#x412; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445; &#x432;&#x441;&#x451; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43D;&#x435; &#x442;&#x430;&#x43A; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;: &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x43E;&#x442;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442;. &#x41E;&#x434;&#x43D;&#x430; &#x438;&#x437; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x447;&#x438;&#x43D; &#x437;&#x430;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; memtest &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x443;&#x43F;&#x43E;&#x440;&#x43D;&#x44B;&#x439;: &#x43F;&#x435;&#x440;&#x435;&#x444;&#x440;&#x430;&#x437;&#x438;&#x440;&#x443;&#x44F; &#x438;&#x437;&#x440;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x43E; &#x444;&#x43B;&#x43E;&#x43C;&#x430;&#x441;&#x442;&#x435;&#x440;&#x44B;: &#xAB;&#x421; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x44E; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x44C;, &#x43A;&#x440;&#x43E;&#x43C;&#x435; &#x434;&#x435;&#x441;&#x44F;&#x442;&#x43A;&#x430; &#x43A;&#x438;&#x43B;&#x43E;&#x431;&#x430;&#x439;&#x442;&#x43E;&#x432;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x441;&#x438;&#x434;&#x438;&#x448;&#x44C; &#x441;&#x430;&#x43C;. &#x421; &#x434;&#x432;&#x443;&#x445; &#x430;&#x434;&#x440;&#x435;&#x441;&#x43E;&#x432; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x432;&#x441;&#x451;&#xBB;. &#x420;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43D;&#x43E; &#x442;&#x430;&#x43A;: &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; <code>do_test</code> &#x432; &#x444;&#x430;&#x439;&#x43B;&#x435; <code>main.c</code> &#x43E;&#x442;&#x441;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43E;&#x43A;&#x43D;&#x430; &#x43F;&#x43E; 2&#x413;&#x431;, &#x43D;&#x430;&#x441;&#x442;&#x440;&#x430;&#x438;&#x432;&#x430;&#x44F; &#x442;&#x435;&#x441;&#x442;&#x44B; (&#x43A;&#x430;&#x43A;&#x443;&#x44E; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x44C; &#x438; &#x43A;&#x430;&#x43A; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x443;&#x435;&#x43C;), &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x43D;&#x443;&#x43B;&#x435;&#x432;&#x43E;&#x435; &#x438; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x435; &#x43E;&#x43A;&#x43D;&#x43E; &#x2014; &#x44D;&#x442;&#x43E; &#x447;&#x430;&#x441;&#x442;&#x438; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#xAB;&#x43C;&#x43B;&#x430;&#x434;&#x448;&#x435;&#x439;&#xBB; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x441;&#x438;&#x434;&#x438;&#x442; memtest. &#x415;&#x441;&#x43B;&#x438; &#x435;&#x43C;&#x443; &#x43F;&#x43E;&#x440;&#x430; &#x441;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; &#x43D;&#x430;&#x441;&#x438;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x43C;&#x435;&#x441;&#x442;, &#x43E;&#x43D; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; <code>run_at</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43A;&#x43E;&#x43F;&#x438;&#x440;&#x443;&#x435;&#x442; &#x432;&#x435;&#x441;&#x44C; memtest &#x43E;&#x442; <code>_start</code> &#x434;&#x43E; <code>_end</code> &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x43E;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E; (&#x44D;&#x442;&#x438;&#x43C; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#xAB;&#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43E;&#x447;&#x43D;&#x43E;&#x435;&#xBB; &#x44F;&#x434;&#x440;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x430;), &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; &#x441; &#x431;&#x430;&#x440;&#x44C;&#x435;&#x440;&#x43E;&#x43C; &#x438; spinlock&apos;&#x430;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x432;&#x441;&#x435;&#x445; &#x44F;&#x434;&#x435;&#x440; &#x438; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; <code>goto *addr;</code> &#x43F;&#x440;&#x44B;&#x433;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x443;&#x44E; &#x442;&#x43E;&#x447;&#x43A;&#x443; &#x432;&#x445;&#x43E;&#x434;&#x430; &#x43D;&#x430; &#x43D;&#x43E;&#x432;&#x43E;&#x43C; &#x43C;&#x435;&#x441;&#x442;&#x435;. &#x41A;&#x441;&#x442;&#x430;&#x442;&#x438;, &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;, &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43D;&#x43E; &#x43E;&#x43D;&#x43E; &#x43D;&#x435; &#x43F;&#x43E; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x443; &#xAB;&#x43F;&#x440;&#x43E;&#x437;&#x440;&#x430;&#x447;&#x43D;&#x44B;&#x445;&#xBB; &#x434;&#x43B;&#x44F; &#x43E;&#x441;&#x442;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x43A;&#x43E;&#x440;&#x443;&#x442;&#x438;&#x43D;, &#x430; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#xAB;&#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x445;&#x43E;&#x434;&#xBB;.</p><br>
<p>&#x422;&#x443;&#x442; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x434; <strong>&#x43D;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;</strong> &#x43F;&#x435;&#x440;&#x435;&#x438;&#x43D;&#x438;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; <code>bss</code> &#x43D;&#x443;&#x43B;&#x44F;&#x43C;&#x438; &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x435; &#x2014; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x442;&#x44C; <code>_dl_start</code> &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438;, &#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; <code>riscv_entry</code> &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;, &#x43F;&#x440;&#x435;&#x434;&#x432;&#x430;&#x440;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x432; trap entry. &#x41D;&#x443;, &#x438; &#x435;&#x449;&#x451; &#x43E;&#x434;&#x43D;&#x43E;: &#x43D;&#x435;&#x43F;&#x43B;&#x43E;&#x445;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x438;&#x442;&#x44C; L1I-&#x43A;&#x44D;&#x448;&#x443;, &#x447;&#x442;&#x43E; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x43C;&#x435;&#x43D;&#x44F;&#x43B;&#x441;&#x44F;. &#x41D;&#x430;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x44F; &#x43F;&#x43E;&#x43D;&#x44F;&#x43B; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x44E;, &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x44F; <code>fence.i</code>.</p><br>
<p>&#x41D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435;, &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; Memtest86+ &#x2014; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x43D;&#x44B;&#x439;, &#x438; &#x43F;&#x440;&#x438; &#x440;&#x435;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x43E;&#x43D; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x439; &#x430;&#x434;&#x440;&#x435;&#x441; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x44B; <code>barrier_s</code> &#x434;&#x43B;&#x44F; &#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x440;&#x435;&#x43B;&#x43E;&#x43A;&#x430;&#x446;&#x438;&#x438;. &#x423; &#x43C;&#x435;&#x43D;&#x44F; &#x436;&#x435; &#x43A;&#x43E;&#x434; &#x43F;&#x43E;&#x43A;&#x430; &#x447;&#x442;&#x43E; &#x43E;&#x434;&#x43D;&#x43E;&#x43F;&#x43E;&#x442;&#x43E;&#x447;&#x43D;&#x44B;&#x439;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x443;&#x440;&#x443; &#x44F; &#x431;&#x430;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x442;&#x430;&#x441;&#x43A;&#x430;&#x44E; &#x437;&#x430; &#x441;&#x43E;&#x431;&#x43E;&#x439; &#x432; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;. &#x41D;&#x430;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x435;, &#x435;&#x441;&#x43B;&#x438; &#x447;&#x443;&#x442;&#x44C; &#x438;&#x441;&#x445;&#x438;&#x442;&#x440;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x431;&#x435;&#x437; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x430;&#x434;&#x440;&#x435;&#x441;&#x43E;&#x432; &#x432;&#x44B;&#x43A;&#x440;&#x443;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F;.</p><br>
<h2 id="podvodnye-kamni">&#x41F;&#x43E;&#x434;&#x432;&#x43E;&#x434;&#x43D;&#x44B;&#x435; &#x43A;&#x430;&#x43C;&#x43D;&#x438;</h2><br>
<p>&#x41A;&#x430;&#x43A; &#x44F; &#x443;&#x436;&#x435; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43B;, &#x435;&#x441;&#x442;&#x44C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x44B;&#x435;: &#x442;&#x440;&#x438; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x430;. &#x415;&#x441;&#x442;&#x44C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43D;&#x435;&#x43E;&#x447;&#x435;&#x432;&#x438;&#x434;&#x43D;&#x44B;&#x435;: &#x440;&#x430;&#x441;&#x441;&#x44B;&#x43F;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43F;&#x43E; &#x432;&#x441;&#x435;&#x43C;&#x443; &#x43A;&#x43E;&#x434;&#x443; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x435; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x438; &#x438; &#x43E;&#x431;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x43C; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430;&#x43C;. &#x410; &#x435;&#x441;&#x442;&#x44C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438; <em>&#x432;&#x43D;&#x435;&#x437;&#x430;&#x43F;&#x43D;&#x44B;&#x435;</em>: &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x442;&#x43E; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x44F; &#x434;&#x43E;&#x431;&#x438;&#x43B;&#x441;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x433;&#x43E; &#x442;&#x435;&#x441;&#x442;&#x430; (Own Address, &#x445;&#x43E;&#x442;&#x44C; &#x438; &#x441; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x451;&#x43D;&#x43D;&#x44B;&#x43C; &#x43A;&#x44D;&#x448;&#x435;&#x43C;) &#x43D;&#x430; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x435;. &#x41E;&#x43D; &#x43E;&#x442;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B; &#x432; &#x440;&#x435;&#x43B;&#x43E;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x43C; &#x432;&#x438;&#x434;&#x435;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x440;&#x435;&#x43B;&#x43E;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x441;&#x44F; &#x43D;&#x430; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x435; &#x43C;&#x435;&#x441;&#x442;&#x43E;, &#x43E;&#x442;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B; &#x438; &#x442;&#x430;&#x43C;. &#x410; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43B;&#x441;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x442;&#x435;&#x441;&#x442; &#x438; &#x443;&#x43F;&#x430;&#x43B;. &#x418;&#x437;-&#x437;&#x430; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x43D;&#x435; &#x432;&#x44B;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;. &#x414;&#x435;&#x43B;&#x43E; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x43D;&#x430; x86 &#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x438;&#x43B;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; <code>uint64_t</code> &#x43F;&#x43E; &#x430;&#x434;&#x440;&#x435;&#x441;&#x443; <code>0x80000002</code> &#x438; &#x432;&#x430;&#x43C; &#x437;&#x430; &#x44D;&#x442;&#x43E; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442;. &#x41D;&#x443;, &#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x43A;&#x430;&#x43A; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442;: <a href="https://stackoverflow.com/questions/12491578/whats-the-actual-effect-of-successful-unaligned-accesses-on-x86" rel="nofollow">&#x445;&#x43E;&#x434;&#x44F;&#x442; &#x441;&#x43B;&#x443;&#x445;&#x438;</a>, &#x447;&#x442;&#x43E; &#x432;&#x44B;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x435; load/store &#x43D;&#x430; x86 &#x44F;&#x43A;&#x43E;&#x431;&#x44B; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x430;&#x442;&#x43E;&#x43C;&#x430;&#x440;&#x43D;&#x44B;&#x435;, &#x430; &#x432;&#x43E;&#x442; &#x43D;&#x435; &#x432;&#x44B;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x2014; &#x43D;&#x435;&#x442;. &#x410; &#x435;&#x449;&#x451; &#x441;&#x43C;&#x443;&#x442;&#x43D;&#x43E; &#x432;&#x441;&#x43F;&#x43E;&#x43C;&#x438;&#x43D;&#x430;&#x44E;, &#x447;&#x442;&#x43E; &#x432; &#x43A;&#x43E;&#x434;&#x435; QEMU &#x43F;&#x435;&#x440;&#x438;&#x43E;&#x434;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x432;&#x441;&#x43F;&#x43B;&#x44B;&#x432;&#x430;&#x43B;&#x438; &#x432;&#x43E;&#x440;&#x447;&#x43B;&#x438;&#x432;&#x44B;&#x435; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x438;, &#x43C;&#x43E;&#x43B; &#xAB;&#x417;&#x434;&#x435;&#x441;&#x44C; &#x432;&#x441;&#x451; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;, &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x441;&#x435;&#x43A;&#x430;&#x435;&#x442; &#x433;&#x440;&#x430;&#x43D;&#x438;&#x446;&#x44B; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x446;&#xBB;.</p><br>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x442;&#x435;&#x441;&#x442;&#x44B; &#x432; &#x446;&#x435;&#x43B;&#x43E;&#x43C; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x44E;&#x442;&#x441;&#x44F;, &#x43D;&#x443;&#x436;&#x43D;&#x43E; <em>&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x438;&#x445; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x44C;</em> &#x2014; &#x440;&#x430;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x441; unaligned access &#x438; &#x442;.&#x434;.</p><br>
<p>&#x41A;&#x441;&#x442;&#x430;&#x442;&#x438;, &#x441;&#x443;&#x434;&#x44F; &#x43F;&#x43E; &#x442;&#x43E;&#x43C;&#x443;, &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x432;&#x44B;&#x434;&#x430;&#x451;&#x442; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; RocketChip, &#x430; &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x2014; QEMU, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x447;&#x442;&#x43E; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x434;&#x43B;&#x44F; RocketChip &#x2014; unaligned access trap, &#x434;&#x43B;&#x44F; QEMU &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#xAB;&#x441;&#x43B;&#x435;&#x433;&#x43A;&#x430; &#x43D;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x43E;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;&#xBB;.<br>
&#x41F;&#x43E;&#x438;&#x441;&#x43A;&#x430;&#x43B; &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x443; &#xAB;misaligned&#xBB; &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x43C; &#x442;&#x43E;&#x43C;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x438; &#x432;&#x441;&#x43A;&#x43E;&#x440;&#x435; &#x43D;&#x430;&#x442;&#x43A;&#x43D;&#x443;&#x43B;&#x441;&#x44F; &#x43D;&#x430; &#x430;&#x431;&#x437;&#x430;&#x446; &#x432; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x439;, &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x44F;&#x449;&#x438;&#x439;</p><br>
<blockquote>Changed description of misaligned load and store behavior. The specification now allows visible misaligned address traps in execution environment interfaces, rather than just mandating invisible handling of misaligned loads and stores in user mode. Also, now allows access exceptions to be reported for misaligned accesses (including atomics) that should not be emulated.</blockquote><p>&#x422;&#x43E; &#x435;&#x441;&#x442;&#x44C;, &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x440;&#x430;&#x43D;&#x44C;&#x448;&#x435; &#x2014; &#x432;&#x44B;&#x43A;&#x440;&#x443;&#x447;&#x438;&#x432;&#x430;&#x439;&#x441;&#x44F; &#x43A;&#x430;&#x43A; &#x445;&#x43E;&#x447;&#x435;&#x448;&#x44C;, &#x43D;&#x43E; user-mode code &#x43D;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x437;&#x430;&#x431;&#x43E;&#x442;&#x438;&#x442;&#x44C;, &#x431;&#x443;&#x434;&#x435;&#x448;&#x44C; &#x43B;&#x438; &#x442;&#x44B; &#x44D;&#x43C;&#x443;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x435; &#x432;&#x44B;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x438;&#x43B;&#x438; &#x43E;&#x43D;&#x43E; &#x43E;&#x442;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x43D;&#x430; &#x430;&#x43F;&#x43F;&#x430;&#x440;&#x430;&#x442;&#x43D;&#x43E;&#x43C; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435;. &#x421;&#x435;&#x439;&#x447;&#x430;&#x441; &#x436;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438; &#x43F;&#x43E;&#x440;&#x443;&#x433;&#x430;&#x442;&#x44C;&#x441;&#x44F;. &#x41D;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x436;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F;, &#x43F;&#x43E;&#x445;&#x43E;&#x436;&#x435;, &#x437;&#x434;&#x435;&#x441;&#x44C; &#x43D;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;. &#x412; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;, &#x43D;&#x430; &#x43C;&#x435;&#x43D;&#x44F; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x430; &#x43F;&#x43E;&#x440;&#x443;&#x433;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x43E;&#x433;&#x43B;&#x430; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x2014; &#x44F;-&#x442;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E; &#x432; machine mode &#x438;&#x43B;&#x438; &#x43A;&#x430;&#x43A; &#x43E;&#x43D;&#x43E; &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F;. &#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x44F; &#x43F;&#x43E;&#x43F;&#x44B;&#x442;&#x430;&#x43B;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; <code>rdtsc</code> (x86) &#x447;&#x435;&#x440;&#x435;&#x437; <code>rdtime</code> (rv64), &#x43E;&#x43D;&#x43E; &#x432;&#x44B;&#x434;&#x430;&#x43B;&#x43E; trap, &#x445;&#x43E;&#x442;&#x44F; &#x44D;&#x442;&#x43E; &#x438; &#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x430;&#x44F; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x446;&#x438;&#x44F;. &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E;, &#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x43E;&#x441;&#x44C;, &#x43D;&#x430; &#x43C;&#x43E;&#x451;&#x43C; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x435; &#x435;&#x451; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x442;&#x44B; &#x430;&#x43F;&#x43F;&#x430;&#x440;&#x430;&#x442;&#x43D;&#x43E;&#x439; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x44D;&#x43C;&#x443;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x44F;&#x434;&#x440;&#x43E; &#x447;&#x435;&#x440;&#x435;&#x437; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x43E;&#x447;&#x43D;&#x44B;&#x439; &#x438;&#x43C;&#x435;&#x44E;&#x449;&#x438;&#x439;&#x441;&#x44F; memory-mapped &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;.</p><br>
<p>&#x415;&#x441;&#x442;&#x44C; &#x435;&#x449;&#x451; &#x442;&#x430;&#x43A;&#x430;&#x44F; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C;: &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43A;&#x443;&#x434;&#x430; &#x443;&#x433;&#x43E;&#x434;&#x43D;&#x43E;, &#x430; <em>&#x43A;&#x443;&#x434;&#x430; &#x43D;&#x443;&#x436;&#x43D;&#x43E;</em> &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x432; <code>low_test_addr</code> (&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43B;&#x43E;&#x433;&#x438;&#x447;&#x43D;&#x43E; &#x431;&#x44B; &#x432;&#x44B;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x440;&#x430;&#x432;&#x43D;&#x44B;&#x43C; &#x43C;&#x43B;&#x430;&#x434;&#x448;&#x435;&#x43C;&#x443; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x443;&#x435;&#x43C;&#x43E;&#x43C;&#x443; &#x430;&#x434;&#x440;&#x435;&#x441;&#x443;), &#x43C;&#x44B; &#x443;&#x437;&#x43D;&#x430;&#x435;&#x43C;, &#x43B;&#x438;&#x448;&#x44C; &#x440;&#x430;&#x441;&#x43F;&#x430;&#x440;&#x441;&#x438;&#x432; fdt &#x432; &#x441;&#x438;&#x448;&#x43D;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x435;. &#x41D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435;, &#x435;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x43E;&#x437;&#x440;&#x435;&#x43D;&#x438;&#x435;, &#x447;&#x442;&#x43E; <code>low_test_addr</code> &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x44B;&#x43C;, &#x43F;&#x440;&#x438; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x438;, &#x447;&#x442;&#x43E; &#x43E;&#x43D; &#x43F;&#x43E;&#x43F;&#x430;&#x434;&#x430;&#x435;&#x442; &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x435; 2&#x413;&#x431; &#x43E;&#x43A;&#x43D;&#x43E; &#x438; <code>high_test_adr</code> &#x432;&#x44B;&#x447;&#x438;&#x441;&#x43B;&#x438;&#x442;&#x441;&#x44F; &#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x44B;&#x439; &#x430;&#x434;&#x440;&#x435;&#x441;&#x2026; &#x41A;&#x43E;&#x440;&#x43E;&#x447;&#x435;, &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x441;&#x44F; &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x435; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x43E; &#x2014; &#x44D;&#x442;&#x43E; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;: <code>head.S</code> &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x44F;&#x442;&#x44C; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x430;&#x434;&#x440;&#x435;&#x441; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x438; &#x432; <code>initial_load_addr</code>, &#x430; &#x432; &#x43A;&#x43E;&#x43D;&#x446;&#x435; <code>riscv_entry</code> &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x435;&#x43C; &#x43D;&#x435;&#x445;&#x438;&#x442;&#x440;&#x443;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; <code>move_to_correct_addr</code>:</p><br>
<pre><code class="cpp">static void move_to_correct_addr(void)
{
    uintptr_t cur_start = (uintptr_t)&amp;_start;
    uintptr_t cur_end   = (uintptr_t)&amp;_end;
    if (cur_start == low_test_addr || cur_start == high_test_adr) {
        // &#x412;&#x441;&#x451; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E;, &#x43C;&#x44B; &#x443;&#x436;&#x435; &#x43D;&#x430; &#x43C;&#x435;&#x441;&#x442;&#x435;
        return;
    }
    if (cur_start == initial_load_addr &amp;&amp;
        (cur_start - low_test_addr) &lt; (cur_end - cur_start)
    ) {
        // &#x421;&#x435;&#x439;&#x447;&#x430;&#x441; &#x431;&#x443;&#x434;&#x435;&#x442; &quot;&#x444;&#x438;&#x43D;&#x442; &#x443;&#x448;&#x430;&#x43C;&#x438;&quot;: &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43C;&#x441;&#x44F; &#x447;&#x443;&#x442;&#x44C; &#x432;&#x43F;&#x435;&#x440;&#x451;&#x434;,
        // &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x442;&#x435;&#x440;&#x435;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x439; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x438; &#x43F;&#x435;&#x440;&#x435;&#x435;&#x437;&#x434;&#x435; &#x432; &#x43C;&#x43B;&#x430;&#x434;&#x448;&#x438;&#x439; &#x430;&#x434;&#x440;&#x435;&#x441;
        // &#x414;&#x435;&#x43B;&#x430;&#x435;&#x43C; &#x44D;&#x442;&#x43E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438;, &#x430; &#x442;&#x43E; &#x43C;&#x430;&#x43B;&#x43E; &#x43B;&#x438;, &#x43D;&#x430;&#x441; &#x443;&#x436;&#x435;
        // &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x43B;&#x438; &#x432; &#x441;&#x430;&#x43C;&#x44B;&#x435; &#x441;&#x442;&#x430;&#x440;&#x448;&#x438;&#x435; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430;...
        serial_echo_print(&quot;FIRST STARTUP RELOCATION...\n&quot;);
        void *temp_addr = (((uintptr_t)&amp;_end &gt;&gt; 12) + 1) &lt;&lt; 12;
        run_at(temp_addr, 0);
    } else {
        // &#x41D;&#x443;, &#x442;&#x443;&#x442; &#x432;&#x441;&#x451; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; --- &#x438;&#x434;&#x451;&#x43C;, &#x43A;&#x443;&#x434;&#x430; &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x43B;&#x438;&#x441;&#x44C;.
        serial_echo_print(&quot;FINAL STARTUP RELOCATION...\n&quot;);
        run_at(low_test_addr, 0);
    }
}</code></pre><br>
<p>&#x412;&#x43E;&#x43E;&#x431;&#x449;&#x435;, &#x43E;&#x434;&#x438;&#x43D; &#x438;&#x437; &#x43F;&#x43E;&#x434;&#x432;&#x43E;&#x434;&#x43D;&#x44B;&#x445; &#x43A;&#x430;&#x43C;&#x43D;&#x435;&#x439; &#x2014; &#x44D;&#x442;&#x43E; &#x442;&#x43E;&#x442; &#x444;&#x430;&#x43A;&#x442;, &#x447;&#x442;&#x43E; memtest &#x443;&#x432;&#x435;&#x440;&#x435;&#x43D;, &#x447;&#x442;&#x43E; RAM &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x430; &#x43A;&#x443;&#x434;&#x430;-&#x442;&#x43E; &#x432; &#x43C;&#x43B;&#x430;&#x434;&#x448;&#x438;&#x435; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430;. &#x41D;&#x430; RISC-V &#x44D;&#x442;&#x43E; &#x43E;&#x442;&#x43D;&#x44E;&#x434;&#x44C; &#x43D;&#x435; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x448;&#x43B;&#x43E;&#x441;&#x44C; &#x43D;&#x430;&#x43A;&#x43E;&#x441;&#x442;&#x44B;&#x43B;&#x438;&#x442;&#x44C; &#x441;&#x43C;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x442;&#x435;&#x441;&#x442;&#x430;&#x445; &#x43D;&#x430; <code>v-&gt;plim_lower</code>.</p><br>
<p>&#x415;&#x449;&#x451; &#x43E;&#x434;&#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x432; &#x446;&#x435;&#x43B;&#x43E;&#x43C;, &#x442;&#x438;&#x43F;&#x438;&#x447;&#x43D;&#x430; &#x434;&#x43B;&#x44F; &#xAB;&#x441;&#x442;&#x430;&#x440;&#x43E;&#x433;&#x43E;&#xBB; &#x43A;&#x43E;&#x434;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x445;&#x43E;&#x442;&#x44F;&#x442; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43A;&#x440;&#x43E;&#x441;&#x441;-&#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;, &#x430; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x2014; &#x444;&#x430;&#x439;&#x43B; <code>test.c</code> &#x443;&#x441;&#x44B;&#x43F;&#x430;&#x43D; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x442;&#x438;&#x43F;&#x430; <code>ulong</code> (&#x437;&#x430;&#x442;&#x430;&#x439;&#x43F;&#x434;&#x435;&#x444;&#x43B;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x43D;&#x430; <code>unsigneg long</code>), &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x430; 32-&#x431;&#x438;&#x442;&#x43D;&#x43E;&#x43C; x86 &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; <code>uint32_t</code>, &#x430; &#x432;&#x43E;&#x442; &#x43D;&#x430; &#xAB;&#x433;&#x43D;&#x443;&#x442;&#x44B;&#x445; 64 &#x431;&#x438;&#x442;&#x430;&#x445;&#xBB; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D; <code>uint64_t</code>. &#x418;&#x437; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x437;&#x430;&#x431;&#x430;&#x432;&#x43D;&#x44B;&#x435; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x432;&#x438;&#x434;&#x430; &#xAB;&#x41E;&#x448;&#x438;&#x431;&#x43A;&#x430;!!! Good: ffffffff Real: ffffffff Bad bits: 00000000&#xBB;. &#x427;&#x442;&#x43E; &#x437;&#x430; &#x447;&#x435;&#x43F;&#x443;&#x445;&#x430;? &#x410; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43B;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;-&#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D; -1, &#x43C;&#x43B;&#x430;&#x434;&#x448;&#x438;&#x435; 32 &#x431;&#x438;&#x442;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x432;&#x43D;&#x44B; 1. &#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x443; &#x43D;&#x435;&#x433;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x435;&#x449;&#x451; &#x441;&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x436;&#x435; &#x441;&#x442;&#x430;&#x440;&#x448;&#x438;&#x445; &#x431;&#x438;&#x442;&#x43E;&#x432;, &#x438; &#x43E;&#x43D;&#x438; &#x43A;&#x430;&#x43A; &#x431;&#x44B; &#x442;&#x43E;&#x436;&#x435; &#x43E;&#x442;&#x43D;&#x44E;&#x434;&#x44C; &#x43D;&#x435; 0&#x2026; &#x412; &#x43E;&#x431;&#x449;&#x435;&#x43C;, &#x431;&#x44B;&#x43B;&#x43E; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x43A;&#x43E;&#x43B;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x442;&#x432;&#x43E;&#x440;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;: &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C;, &#x43A;&#x430;&#x43A;&#x43E;&#x439; <code>ulong</code> &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x438;&#x437; &#x441;&#x435;&#x431;&#x44F; &#x442;&#x435;&#x441;&#x442;&#x43E;&#x432;&#x44B;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; (<code>uint32_t</code>), &#x430; &#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x448;&#x438;&#x440;&#x438;&#x43D;&#x443; &#x43C;&#x430;&#x448;&#x438;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44F; (<code>uintptr_t</code>). &#x41A;&#x441;&#x442;&#x430;&#x442;&#x438;, &#x43D;&#x435; &#x432;&#x44B;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x442;&#x43E;&#x436;&#x435; &#x438;&#x441;&#x447;&#x435;&#x437;. &#x412;&#x438;&#x434;&#x438;&#x43C;&#x43E;, &#x44D;&#x442;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x43A; <code>uint64_t</code> &#x441; &#x448;&#x430;&#x433;&#x43E;&#x43C; 4. RISC-V &#x442;&#x430;&#x43A;&#x43E;&#x435; <em>&#x43C;&#x43E;&#x436;&#x435;&#x442;</em> &#x438;&#x433;&#x43D;&#x43E;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E;, &#x430; &#x432;&#x43E;&#x442; &#x441; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x437;&#x440;&#x435;&#x43D;&#x438;&#x44F; &#x44F;&#x437;&#x44B;&#x43A;&#x430; C, &#x43A;&#x441;&#x442;&#x430;&#x442;&#x438;, &#x43D;&#x435; &#x432;&#x44B;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x2014; &#x44D;&#x442;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x434;&#x430;&#x436;&#x435; UB. <del>&#x417;&#x43D;&#x430;&#x447;&#x438;&#x442; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C; memtest &#x441; UBSan.</del> &#x41C;&#x435;&#x436;&#x434;&#x443; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x43C;, &#x43D;&#x435; &#x443;&#x434;&#x438;&#x432;&#x43B;&#x44E;&#x441;&#x44C;, &#x435;&#x441;&#x43B;&#x438; UBSan &#x432; &#x440;&#x435;&#x436;&#x438;&#x43C;&#x435; trap-on-error &#x441;&#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x43E;&#x439; &#x43F;&#x43E; JTAG.</p><br>
<h2 id="upakovyvaem-dlya-zagruzchika">&#x423;&#x43F;&#x430;&#x43A;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A;&#x430;</h2><br>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C;, &#x43A;&#x43E;&#x433;&#x434;&#x430; memtest &#x431;&#x43E;&#x43B;&#x435;&#x435;-&#x43C;&#x435;&#x43D;&#x435;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x442;&#x435;&#x441;&#x442;&#x44B;, &#x43F;&#x43E;&#x440;&#x430; &#x437;&#x430;&#x434;&#x443;&#x43C;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x433;&#x440;&#x443;&#x437;&#x438;&#x43B;&#x441;&#x44F; &#x43E;&#x43D; &#x43D;&#x435; &#x447;&#x435;&#x440;&#x435;&#x437; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x447;&#x438;&#x43A; &#x430; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x43C; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A;&#x43E;&#x43C; U-Boot.</p><br>
<p>&#x414;&#x43B;&#x44F; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x44B; &#x44F; &#x432;&#x44B;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;: &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x443;&#x442;&#x438;&#x43B;&#x438;&#x442;&#x44B; <code>mkimage</code> &#x438;&#x437; &#x441;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x430; U-Boot &#x44F; &#x443;&#x43F;&#x430;&#x43A;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x44E; <em>&#x44F;&#x43A;&#x43E;&#x431;&#x44B; &#x44F;&#x434;&#x440;&#x43E; Linux</em>:</p><br>
<pre><code class="plaintext">mkimage -A riscv -O linux -T kernel -C none \
    -a 0x80000000 -e 0x80000000 \
    -n memtest -d memtest.bin memtest.uboot</code></pre><br>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x435;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x438;&#x442;&#x44C; &#x43D;&#x430; SD-&#x43A;&#x430;&#x440;&#x442;&#x443; &#x438; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B;</p><br>
<pre><code class="plaintext">run mmcsetup; run fdtsetup; fdt set /chosen bootargs &quot;console=ttyS0&quot;; fatload mmc 0:1 82000000 memtest.uboot; bootm fdt; bootm 82000000 - ${fdtaddr}</code></pre><br>
<p>(&#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x443;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x435; <code>run</code> &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x43C;&#x44F; &#x441;&#x43A;&#x440;&#x438;&#x43F;&#x442;&#x430; &#x2014; &#x43D;&#x430; &#x432;&#x430;&#x448;&#x435;&#x439; &#x43F;&#x43B;&#x430;&#x442;&#x435; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43D;&#x435; &#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;&#x441;&#x44F;).</p><br>
<p>&#x422;&#x443;&#x442; &#x43C;&#x435;&#x43D;&#x44F; &#x43F;&#x43E;&#x434;&#x436;&#x438;&#x434;&#x430;&#x43B;&#x430; &#x435;&#x449;&#x451; &#x43E;&#x434;&#x43D;&#x430; &#x43D;&#x435;&#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C;: &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x447;&#x438;&#x43A; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x43B; &#x43C;&#x43D;&#x435; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x435; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430; FDT: <code>0xbffb7c80</code>. &#x41D;&#x443;, &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x435;: &#x441;&#x442;&#x430;&#x440;&#x448;&#x438;&#x435; &#x431;&#x438;&#x442;&#x44B; &#x431;&#x44B;&#x43B;&#x438; <code>ffffffff</code>, &#x432; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B;&#x43E;. &#x42F; &#x443;&#x436; &#x43F;&#x440;&#x438;&#x433;&#x43E;&#x442;&#x43E;&#x432;&#x438;&#x43B;&#x441;&#x44F; &#x43A; &#x442;&#x43E;&#x43C;&#x443;, &#x447;&#x442;&#x43E; &#x437;&#x430; &#x43C;&#x435;&#x43D;&#x44F; &#x443;&#x436;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x43B;&#x438; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43D;&#x443;&#x44E; &#x43E;&#x440;&#x433;&#x430;&#x43D;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44E; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438; (&#x447;&#x442;&#x43E; &#x43C;&#x43D;&#x435; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x431;&#x44B;&#x43B;&#x43E; &#x43D;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x43E;), &#x43D;&#x43E; &#x43B;&#x430;&#x440;&#x447;&#x438;&#x43A; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x43B;&#x441;&#x44F;: &#x432; &#x43A;&#x43E;&#x434;&#x435; HiFive_U-Boot &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x43B;&#x430;&#x441;&#x44C; &#x43A;&#x430;&#x43A; &#x432;&#x44B;&#x437;&#x43E;&#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;:</p><br>
<pre><code class="cpp">    theKernel(machid, (unsigned long)images-&gt;ft_addr);</code></pre><br>
<p>&#x41F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x430; &#x431;&#x44B;&#x43B;&#x430; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x43E;&#x431;&#x44A;&#x44F;&#x432;&#x43B;&#x435;&#x43D;&#x430; &#x43E;&#x43D;&#x430; &#x43A;&#x430;&#x43A;</p><br>
<pre><code class="cpp">    void    (*theKernel)(int arch, uint params);</code></pre><br>
<p>&#x41D;&#x435; &#x443;&#x432;&#x435;&#x440;&#x435;&#x43D;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x435;&#x43C;&#x43E;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;, &#x43D;&#x43E;, &#x43F;&#x43E; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x435;, &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; 32 &#x431;&#x438;&#x442;&#x43E;&#x432; &#x430;&#x434;&#x440;&#x435;&#x441;&#x430; &#x442;&#x443;&#x434;&#x430; &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x43B;&#x435;&#x437;&#x435;&#x442;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; &#x432; <code>head.S</code> &#x441;&#x442;&#x440;&#x43E;&#x447;&#x43A;&#x438;:</p><br>
<pre><code class="plaintext">    li t0, 0xffffffffL
    and a1, a1, t0</code></pre><br>
<h2 id="promezhutochnyy-itog">&#x41F;&#x440;&#x43E;&#x43C;&#x435;&#x436;&#x443;&#x442;&#x43E;&#x447;&#x43D;&#x44B;&#x439; &#x438;&#x442;&#x43E;&#x433;</h2><br>
<p>&#x418;&#x442;&#x430;&#x43A;, &#x43E;&#x43D;&#x43E; &#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;, &#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x43E;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x441;&#x43A;&#x43E;&#x440;&#x435;&#x435; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;, &#x447;&#x435;&#x43C; &#x444;&#x438;&#x43D;&#x430;&#x43B;:</p><br>
<ul>
<li>&#x41D;&#x430;&#x434;&#x43E; &#x431;&#x44B; &#x43F;&#x43E;&#x447;&#x438;&#x43D;&#x438;&#x442;&#x44C; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x443; x86. &#x41F;&#x43E;&#x43A;&#x430; &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x430; &#x2014; &#x432;&#x441;&#x451; &#x440;&#x430;&#x432;&#x43D;&#x43E; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x442;&#x44C; &#x435;&#x451; &#x431;&#x435;&#x437; &#x442;&#x449;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; review &#x438; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x430; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C; &#x436;&#x435;&#x43B;&#x435;&#x437;&#x435; &#x44F; &#x43D;&#x435; &#x440;&#x435;&#x448;&#x443;&#x441;&#x44C; <strong>&#x438; &#x432;&#x430;&#x43C; &#x43D;&#x435; &#x441;&#x43E;&#x432;&#x435;&#x442;&#x443;&#x44E;</strong></li>
<li>&#x414;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443; SMP &#x432; &#x43A;&#x43E;&#x434; RISC-V</li>
<li>&#x411;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x449;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x448;&#x438;&#x439;&#x441;&#x44F; &#x432;&#x43D;&#x435; <code>arch/</code> &#x43F;&#x43B;&#x430;&#x442;&#x444;&#x43E;&#x440;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x44B;&#x439; &#x43A;&#x43E;&#x434;</li>
<li>&#x41F;&#x435;&#x440;&#x435;&#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x430;&#x441;&#x441;&#x435;&#x43C;&#x431;&#x43B;&#x435;&#x440;&#x43D;&#x44B;&#x439; &#x432;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x438; &#x438;&#x437; <code>test.c</code> &#x43F;&#x43E;&#x434; RISC-V (&#x43E;&#x43D; &#x44F;&#x432;&#x43D;&#x44B;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x441; &#x43E;&#x43F;&#x446;&#x438;&#x435;&#x439; <code>-O0</code>!)</li>
</ul></div>
      
    </div>

    

    <dl class="post__tags">
      <dt class="post__tags-label">&#x422;&#x435;&#x433;&#x438;:</dt>
      <dd class="post__tags-list">    <ul class="inline-list inline-list_fav-tags js-post-tags">
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bmemtest86%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">memtest86</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bmemtest86%2B%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">memtest86+</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Brisc-v%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">risc-v</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Briscv%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">riscv</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5B%D1%82%D0%B5%D1%81%D1%82%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%20%D0%BF%D0%B0%D0%BC%D1%8F%D1%82%D0%B8%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">&#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x43F;&#x430;&#x43C;&#x44F;&#x442;&#x438;</a></li>
    </ul>
    <button type="button" class="btn btn_outline_grey btn_mini hidden js-fav-edit-link" data-type="2" data-id="484026" onclick="show_edit_tags(this)">&#x414;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43A;&#x438;</button>
</dd>
    </dl>
  </div>