<div class="post__wrapper">
    <header class="post__meta">
        <a href="https://habr.com/ru/users/IvanGanev/" class="post__user-info user-info" title="&#x410;&#x432;&#x442;&#x43E;&#x440; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438;">
            <img src="//habrastorage.org/getpro/habr/avatars/600/5ee/7e1/6005ee7e14cf855ac00cae136870c112.jpg" width="24" height="24" class="user-info__image-pic user-info__image-pic_small">
          <span class="user-info__nickname user-info__nickname_small">IvanGanev</span>
        </a>

      <span class="post__time" data-time_published="2020-01-22T12:26Z">&#x432;&#x447;&#x435;&#x440;&#x430; &#x432; 15:26</span>

      
    </header>

    <h1 class="post__title post__title_full">
      <span class="post__title-text">&#x41A;&#x430;&#x43A; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x423;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432; JavaScript &#x438; &#x432; Reactjs &#x434;&#x43B;&#x44F; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x43A;&#x43E;&#x434;&#x43E;&#x43C;</span>
    </h1>

      <div class="post__translatation">
        <a href="https://kentcdodds.com/blog/inversion-of-control" class="post__translatation-link" title="&#x410;&#x432;&#x442;&#x43E;&#x440; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x430;: Kent C. Dodds" target="_blank">&#x410;&#x432;&#x442;&#x43E;&#x440; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x430;: Kent C. Dodds</a>
      </div>

      <ul class="post__hubs post__hubs_full-post inline-list">
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/webdev/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;&#x420;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x430; &#x432;&#x435;&#x431;-&#x441;&#x430;&#x439;&#x442;&#x43E;&#x432;&apos;); }">&#x420;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x430; &#x432;&#x435;&#x431;-&#x441;&#x430;&#x439;&#x442;&#x43E;&#x432;</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/javascript/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;JavaScript&apos;); }">JavaScript</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/reactjs/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;ReactJS&apos;); }">ReactJS</a>
          </li>
      </ul>

    <ul class="post__marks inline-list"><li class="inline-list__item inline-list__item_post-type"><span class="post__type-label" title="&#x41F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434;">&#x41F;&#x435;&#x440;&#x435;&#x432;&#x43E;&#x434;</span></li><li class="inline-list__item inline-list__item_post-type"><span class="post__type-label" title="&#x41E;&#x431;&#x443;&#x447;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;">Tutorial</span></li></ul>

    <div class="post__body post__body_full">
      <div class="post__text post__text-html" id="post-content-body" data-io-article-url="https://habr.com/ru/post/485012/"><p><img src="https://habrastorage.org/getpro/habr/post_images/ca6/d2e/e7c/ca6d2ee7cdf0a14a1357e78d9f266507.webp" alt="&#x41A;&#x430;&#x43A; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x423;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432; JavaScript &#x438; &#x432; Reactjs &#x434;&#x43B;&#x44F; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x43A;&#x43E;&#x434;&#x43E;&#x43C;"></p><br>
<p><em>&#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x423;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439;, &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C;, &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x43D;&#x43E; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434;. &#x412; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43E; &#x43A;&#x430;&#x43A; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x423;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432; JavaScript &#x438; &#x432; Reactjs.</em></p><br>
<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x443;&#x436;&#x435; &#x43F;&#x438;&#x441;&#x430;&#x43B;&#x438; &#x43A;&#x43E;&#x434; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x447;&#x435;&#x43C; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C; &#x43C;&#x435;&#x441;&#x442;&#x435;, &#x442;&#x43E; &#x432;&#x430;&#x43C; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x430; &#x442;&#x430;&#x43A;&#x430;&#x44F; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x44F;:</p><br>
<ol>
<li>&#x412;&#x44B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x435;&#x442;&#x435; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43A;&#x440;&#x430;&#x442;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x439; &#x444;&#x440;&#x430;&#x433;&#x43C;&#x435;&#x43D;&#x442; &#x43A;&#x43E;&#x434;&#x430; (&#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F;, React &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;, React &#x445;&#x443;&#x43A; &#x438; &#x442;&#x434;) &#x438; &#x434;&#x435;&#x43B;&#x438;&#x442;&#x435;&#x441;&#x44C; &#x438;&#x43C; (&#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x432;&#x43C;&#x435;&#x441;&#x442;&#x43D;&#x43E;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x438;&#x43B;&#x438; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x443;&#x44F; &#x432; &#x43E;&#x43F;&#x435;&#x43D;&#x441;&#x43E;&#x440;&#x441;).</li>
<li>&#x41A;&#x442;&#x43E;-&#x442;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43A; &#x432;&#x430;&#x43C; &#x441; &#x43F;&#x440;&#x43E;&#x441;&#x44C;&#x431;&#x43E;&#x439; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;. &#x412;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;, &#x43D;&#x43E; &#x43C;&#x43E;&#x433; &#x431;&#x44B;, &#x435;&#x441;&#x43B;&#x438; &#x431;&#x44B; &#x432;&#x44B; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B;&#x438; &#x43D;&#x435;&#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x43E;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435;.</li>
<li>&#x412;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;/&#x43F;&#x440;&#x43E;&#x43F;/&#x43E;&#x43F;&#x446;&#x438;&#x44E; &#x432; &#x441;&#x432;&#x43E;&#x439; &#x43A;&#x43E;&#x434; &#x438; &#x432; &#x441;&#x432;&#x44F;&#x437;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x441; &#x43D;&#x438;&#x43C; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43D;&#x438;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x430;.</li>
<li>&#x41F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x438;&#x442;&#x435; &#x441;&#x442;&#x430;&#x434;&#x438;&#x438; 2 &#x438; 3 &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x440;&#x430;&#x437; (&#x438;&#x43B;&#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;-&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;).</li>
<li>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x432;&#x430;&#x448; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x439; &#x43A;&#x43E;&#x434; &#x442;&#x44F;&#x436;&#x435;&#x43B;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C;.</li>
</ol><br>
<p>&#x427;&#x442;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442; &#x43A;&#x43E;&#x434; &#x43A;&#x43E;&#x448;&#x43C;&#x430;&#x440;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438;? &#x415;&#x441;&#x442;&#x44C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x430;&#x441;&#x43F;&#x435;&#x43A;&#x442;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x43D;&#x44B;&#x43C;:</p><a name="habracut"></a><br>
<ol>
<li><strong>&#x420;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x43F;&#x430;&#x43A;&#x435;&#x442;&#x430; &#x438;/&#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;:</strong> &#x41F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43A;&#x43E;&#x434;&#x430; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430; &#x43D;&#x430; &#x443;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;&#x445; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A; &#x443;&#x445;&#x443;&#x434;&#x448;&#x435;&#x43D;&#x438;&#x44E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x418;&#x43D;&#x43E;&#x433;&#x434;&#x430; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43A; &#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; &#x43B;&#x44E;&#x434;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x442;&#x43A;&#x430;&#x436;&#x443;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434;.</li>
<li><strong>&#x421;&#x43B;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C;:</strong> &#x420;&#x430;&#x43D;&#x44C;&#x448;&#x435; &#x443; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x431;&#x44B;&#x43B;&#x43E; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x43F;&#x446;&#x438;&#x439;, &#x438; &#x43E;&#x43D; &#x431;&#x44B;&#x43B; &#x441;&#x444;&#x43E;&#x43A;&#x443;&#x441;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D; &#x43D;&#x430; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x443; &#x432;&#x435;&#x449;&#x44C;, &#x43D;&#x43E; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43E;&#x43D; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43A;&#x443;&#x447;&#x443; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x432;&#x435;&#x449;&#x435;&#x439;, &#x438; &#x432;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x432;&#x441;&#x435; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;. &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x43B;&#x44E;&#x434;&#x438; &#x43D;&#x430;&#x447;&#x43D;&#x443;&#x442; &#x437;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x43E; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x44B;&#x445; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x43E;&#x433;&#x443;&#x442;, &#x430; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x438; &#x43D;&#x435;&#x442;, &#x431;&#x44B;&#x442;&#x44C; &#x441;&#x43E;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43C;&#x44B; &#x441; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x434;&#x43B;&#x44F; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x432;&#x44B; &#x443;&#x436;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43B;&#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443;. &#x423; &#x432;&#x430;&#x441; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x434;&#x430;&#x436;&#x435; &#x434;&#x432;&#x430; &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x43E;&#x434;&#x438;&#x43D;&#x430;&#x43A;&#x43E;&#x432;&#x44B;&#x445; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x44E;&#x442;&#x441;&#x44F;, &#x442;&#x430;&#x43A; &#x447;&#x442;&#x43E; &#x432;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;&#x44B; &#x43E; &#x442;&#x43E;&#x43C; &#x447;&#x442;&#x43E; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x442;&#x43E;&#x439; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x439; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x438;.</li>
<li><strong>&#x421;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;</strong>: &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x440;&#x430;&#x437; &#x44D;&#x442;&#x43E; <em>&#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;</em> &#x435;&#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>if</code>, &#x43A;&#x430;&#x436;&#x434;&#x430;&#x44F; &#x432;&#x435;&#x442;&#x43A;&#x430; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x441;&#x43E;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x441; &#x443;&#x436;&#x435; &#x438;&#x43C;&#x435;&#x44E;&#x449;&#x438;&#x43C;&#x438;&#x441;&#x44F; &#x432;&#x435;&#x442;&#x43A;&#x430;&#x43C;&#x438; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438;. &#x424;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x44B; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x438; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x44B; &#x43F;&#x44B;&#x442;&#x430;&#x435;&#x442;&#x435;&#x441;&#x44C; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x430;&#x446;&#x438;&#x44E; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;/&#x43E;&#x43F;&#x446;&#x438;&#x439;/&#x43F;&#x440;&#x43E;&#x43F;&#x441;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x43D;&#x438;&#x43A;&#x442;&#x43E; &#x434;&#x430;&#x436;&#x435; &#x43D;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;, &#x43D;&#x43E; &#x432;&#x430;&#x43C; &#x432;&#x441;&#x435; &#x440;&#x430;&#x432;&#x43D;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x443;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x44B;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x44B;&#x435; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x44B;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x432;&#x44B; &#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x435;&#x442;&#x435;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x438;&#x43B;&#x438; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43B;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x442;&#x43E; &#x43B;&#x438;&#x431;&#x43E; &#x44D;&#x442;&#x438; &#x43A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x430;&#x446;&#x438;&#x438;.</li>
<li><strong>&#x421;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x439; API</strong>: &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;/&#x43E;&#x43F;&#x446;&#x438;&#x44F;/&#x43F;&#x440;&#x43E;&#x43F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x435; &#x432; &#x441;&#x432;&#x43E;&#x439; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x439; &#x43A;&#x43E;&#x434;, &#x437;&#x430;&#x442;&#x440;&#x443;&#x434;&#x43D;&#x44F;&#x435;&#x442; &#x435;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x443; &#x432;&#x430;&#x441; &#x435;&#x441;&#x442;&#x44C; &#x43E;&#x433;&#x440;&#x43E;&#x43C;&#x43D;&#x44B;&#x439; README &#x438;&#x43B;&#x438; &#x441;&#x430;&#x439;&#x442;, &#x433;&#x434;&#x435; &#x437;&#x430;&#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D; &#x432;&#x435;&#x441;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x44B;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;, &#x438; &#x43B;&#x44E;&#x434;&#x44F;&#x43C; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x438;&#x437;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x432;&#x441;&#x435; &#x44D;&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430;. &#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x442;&#x43E; &#x436;&#x435; &#x43D;&#x435; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x43E;, &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; API &#x43F;&#x440;&#x43E;&#x43D;&#x438;&#x43A;&#x430;&#x435;&#x442; &#x432; &#x43A;&#x43E;&#x434; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x435;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x443;&#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44F;&#x435;&#x442; &#x438; &#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x434;.</li>
</ol><br>
<p>&#x412; &#x438;&#x442;&#x43E;&#x433;&#x435; &#x432;&#x441;&#x435; &#x441;&#x442;&#x440;&#x430;&#x434;&#x430;&#x44E;&#x442;. &#x421;&#x442;&#x43E;&#x438;&#x442; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x447;&#x442;&#x43E; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x430;&#x436;&#x43D;&#x435;&#x439;&#x448;&#x435;&#x439; &#x447;&#x430;&#x441;&#x442;&#x44C;&#x44E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;. &#x41D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x431;&#x44B; &#x43C;&#x44B; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x434;&#x443;&#x43C;&#x430;&#x43B;&#x438; &#x43E; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x430;&#x448;&#x438;&#x445; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x439; (&#x447;&#x438;&#x442;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x440;&#x43E; <a href="https://kentcdodds.com/blog/aha-programming" rel="nofollow">&quot;AHA programming&quot;</a>). &#x421;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x43B;&#x438; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442; &#x43D;&#x430;&#x43C; &#x443;&#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x44B; &#x441; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x43C; &#x43A;&#x43E;&#x434;&#x43E;&#x43C;, &#x438;, &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C;, &#x432;&#x441;&#x435; &#x435;&#x449;&#x435; &#x43F;&#x43E;&#x436;&#x438;&#x43D;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x439;?</p><br>
<h2 id="inversiya-upravleniya">&#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;</h2><br>
<p>&#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x430;&#x435;&#x442; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x439;. &#x412;&#x43E;&#x442; &#x447;&#x442;&#x43E; &#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x442; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C; &#x412;&#x438;&#x43A;&#x438;&#x43F;&#x435;&#x434;&#x438;&#x44F;:</p><br>
<blockquote>&#x2026; &#x432; &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x439; &#x43A;&#x43E;&#x434;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x432;&#x44B;&#x440;&#x430;&#x436;&#x430;&#x435;&#x442; &#x43D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B;, &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x432; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43A;&#x440;&#x430;&#x442;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x44B;&#x445; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x430;&#x445; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x431;&#x449;&#x438;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447;, &#x43D;&#x43E; &#x441; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x435;&#x439; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E; &#x441;&#x440;&#x435;&#x434;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x438;&#x439; &#x438;&#x43B;&#x438; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x444;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x434;&#x43B;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x43A;&#x43E;&#x434;,</blockquote><p>&#x414;&#x443;&#x43C;&#x430;&#x439;&#x442;&#x435; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C; &#x442;&#x430;&#x43A;: &quot;&#x421;&#x43E;&#x43A;&#x440;&#x430;&#x442;&#x438;&#x442;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B; &#x432;&#x430;&#x448;&#x435;&#x439; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x438;, &#x438; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x439;&#x442;&#x435; &#x442;&#x430;&#x43A; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x432;&#x430;&#x448;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x438; &#x441;&#x430;&#x43C;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x439; &#x438;&#x43C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&quot;. &#x42D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x43C; &#x430;&#x431;&#x441;&#x443;&#x440;&#x434;&#x43E;&#x43C;, &#x43C;&#x44B; &#x436;&#x435; &#x432;&#x435;&#x434;&#x44C; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E; &#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x43F;&#x440;&#x44F;&#x442;&#x430;&#x442;&#x44C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x435; &#x438; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x44F;&#x44E;&#x449;&#x438;&#x435;&#x441;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;, &#x438; &#x442;&#x435;&#x43C; &#x441;&#x430;&#x43C;&#x44B;&#x43C; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x431;&#x43E;&#x43B;&#x435;&#x435; &quot;&#x447;&#x438;&#x441;&#x442;&#x44B;&#x43C;&quot; &#x438; &quot;&#x430;&#x43A;&#x43A;&#x443;&#x440;&#x430;&#x442;&#x43D;&#x44B;&#x43C;&quot;. &#x41D;&#x43E;, &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x443;&#x436;&#x435; &#x443;&#x431;&#x435;&#x434;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x432;&#x44B;&#x448;&#x435;, &#x442;&#x440;&#x430;&#x434;&#x438;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x435; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x435; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x430;&#x44E;&#x442; &#x43A;&#x43E;&#x434;.</p><br>
<h1 id="chto-takoe-inversiya-upravleniya-v-kode">&#x427;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x435; &#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x423;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x43A;&#x43E;&#x434;&#x435;?</h1><br>
<p>&#x414;&#x43B;&#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430;, &#x432;&#x43E;&#x442; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43D;&#x430;&#x434;&#x443;&#x43C;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p><br>
<pre><code class="javascript">// &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43C; &#x447;&#x442;&#x43E; Array.prototype.filter &#x43D;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442;
function filter(array) {
  let newArray = []
  for (let index = 0; index &lt; array.length; index++) {
    const element = array[index]
    if (element !== null &amp;&amp; element !== undefined) {
      newArray[newArray.length] = element
    }
  }
  return newArray
}

// &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:
filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;])
// [0, 1, 2, 3, &apos;four&apos;, &apos;&apos;]</code></pre><br>
<p>&#x422;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x440;&#x430;&#x437;&#x44B;&#x433;&#x440;&#x430;&#x435;&#x43C; &#x442;&#x438;&#x43F;&#x438;&#x447;&#x43D;&#x44B;&#x439; &quot;&#x436;&#x438;&#x437;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x439; &#x446;&#x438;&#x43A;&#x43B; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x438;&quot;, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44F; &#x432; &#x44D;&#x442;&#x443; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44E; &#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438; &quot;&#x431;&#x435;&#x437;&#x434;&#x443;&#x43C;&#x43D;&#x43E; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x430;&#x44F;&quot; &#x435;&#x433;&#x43E; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x430;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x438;&#x445; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;:</p><br>
<pre><code class="javascript">// &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43C; &#x447;&#x442;&#x43E; Array.prototype.filter &#x43D;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442;
function filter(
  array,
  {
    filterNull = true,
    filterUndefined = true,
    filterZero = false,
    filterEmptyString = false,
  } = {},
) {
  let newArray = []
  for (let index = 0; index &lt; array.length; index++) {
    const element = array[index]
    if (
      (filterNull &amp;&amp; element === null) ||
      (filterUndefined &amp;&amp; element === undefined) ||
      (filterZero &amp;&amp; element === 0) ||
      (filterEmptyString &amp;&amp; element === &apos;&apos;)
    ) {
      continue
    }
    newArray[newArray.length] = element
  }
  return newArray
}

filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;])
// [0, 1, 2, 3, &apos;four&apos;, &apos;&apos;]

filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;], {filterNull: false})
// [0, 1, 2, null, 3, &apos;four&apos;, &apos;&apos;]

filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;], {filterUndefined: false})
// [0, 1, 2, undefined, 3, &apos;four&apos;, &apos;&apos;]

filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;], {filterZero: true})
// [1, 2, 3, &apos;four&apos;, &apos;&apos;]

filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;], {filterEmptyString: true})
// [0, 1, 2, 3, &apos;four&apos;]</code></pre><br>
<p>&#x418;&#x442;&#x430;&#x43A;, &#x43D;&#x430;&#x448;&#x430; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x441; &#x448;&#x435;&#x441;&#x442;&#x44C;&#x44E; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x430;&#x43C;&#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43D;&#x43E; &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43C;&#x44B; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x43C; &#x43B;&#x44E;&#x431;&#x443;&#x44E; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x443;&#x44E; &#x43A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x430;&#x446;&#x438;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x439;, &#x438; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x43A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x430;&#x446;&#x438;&#x439; &#x43D;&#x430;&#x441;&#x447;&#x438;&#x442;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x430;&#x436; 25 (&#x435;&#x441;&#x43B;&#x438; &#x44F; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x43E;&#x441;&#x447;&#x438;&#x442;&#x430;&#x43B;).</p><br>
<p>&#x412; &#x446;&#x435;&#x43B;&#x43E;&#x43C;, &#x44D;&#x442;&#x43E; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x44F; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44F;. &#x41D;&#x43E; &#x435;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x44C;. &#x427;&#x430;&#x441;&#x442;&#x43E; &#x431;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x442;&#x430;&#x43A;, &#x447;&#x442;&#x43E; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44E;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x43B;&#x438; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x438;&#x442;&#x44C; &#x434;&#x43B;&#x44F; &#x442;&#x435;&#x445; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43E;&#x43D;&#x430; &#x444;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x438; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442;. &#x41A; &#x441;&#x43E;&#x436;&#x430;&#x43B;&#x435;&#x43D;&#x438;&#x44E;, &#x43A;&#x430;&#x43A; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44F; &#x43D;&#x430;&#x447;&#x438;&#x43D;&#x430;&#x435;&#x442; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x435; <code>{ filterZero: true, filterUndefined: false }</code>), &#x43C;&#x44B; &#x431;&#x43E;&#x438;&#x43C;&#x441;&#x44F; &#x443;&#x434;&#x430;&#x43B;&#x44F;&#x442;&#x44C; &#x44D;&#x442;&#x443; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x438;&#x437;-&#x437;&#x430; &#x442;&#x43E;&#x433;&#x43E; &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x441;&#x43B;&#x43E;&#x43C;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43D;&#x430; &#x43D;&#x435;&#x435; &#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x435;&#x442;&#x441;&#x44F;.</p><br>
<p>&#x41C;&#x44B; &#x434;&#x430;&#x436;&#x435; &#x43F;&#x438;&#x448;&#x435;&#x43C; &#x442;&#x435;&#x441;&#x442;&#x44B; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x443; &#x43D;&#x430;&#x441;, &#x43D;&#x430; &#x441;&#x430;&#x43C;&#x43E;&#x43C; &#x434;&#x435;&#x43B;&#x435; &#x43D;&#x435;&#x442;&#x443;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x443; &#x447;&#x442;&#x43E; &#x43D;&#x430;&#x448;&#x430; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44F; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x44D;&#x442;&#x438; &#x441;&#x446;&#x435;&#x43D;&#x430;&#x440;&#x438;&#x438;, &#x438; &#x43D;&#x430;&#x43C; &quot;&#x43C;&#x43E;&#x436;&#x435;&#x442;&quot; &#x43F;&#x43E;&#x43D;&#x430;&#x434;&#x43E;&#x431;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E; &#x432; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C;. &#x410; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x442;&#x435; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x44B;&#x435; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x44F;&#x442;&#x441;&#x44F; &#x43D;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x43C;&#x438; &#x434;&#x43B;&#x44F; &#x43D;&#x430;&#x441;, &#x43C;&#x44B; &#x43D;&#x435; &#x443;&#x434;&#x430;&#x43B;&#x44F;&#x435;&#x43C; &#x438;&#x445; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x437;&#x430;&#x431;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C;, &#x438;&#x43B;&#x438; &#x434;&#x443;&#x43C;&#x430;&#x435;&#x43C; &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x440;&#x438;&#x433;&#x43E;&#x434;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430;&#x43C; &#x432; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C;, &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x431;&#x43E;&#x438;&#x43C;&#x441;&#x44F; &#x447;&#x435;&#x433;&#x43E; &#x43D;&#x438;&#x431;&#x443;&#x434;&#x44C; &#x441;&#x43B;&#x43E;&#x43C;&#x430;&#x442;&#x44C;.</p><br>
<p>&#x41E;&#x43A;&#x435;&#x439;, &#x434;&#x430;&#x432;&#x430;&#x439;&#x442;&#x435; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43D;&#x430;&#x43F;&#x438;&#x448;&#x435;&#x43C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x434;&#x443;&#x43C;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44E; &#x43A; &#x44D;&#x442;&#x43E;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x438; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x438; &#x432;&#x441;&#x435;&#x445; &#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x445; &#x43D;&#x430;&#x43C; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;:</p><br>
<pre><code class="javascript">// &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43C; &#x447;&#x442;&#x43E; Array.prototype.filter &#x43D;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442;
function filter(array, filterFn) {
  let newArray = []
  for (let index = 0; index &lt; array.length; index++) {
    const element = array[index]
    if (filterFn(element)) {
      newArray[newArray.length] = element
    }
  }
  return newArray
}

filter(
  [0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;],
  el =&gt; el !== null &amp;&amp; el !== undefined,
)
// [0, 1, 2, 3, &apos;four&apos;, &apos;&apos;]

filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;], el =&gt; el !== undefined)
// [0, 1, 2, null, 3, &apos;four&apos;, &apos;&apos;]

filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;], el =&gt; el !== null)
// [0, 1, 2, undefined, 3, &apos;four&apos;, &apos;&apos;]

filter(
  [0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;],
  el =&gt; el !== undefined &amp;&amp; el !== null &amp;&amp; el !== 0,
)
// [1, 2, 3, &apos;four&apos;, &apos;&apos;]

filter(
  [0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;],
  el =&gt; el !== undefined &amp;&amp; el !== null &amp;&amp; el !== &apos;&apos;,
)
// [0, 1, 2, 3, &apos;four&apos;]</code></pre><br>
<p>&#x41E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E;! &#x412;&#x44B;&#x448;&#x43B;&#x43E; &#x43D;&#x430;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435;. &#x41C;&#x44B; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x447;&#x442;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x43B;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x435;&#x439;, &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x437;&#x430; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x438;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x43E; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x43F;&#x43E;&#x43F;&#x430;&#x434;&#x430;&#x435;&#x442; &#x432; &#x43D;&#x43E;&#x432;&#x44B;&#x439; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;, &#x441; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; <code>filter</code> &#x43D;&#x430; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E;, &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x449;&#x443;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x430;. &#x417;&#x430;&#x43C;&#x435;&#x442;&#x44C;&#x442;&#x435;, &#x447;&#x442;&#x43E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; <code>filter</code> &#x432;&#x441;&#x435; &#x435;&#x449;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E;&#x439; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x435;&#x439; &#x441;&#x430;&#x43C;&#x430; &#x43F;&#x43E; &#x441;&#x435;&#x431;&#x435;, &#x43D;&#x43E; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43E;&#x43D;&#x430; &#x433;&#x43E;&#x440;&#x430;&#x437;&#x434;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x433;&#x438;&#x431;&#x43A;&#x430;&#x44F;.</p><br>
<p>&#x41D;&#x43E; &#x431;&#x44B;&#x43B;&#x430; &#x43B;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x430;&#x44F; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x44D;&#x442;&#x43E;&#x439; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x443;&#x436; &#x43F;&#x43B;&#x43E;&#x445;&#x43E;&#x439;? &#x412;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x43D;&#x435;&#x442;. &#x41D;&#x43E; &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x432;&#x435;&#x440;&#x43D;&#x443;&#x43B;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;, &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x433;&#x43E;&#x440;&#x430;&#x437;&#x434;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x443;&#x43D;&#x438;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;:</p><br>
<pre><code class="javascript">filter(
  [
    {name: &apos;dog&apos;, legs: 4, mammal: true},
    {name: &apos;dolphin&apos;, legs: 0, mammal: true},
    {name: &apos;eagle&apos;, legs: 2, mammal: false},
    {name: &apos;elephant&apos;, legs: 4, mammal: true},
    {name: &apos;robin&apos;, legs: 2, mammal: false},
    {name: &apos;cat&apos;, legs: 4, mammal: true},
    {name: &apos;salmon&apos;, legs: 0, mammal: false},
  ],
  animal =&gt; animal.legs === 0,
)
// [
//   {name: &apos;dolphin&apos;, legs: 0, mammal: true},
//   {name: &apos;salmon&apos;, legs: 0, mammal: false},
// ]</code></pre><br>
<p>&#x422;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x44C;&#x442;&#x435; &#x435;&#x441;&#x43B;&#x438; &#x431;&#x44B; &#x432;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443; &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x44F; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;? &#x414;&#x430; &#x44D;&#x442;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43D;&#x435;&#x43B;&#x435;&#x43F;&#x43E;.</p><br>
<h1 id="plohoy-api">&#x41F;&#x43B;&#x43E;&#x445;&#x43E;&#x439; API?</h1><br>
<p>&#x41E;&#x434;&#x43D;&#x430; &#x438;&#x437; &#x441;&#x430;&#x43C;&#x44B;&#x445; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x436;&#x430;&#x43B;&#x43E;&#x431;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x44F; &#x441;&#x43B;&#x44B;&#x448;&#x443; &#x43E;&#x442; &#x43B;&#x44E;&#x434;&#x435;&#x439;, &#x43A;&#x430;&#x441;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; API-&#x438;&#x43D;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x43E;&#x432; &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E;: &quot;&#x414;&#x430;, &#x43D;&#x43E; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x44D;&#x442;&#x438;&#x43C; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x435;&#x435; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F;, &#x447;&#x435;&#x43C; &#x440;&#x430;&#x43D;&#x44C;&#x448;&#x435;&quot;. &#x412;&#x43E;&#x437;&#x44C;&#x43C;&#x438;&#x442;&#x435; &#x44D;&#x442;&#x43E;&#x442; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:</p><br>
<pre><code class="javascript">// &#x434;&#x43E;
filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;])

// &#x43F;&#x43E;&#x441;&#x43B;&#x435;
filter(
  [0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;],
  el =&gt; el !== null &amp;&amp; el !== undefined,
)</code></pre><br>
<p>&#x414;&#x430;, &#x43E;&#x434;&#x438;&#x43D; &#x438;&#x437; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x44F;&#x432;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435; &#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x438;, &#x447;&#x435;&#x43C; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439;. &#x41D;&#x43E; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x438;&#x437; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x442;&#x43E; &#x447;&#x442;&#x43E; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; API &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E;&#x439; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x433;&#x43E; API. &#x41E;&#x431;&#x44B;&#x447;&#x43D;&#x43E; &#x44D;&#x442;&#x43E; &#x434;&#x43E;&#x432;&#x43E;&#x43B;&#x44C;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;. &#x41A; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x443;:</p><br>
<pre><code class="javascript">function filterWithOptions(
  array,
  {
    filterNull = true,
    filterUndefined = true,
    filterZero = false,
    filterEmptyString = false,
  } = {},
) {
  return filter(
    array,
    element =&gt;
      !(
        (filterNull &amp;&amp; element === null) ||
        (filterUndefined &amp;&amp; element === undefined) ||
        (filterZero &amp;&amp; element === 0) ||
        (filterEmptyString &amp;&amp; element === &apos;&apos;)
      ),
  )
}</code></pre><br>
<p>&#x41A;&#x440;&#x443;&#x442;&#x43E;, &#x434;&#x430;? &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x43F;&#x43E;&#x432;&#x435;&#x440;&#x445; API &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x438; &#x442;&#x435;&#x43C; &#x441;&#x430;&#x43C;&#x44B;&#x43C; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; API. &#x410; &#x435;&#x441;&#x43B;&#x438; &#x432; &#x43D;&#x430;&#x448;&#x435;&#x43C; &quot;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x43C;&quot; API &#x43D;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x442;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x430;&#x448;&#x438; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x442;&#x435; &#x436;&#x435; &#x441;&#x430;&#x43C;&#x44B;&#x435; &#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x431;&#x43B;&#x43E;&#x43A;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43C;&#x44B; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43B;&#x438; &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x432;&#x44B;&#x441;&#x43E;&#x43A;&#x43E;&#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435;&#x432;&#x43E;&#x433;&#x43E; API, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447;. &#x418;&#x43C; &#x43D;&#x435; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x43D;&#x430;&#x441; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x443;&#x44E; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; &#x432; <code>filterWithOptions</code> &#x438; &#x436;&#x434;&#x430;&#x442;&#x44C;, &#x43F;&#x43E;&#x43A;&#x430; &#x43E;&#x43D;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x430;. &#x423; &#x43D;&#x438;&#x445; &#x443;&#x436;&#x435; &#x435;&#x441;&#x442;&#x44C; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x438; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x445; &#x43E;&#x43D;&#x438; &#x43C;&#x43E;&#x433;&#x443;&#x442; &#x441;&#x430;&#x43C;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x439; &#x438;&#x43C; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;.</p><br>
<p>&#x418;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x434;&#x43B;&#x44F; &#x444;&#x430;&#x43D;&#x430;:</p><br>
<pre><code class="javascript">function filterByLegCount(array, legCount) {
  return filter(array, animal =&gt; animal.legs === legCount)
}

filterByLegCount(
  [
    {name: &apos;dog&apos;, legs: 4, mammal: true},
    {name: &apos;dolphin&apos;, legs: 0, mammal: true},
    {name: &apos;eagle&apos;, legs: 2, mammal: false},
    {name: &apos;elephant&apos;, legs: 4, mammal: true},
    {name: &apos;robin&apos;, legs: 2, mammal: false},
    {name: &apos;cat&apos;, legs: 4, mammal: true},
    {name: &apos;salmon&apos;, legs: 0, mammal: false},
  ],
  0,
)
// [
//   {name: &apos;dolphin&apos;, legs: 0, mammal: true},
//   {name: &apos;salmon&apos;, legs: 0, mammal: false},
// ]</code></pre><br>
<p>&#x41C;&#x43E;&#x436;&#x43D;&#x43E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B; &#x434;&#x43B;&#x44F; &#x43B;&#x44E;&#x431;&#x43E;&#x439; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x438; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x432;&#x441;&#x442;&#x440;&#x435;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x443; &#x432;&#x430;&#x441;.</p><br>
<h2 id="primery-iz-realnoy-zhizni">&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x438;&#x437; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x436;&#x438;&#x437;&#x43D;&#x438;</h2><br>
<p>&#x418;&#x442;&#x430;&#x43A;, &#x44D;&#x442;&#x43E; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x432; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x445; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;&#x445;, &#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x43E;&#x439;&#x434;&#x435;&#x442; &#x43B;&#x438; &#x44D;&#x442;&#x430; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x436;&#x438;&#x437;&#x43D;&#x438;? &#x427;&#x442;&#x43E; &#x436;, &#x441;&#x43A;&#x43E;&#x440;&#x435;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x432;&#x44B; &#x43F;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x435; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;. &#x41A; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x443;, &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; <code>Array.prototype.filter</code> &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;. &#x41A;&#x430;&#x43A; &#x438; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44F; <code>Array.prototype.map</code>.</p><br>
<p>&#x421;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x442; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x44B;, &#x441; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x43C;&#x438; &#x432;&#x44B;, &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;, &#x443;&#x436;&#x435; &#x437;&#x43D;&#x430;&#x43A;&#x43E;&#x43C;&#x44B;, &#x438; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x438;&#x437; &#x444;&#x43E;&#x440;&#x43C; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;.</p><br>
<p>&#x412;&#x43E;&#x442; &#x434;&#x432;&#x430; &#x43C;&#x43E;&#x438;&#x445; &#x43B;&#x44E;&#x431;&#x438;&#x43C;&#x44B;&#x445; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x434;&#x435;&#x43C;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x44E;&#x442; &#x44D;&#x442;&#x43E; <a href="https://kentcdodds.com/blog/compound-components-with-react-hooks" rel="nofollow">&quot;Compound Components&quot;</a> &#x438; <a href="https://kentcdodds.com/blog/the-state-reducer-pattern" rel="nofollow">&quot;State Reducers&quot;</a>. &#x41D;&#x438;&#x436;&#x435; &#x438;&#x434;&#x443;&#x442; &#x43A;&#x440;&#x430;&#x442;&#x43A;&#x438;&#x435; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x442;&#x43E;&#x433;&#x43E;, &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x44D;&#x442;&#x438; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x44B;.</p><br>
<h3 id="sostavnye-komponenty-compound-components">&#x421;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43D;&#x44B;&#x435; &#x41A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B; (Compound Components)</h3><br>
<p>&#x414;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;, &#x432;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; <code>Menu</code>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x443; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x438;&#x44F; &#x43C;&#x435;&#x43D;&#x44E; &#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x43E;&#x432; &#x43C;&#x435;&#x43D;&#x44E;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x436;&#x430;&#x442;&#x438;&#x438; &#x43D;&#x430; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x443;. &#x417;&#x430;&#x442;&#x435;&#x43C;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x43D;, &#x43E;&#x43D; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C; &#x43A;&#x430;&#x43A;&#x438;&#x435;-&#x442;&#x43E; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F;. &#x41E;&#x431;&#x44B;&#x447;&#x43D;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E;, &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x44E;&#x442; &#x43F;&#x440;&#x43E;&#x43F;&#x441;&#x44B;:</p><br>
<pre><code class="xml">function App() {
  return (
    &lt;Menu
      buttonContents={
        &lt;&gt;
          Actions &lt;span aria-hidden&gt;&#x25BE;&lt;/span&gt;
        &lt;/&gt;
      }
      items={[
        {contents: &apos;Download&apos;, onSelect: () =&gt; alert(&apos;Download&apos;)},
        {contents: &apos;Create a Copy&apos;, onSelect: () =&gt; alert(&apos;Create a Copy&apos;)},
        {contents: &apos;Delete&apos;, onSelect: () =&gt; alert(&apos;Delete&apos;)},
      ]}
    /&gt;
  )
}</code></pre><br>
<p>&#x42D;&#x442;&#x43E; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x435;&#x442; &#x43D;&#x430;&#x43C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x447;&#x435;&#x433;&#x43E; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C; &#x432; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x430;&#x445; &#x43C;&#x435;&#x43D;&#x44E;. &#x41D;&#x43E; &#x447;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x43C;&#x44B; &#x445;&#x43E;&#x442;&#x438;&#x43C; &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43B;&#x438;&#x43D;&#x438;&#x44E; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x43E;&#x43C; &#x43C;&#x435;&#x43D;&#x44E; Delete? &#x414;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x43B;&#x438; &#x43C;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x43E;&#x43F;&#x446;&#x438;&#x44E; &#x43A; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x430;&#x43C; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x44F;&#x449;&#x438;&#x43C;&#x441;&#x44F; &#x43A; &#x43F;&#x440;&#x43E;&#x43F;&#x443; <code>items</code>? &#x41D;&#x443;, &#x44F; &#x43D;&#x435; &#x437;&#x43D;&#x430;&#x44E;, &#x43A; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x443;: <code>precedeWithLine</code>? &#x422;&#x430;&#x43A; &#x441;&#x435;&#x431;&#x435; &#x438;&#x434;&#x435;&#x44F;.</p><br>
<p>&#x41C;&#x43E;&#x436;&#x435;&#x442;, &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x43E;&#x441;&#x43E;&#x431;&#x44B;&#x439; &#x432;&#x438;&#x434; &#x43F;&#x443;&#x43D;&#x43A;&#x442;&#x430; &#x43C;&#x435;&#x43D;&#x44E;, &#x43A; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x443; <code>{contents: &lt;hr /&gt;}</code>. &#x414;&#x443;&#x43C;&#x430;&#x44E;, &#x44D;&#x442;&#x43E; &#x441;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43B;&#x43E; &#x431;&#x44B;, &#x43D;&#x43E; &#x442;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x448;&#x43B;&#x43E;&#x441;&#x44C; &#x431;&#x44B; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x438;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x435;&#x442; <code>onSelect</code>. &#x418;, &#x435;&#x441;&#x43B;&#x438; &#x447;&#x435;&#x441;&#x442;&#x43D;&#x43E;, &#x44D;&#x442;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43D;&#x435;&#x43B;&#x43E;&#x432;&#x43A;&#x438;&#x439; API.</p><br>
<p>&#x41A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x44B; &#x434;&#x443;&#x43C;&#x430;&#x435;&#x442;&#x435; &#x43E; &#x442;&#x43E;&#x43C;, &#x43A;&#x430;&#x43A; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x445;&#x43E;&#x440;&#x43E;&#x448;&#x438;&#x439; API &#x434;&#x43B;&#x44F; &#x43B;&#x44E;&#x434;&#x435;&#x439;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x44B;&#x442;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x43D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;-&#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C;&#x443;, &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x442;&#x43E;&#x433;&#x43E; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x442;&#x44F;&#x43D;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x43A; <code>if</code> &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x443;, &#x43F;&#x43E;&#x43F;&#x440;&#x43E;&#x431;&#x443;&#x439;&#x442;&#x435; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;. &#x427;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x434;&#x438;&#x43C; &#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x437;&#x430; &#x432;&#x438;&#x437;&#x443;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44E; &#x43C;&#x435;&#x43D;&#x44E; &#x43D;&#x430; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;? &#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C; &#x43E;&#x434;&#x43D;&#x443; &#x438;&#x437; &#x441;&#x430;&#x43C;&#x44B;&#x445; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x430;:</p><br>
<pre><code class="xml">function App() {
  return (
    &lt;Menu&gt;
      &lt;MenuButton&gt;
        Actions &lt;span aria-hidden&gt;&#x25BE;&lt;/span&gt;
      &lt;/MenuButton&gt;
      &lt;MenuList&gt;
        &lt;MenuItem onSelect={() =&gt; alert(&apos;Download&apos;)}&gt;Download&lt;/MenuItem&gt;
        &lt;MenuItem onSelect={() =&gt; alert(&apos;Copy&apos;)}&gt;Create a Copy&lt;/MenuItem&gt;
        &lt;MenuItem onSelect={() =&gt; alert(&apos;Delete&apos;)}&gt;Delete&lt;/MenuItem&gt;
      &lt;/MenuList&gt;
    &lt;/Menu&gt;
  )
}</code></pre><br>
<p>&#x412;&#x430;&#x436;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;, &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x442;&#x44C; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435; &#x2014; &#x437;&#x434;&#x435;&#x441;&#x44C; &#x43D;&#x435;&#x442; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F; (<code>state</code>) &#x432;&#x438;&#x434;&#x438;&#x43C;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x421;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; &#x43D;&#x435;&#x44F;&#x432;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x44D;&#x442;&#x438;&#x43C;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x42D;&#x442;&#x43E; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430;&#x44F; &#x446;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x430; &#x441;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43D;&#x44B;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x418;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; &#x44D;&#x442;&#x443; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43C;&#x44B; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43B;&#x438; &#x43D;&#x435;&#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44C; &#x43D;&#x430;&#x434; &#x440;&#x435;&#x43D;&#x434;&#x435;&#x440;&#x438;&#x43D;&#x433;&#x43E;&#x43C; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44E; &#x43D;&#x430;&#x448;&#x438;&#x445; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x438; &#x442;&#x435;&#x43F;&#x435;&#x440;&#x44C; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; (&#x438;&#x43B;&#x438; &#x447;&#x435;&#x433;&#x43E;-&#x442;&#x43E; &#x435;&#x449;&#x435;) &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x43C; &#x438; &#x438;&#x43D;&#x442;&#x443;&#x438;&#x442;&#x438;&#x432;&#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x43D;&#x44B;&#x43C; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435;&#x43C;. &#x41D;&#x438;&#x43A;&#x430;&#x43A;&#x43E;&#x439; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438;, &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x438;&#x445; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x439;, &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x43E;&#x433;&#x43E; &#x43B;&#x438;&#x448;&#x43D;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x438;&#x43B;&#x438; &#x442;&#x435;&#x441;&#x442;&#x43E;&#x432;. &#x412;&#x441;&#x435; &#x432; &#x432;&#x44B;&#x438;&#x433;&#x440;&#x44B;&#x448;&#x435;.</p><br>
<p>&#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D;&#x435; <a href="https://kentcdodds.com/blog/compound-components-with-react-hooks" rel="nofollow">&#x437;&#x434;&#x435;&#x441;&#x44C;</a>. &#x421;&#x43F;&#x430;&#x441;&#x438;&#x431;&#x43E; <a href="https://twitter.com/ryanflorence" rel="nofollow">&#x420;&#x430;&#x439;&#x430;&#x43D;&#x443; &#x424;&#x43B;&#x43E;&#x440;&#x435;&#x43D;&#x441;&#x443;</a>, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43D;&#x430;&#x443;&#x447;&#x438;&#x43B; &#x43C;&#x435;&#x43D;&#x44F; &#x44D;&#x442;&#x43E;&#x43C;&#x443;.</p><br>
<h3 id="redyuser-sostoyaniya-state-reducer">&#x420;&#x435;&#x434;&#x44E;&#x441;&#x435;&#x440; &#x421;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F; (State Reducer)</h3><br>
<p>&#x42F; &#x43F;&#x440;&#x438;&#x434;&#x443;&#x43C;&#x430;&#x43B; &#x44D;&#x442;&#x43E;&#x442; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x440;&#x435;&#x448;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x412;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43E; &#x442;&#x43E;&#x439; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x438; &#x432; &#x43C;&#x43E;&#x435;&#x43C; &#x431;&#x43B;&#x43E;&#x433;&#x435; <a href="https://kentcdodds.com/blog/the-state-reducer-pattern" rel="nofollow">&quot;The State Reducer Pattern&quot;</a>, &#x43D;&#x43E; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x430;&#x44F; &#x441;&#x443;&#x442;&#x44C; &#x432; &#x442;&#x43E;&#x43C;, &#x447;&#x442;&#x43E; &#x443; &#x43C;&#x435;&#x43D;&#x44F; &#x435;&#x441;&#x442;&#x44C; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x430; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430;/&#x430;&#x432;&#x442;&#x43E;&#x437;&#x430;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;/&#x432;&#x432;&#x43E;&#x434;&#x430; &#x442;&#x438;&#x43F;&#x43E;&#x432;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43D;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; <code>Downshift</code>, &#x438; &#x43E;&#x434;&#x438;&#x43D; &#x438;&#x437; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x430;&#x442;&#x44B;&#x432;&#x430;&#x43B; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430; &#x441; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x432;&#x44B;&#x431;&#x43E;&#x440;&#x43E;&#x43C;, &#x438;&#x437;-&#x437;&#x430; &#x447;&#x435;&#x433;&#x43E; &#x43E;&#x43D; &#x445;&#x43E;&#x442;&#x435;&#x43B; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43C;&#x435;&#x43D;&#x44E; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43E;&#x442;&#x43A;&#x440;&#x44B;&#x442;&#x44B;&#x43C; &#x434;&#x430;&#x436;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x432;&#x44B;&#x431;&#x43E;&#x440;&#x430; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;&#x430;.</p><br>
<p>&#x41B;&#x43E;&#x433;&#x438;&#x43A;&#x430; <code>Downshift</code> &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x430;&#x433;&#x430;&#x43B;&#x430; &#x447;&#x442;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x43A; &#x432;&#x44B;&#x431;&#x43E;&#x440; &#x431;&#x44B;&#x43B; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43D;, &#x43C;&#x435;&#x43D;&#x44E; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x437;&#x430;&#x43A;&#x440;&#x44B;&#x442;&#x44C;&#x441;&#x44F;. &#x41F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x43C;&#x443; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x435;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B;, &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x438;&#x43B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x43F; <code>closeOnSelection</code>. &#x42F; &#x43E;&#x442;&#x43A;&#x430;&#x437;&#x430;&#x43B;&#x441;&#x44F; &#x43E;&#x442; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x43E;&#x434;&#x43D;&#x430;&#x436;&#x434;&#x44B; &#x443;&#x436;&#x435; &#x43F;&#x440;&#x43E;&#x448;&#x435;&#x43B; &#x43F;&#x43E; &#x43F;&#x443;&#x442;&#x438; &#x432;&#x435;&#x434;&#x443;&#x449;&#x435;&#x43C;&#x443; &#x43A; <a href="https://twitter.com/gurlcode/status/1002110517094371328" rel="nofollow">&#x430;&#x43F;&#x440;&#x43E;&#x43F;&#x43A;&#x430;&#x43B;&#x438;&#x43F;&#x441;&#x438;&#x441;&#x443;</a>, &#x438; &#x445;&#x43E;&#x442;&#x435;&#x43B; &#x438;&#x437;&#x431;&#x435;&#x436;&#x430;&#x442;&#x44C; &#x44D;&#x442;&#x43E;&#x433;&#x43E;.</p><br>
<p>&#x412;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x44F; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x43B; API &#x442;&#x430;&#x43A;&#x438;&#x43C;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x438; &#x441;&#x430;&#x43C;&#x438; &#x43C;&#x43E;&#x433;&#x43B;&#x438; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x430;&#x43A; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x44F;&#x442; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;. &#x414;&#x443;&#x43C;&#x430;&#x439;&#x442;&#x435; &#x43E; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x438; &#x440;&#x435;&#x434;&#x44E;&#x441;&#x435;&#x440;&#x430; (<code>state reducer</code>) &#x43A;&#x430;&#x43A; &#x43E; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x440;&#x430;&#x437;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;, &#x438; &#x434;&#x430;&#x435;&#x442; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x443; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x432;&#x43B;&#x438;&#x44F;&#x442;&#x44C; &#x43D;&#x430; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x44F;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x43E;&#x439;&#x442;&#x438;.</p><br>
<p>&#x41F;&#x440;&#x438;&#x43C;&#x435;&#x440; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x438; <code>Downshift</code> &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43E;&#x43D;&#x430; &#x43D;&#x435; &#x437;&#x430;&#x43A;&#x440;&#x44B;&#x432;&#x430;&#x43B;&#x430; &#x43C;&#x435;&#x43D;&#x44E; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x43A; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C; &#x43D;&#x430;&#x436;&#x430;&#x43B; &#x43D;&#x430; &#x432;&#x44B;&#x431;&#x440;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x44D;&#x43B;&#x435;&#x43C;&#x435;&#x43D;&#x442;:</p><br>
<pre><code class="javascript">function stateReducer(state, changes) {
  switch (changes.type) {
    case Downshift.stateChangeTypes.keyDownEnter:
    case Downshift.stateChangeTypes.clickItem:
      return {
        ...changes,
        // &#x43D;&#x430;&#x441; &#x443;&#x441;&#x442;&#x440;&#x430;&#x438;&#x432;&#x430;&#x44E;&#x442; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; Downshift &#x445;&#x43E;&#x447;&#x435;&#x442; &#x441;&#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;
        // &#x437;&#x430; &#x438;&#x441;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x442;&#x43E;&#x433;&#x43E; &#x447;&#x442;&#x43E; &#x43C;&#x44B; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43C; isOpen &#x438; highlightedIndex
        // &#x442;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x43A;&#x430;&#x43A;&#x438;&#x43C;&#x438; &#x43E;&#x43D;&#x438; &#x438; &#x431;&#x44B;&#x43B;&#x438;
        isOpen: state.isOpen,
        highlightedIndex: state.highlightedIndex,
      }
    default:
      return changes
  }
}
// &#x43F;&#x43E;&#x442;&#x43E;&#x43C;, &#x43F;&#x440;&#x438; &#x440;&#x435;&#x43D;&#x434;&#x435;&#x440;&#x438;&#x43D;&#x433;&#x435;
// &lt;Downshift stateReducer={stateReducer} {...restOfTheProps} /&gt;</code></pre><br>
<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43B;&#x438; &#x44D;&#x442;&#x43E;&#x442; &#x43F;&#x440;&#x43E;&#x43F;, &#x43C;&#x44B; &#x441;&#x442;&#x430;&#x43B;&#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x41D;&#x410;&#x41C;&#x41D;&#x41E;&#x413;&#x41E; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432; &#x43D;&#x430; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x43E;&#x432;&#x44B;&#x445; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43A; &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x430;. &#x41A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442; &#x441;&#x442;&#x430;&#x43B; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x433;&#x438;&#x431;&#x43A;&#x438;&#x43C;, &#x438; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430;&#x43C; &#x441;&#x442;&#x430;&#x43B;&#x43E; &#x43F;&#x440;&#x43E;&#x449;&#x435; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x430;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x438;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; &#x438;&#x43C;.</p><br>
<h3 id="render-propsy-render-props">&#x420;&#x435;&#x43D;&#x434;&#x435;&#x440;-&#x43F;&#x440;&#x43E;&#x43F;&#x441;&#x44B; (Render Props)</h3><br>
<p>&#x421;&#x442;&#x43E;&#x438;&#x442; &#x443;&#x43F;&#x43E;&#x43C;&#x44F;&#x43D;&#x443;&#x442;&#x44C; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D; <a href="https://reactjs.org/docs/render-props.html" rel="nofollow">&quot;render props&quot;</a>. &#x42D;&#x442;&#x43E;&#x442; &#x43F;&#x430;&#x442;&#x442;&#x435;&#x440;&#x43D; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x434;&#x435;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x43C; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;, &#x43D;&#x43E; &#x43E;&#x43D; &#x43D;&#x430;&#x43C; &#x43E;&#x441;&#x43E;&#x431;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x438; &#x43D;&#x435; &#x43D;&#x443;&#x436;&#x435;&#x43D;. &#x41F;&#x43E;&#x434;&#x440;&#x43E;&#x431;&#x43D;&#x435;&#x435; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x43C; &#x437;&#x434;&#x435;&#x441;&#x44C;: <a href="https://kentcdodds.com/blog/react-hooks-whats-going-to-happen-to-render-props" rel="nofollow">why we don&apos;t need Render Props as much anymore</a>.</p><br>
<h2 id="preduprezhdenie">&#x41F;&#x440;&#x435;&#x434;&#x443;&#x43F;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435;</h2><br>
<p>&#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x442;&#x43E; &#x43F;&#x43E;&#x442;&#x440;&#x44F;&#x441;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x43E;&#x431;&#x43E;&#x439;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x431;&#x43B;&#x435;&#x43C;&#x443; &#x43D;&#x435;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43E; &#x442;&#x43E;&#x43C; &#x43A;&#x430;&#x43A; &#x432;&#x430;&#x448; &#x43A;&#x43E;&#x434; &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43C;. &#x41D;&#x43E; &#x43F;&#x440;&#x435;&#x436;&#x434;&#x435; &#x447;&#x435;&#x43C; &#x437;&#x430;&#x43A;&#x43E;&#x43D;&#x447;&#x438;&#x442;&#x44C;, &#x43C;&#x43D;&#x435; &#x431;&#x44B; &#x445;&#x43E;&#x442;&#x435;&#x43B;&#x43E;&#x441;&#x44C; &#x434;&#x430;&#x442;&#x44C; &#x432;&#x430;&#x43C; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x43E;&#x432;&#x435;&#x442;&#x43E;&#x432;.</p><br>
<p>&#x412;&#x435;&#x440;&#x43D;&#x435;&#x43C;&#x441;&#x44F; &#x43A; &#x43D;&#x430;&#x448;&#x435;&#x43C;&#x443; &#x43D;&#x430;&#x434;&#x443;&#x43C;&#x430;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x443;:</p><br>
<pre><code class="javascript">// &#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x438;&#x43C; &#x447;&#x442;&#x43E; Array.prototype.filter &#x43D;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442;
function filter(array) {
  let newArray = []
  for (let index = 0; index &lt; array.length; index++) {
    const element = array[index]
    if (element !== null &amp;&amp; element !== undefined) {
      newArray[newArray.length] = element
    }
  }
  return newArray
}

// &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;:

filter([0, 1, undefined, 2, null, 3, &apos;four&apos;, &apos;&apos;])
// [0, 1, 2, 3, &apos;four&apos;, &apos;&apos;]
</code></pre><br>
<p>&#x427;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x432;&#x441;&#x435; &#x447;&#x442;&#x43E; &#x43D;&#x430;&#x43C; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; <code>filter</code>? &#x418; &#x43C;&#x44B; &#x43D;&#x438;&#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43B;&#x43A;&#x438;&#x432;&#x430;&#x43B;&#x438;&#x441;&#x44C; &#x441; &#x441;&#x438;&#x442;&#x443;&#x430;&#x446;&#x438;&#x435;&#x439;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x43D;&#x430;&#x43C; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x447;&#x442;&#x43E;-&#x43B;&#x438;&#x431;&#x43E; &#x43A;&#x440;&#x43E;&#x43C;&#x435; <code>null</code> &#x438; <code>undefined</code>? &#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; &#x443;&#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x438;&#x43B;&#x43E; &#x431;&#x44B; &#x43A;&#x43E;&#x434; &#x438; &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x435;&#x441;&#x43B;&#x43E; &#x431;&#x44B; &#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x439; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x44B;.</p><br>
<p>&#x41A;&#x430;&#x43A; &#x438; &#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x441; &#x43B;&#x44E;&#x431;&#x44B;&#x43C;&#x438; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44F;&#x43C;&#x438;, &#x431;&#x443;&#x434;&#x44C;&#x442;&#x435; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;, &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x439;&#x442;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; <a href="https://kentcdodds.com/blog/aha-programming" rel="nofollow">AHA Programming</a> &#x438; &#x438;&#x437;&#x431;&#x435;&#x433;&#x430;&#x439;&#x442;&#x435; &#x43F;&#x43E;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x44B;&#x445; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x439;!</p><br>
<h2 id="vyvody">&#x412;&#x44B;&#x432;&#x43E;&#x434;&#x44B;</h2><br>
<p>&#x41D;&#x430;&#x434;&#x435;&#x44E;&#x441;&#x44C; &#x447;&#x442;&#x43E; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F; &#x431;&#x44B;&#x43B;&#x430; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E;&#x439; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441;. &#x42F; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x43B; &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x442;&#x44C; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x438;&#x44E; &#x418;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x423;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x435;. &#x42D;&#x442;&#x430; &#x43A;&#x43E;&#x43D;&#x446;&#x435;&#x43F;&#x446;&#x438;&#x44F;, &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E; &#x436;&#x435;, &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x438;&#x43C;&#x430; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43A; React (&#x43A;&#x430;&#x43A; &#x43C;&#x44B; &#x432;&#x438;&#x434;&#x435;&#x43B;&#x438; &#x43D;&#x430; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; <code>filter</code>). &#x412; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x439; &#x440;&#x430;&#x437; &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x432;&#x44B; &#x437;&#x430;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x435; &#x447;&#x442;&#x43E; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x435; &#x43E;&#x447;&#x435;&#x440;&#x435;&#x434;&#x43D;&#x43E;&#x439; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440; <code>if</code> &#x432; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; <code>coreBusinessLogic</code> &#x432;&#x430;&#x448;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;, &#x43F;&#x43E;&#x434;&#x443;&#x43C;&#x430;&#x439;&#x442;&#x435;, &#x43A;&#x430;&#x43A; &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x438;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x438; &#x43F;&#x435;&#x440;&#x435;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x442;&#x443;&#x434;&#x430;, &#x433;&#x434;&#x435; &#x43E;&#x43D;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; (&#x438;&#x43B;&#x438;, &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43D;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x43C;&#x435;&#x441;&#x442;&#x430;&#x445;, &#x432;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x443;&#x44E; &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43A;&#x446;&#x438;&#x44E; &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x44F;).</p><br>
<p>&#x415;&#x441;&#x43B;&#x438; &#x445;&#x43E;&#x442;&#x438;&#x442;&#x435;, &#x43C;&#x43E;&#x436;&#x435;&#x442;&#x435; &#x43F;&#x43E;&#x438;&#x433;&#x440;&#x430;&#x442;&#x44C; &#x441; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x43E;&#x43C; &#x438;&#x437; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438; &#x43D;&#x430; <a href="https://codesandbox.io/s/inversion-of-control-qunm8?fontsize=14&amp;hidenavigation=1&amp;theme=dark" rel="nofollow">CodeSandbox</a>.</p><br>
<p>&#x423;&#x434;&#x430;&#x447;&#x438; &#x438; &#x441;&#x43F;&#x430;&#x441;&#x438;&#x431;&#x43E; &#x437;&#x430; &#x432;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;!</p><br>
<p>&#x41F;&#x421;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x43C; &#x43F;&#x43E;&#x43D;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x44D;&#x442;&#x430; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x44F;, &#x432;&#x430;&#x43C; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x43D;&#x440;&#x430;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x44D;&#x442;&#x43E; &#x432;&#x44B;&#x441;&#x442;&#x443;&#x43F;&#x43B;&#x435;&#x43D;&#x438;&#x435;: <a href="https://youtu.be/AiJ8tRRH0f8" rel="nofollow">youtube Kent C Dodds &#x2014; Simply React</a></p></div>
      
    </div>

    

    <dl class="post__tags">
      <dt class="post__tags-label">&#x422;&#x435;&#x433;&#x438;:</dt>
      <dd class="post__tags-list">    <ul class="inline-list inline-list_fav-tags js-post-tags">
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Breact%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">react</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Breactjs%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">reactjs</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bjavascript%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">javascript</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5B%D0%B8%D0%BD%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%8F%20%D1%83%D0%BF%D1%80%D0%B0%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">&#x438;&#x43D;&#x432;&#x435;&#x440;&#x441;&#x438;&#x44F; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;</a></li>
    </ul>
    <button type="button" class="btn btn_outline_grey btn_mini hidden js-fav-edit-link" data-type="2" data-id="485012" onclick="show_edit_tags(this)">&#x414;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43A;&#x438;</button>
</dd>
    </dl>
  </div>