<div class="post__wrapper">
    <header class="post__meta">
        <a href="https://habr.com/ru/users/Kilor/" class="post__user-info user-info" title="&#x410;&#x432;&#x442;&#x43E;&#x440; &#x43F;&#x443;&#x431;&#x43B;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438;">
            <span class="default-image_mini default-image_lilac">
              <svg class="icon-svg" width="24" height="24" viewBox="0 0 24 24" aria-hidden="true" version="1.1" role="img"><path d="M21.5 24h-19c-1.379 0-2.5-1.122-2.5-2.5v-19c0-1.379 1.122-2.5 2.5-2.5h19c1.379 0 2.5 1.122 2.5 2.5v19c0 1.379-1.122 2.5-2.5 2.5zm-19-23c-.827 0-1.5.673-1.5 1.5v19c0 .827.673 1.5 1.5 1.5h19c.827 0 1.5-.673 1.5-1.5v-19c0-.827-.673-1.5-1.5-1.5h-19zM15.598 12.385zM19.438 15.417l-.002-.005v-.001c-.875-2.226-2.484-3.054-3.445-3.549l-.273-.143c.029-.497-.025-1.034-.167-1.599l-.128.032.123-.044c-.765-2.152-1.757-2.585-2.632-2.967l-.006-.003-.535-2.121c.357-.065.628-.375.628-.752.001-.423-.342-.765-.765-.765s-.766.342-.766.765c0 .358.248.657.581.74l-.825 1.654-.014-.003-.024-.003c-1.053-.033-1.842.369-2.5.947-.633-.322-1.515-.729-2.158-1.814.107-.12.174-.276.174-.45 0-.375-.303-.678-.678-.678s-.678.303-.678.678.303.678.678.678l.221-.04c.416.597 1.09 1.181 1.347 2.828l-.072.091.104.081-.112-.067c-1.157 1.914-.793 4.248.207 5.37-.998 2.546-1.035 4.681-.097 5.868l.002.002.003.003c.119.162.313.233.524.233.189 0 .39-.057.559-.154.312-.179.441-.459.326-.713l-.12.054.119-.056c-.581-1.243-.474-2.713.314-4.37.4.131.778.208 1.145.234l.139.73c.264 1.418.514 2.757 1.297 4.006.132.264.453.387.777.387.122 0 .245-.018.357-.051.385-.116.591-.399.537-.738l-.129.021.125-.042c-.204-.606-.431-1.146-.649-1.67-.373-.894-.725-1.742-.891-2.737.407-.042.797-.129 1.161-.261.825.692 1.661 1.492 2.743 3.406h.001c.072.14.224.215.41.215.105 0 .222-.024.339-.073.365-.155.652-.531.477-1.006v-.001c-.432-1.849-1.426-2.778-2.428-3.547.162-.175.311-.366.442-.576.75.399 1.878 1.005 3.127 2.766l.047.067.011-.008c.151.156.317.24.48.24.096 0 .191-.027.279-.084.306-.194.439-.662.29-1.005zm-8.878-2.493c-.947 0-1.713-.767-1.713-1.713s.767-1.713 1.713-1.713c.947 0 1.713.767 1.713 1.713s-.767 1.713-1.713 1.713zm6.587 4.648l-.084.021v-.001l.084-.02zm-2.007-5.312zm.022 1.006zM11.225 11.604c0 .385-.312.697-.697.697s-.697-.312-.697-.697c0-.385.312-.697.697-.697s.697.312.697.697z"/></svg>
            </span>
          <span class="user-info__nickname user-info__nickname_small">Kilor</span>
        </a>

      <span class="post__time" data-time_published="2020-01-22T09:30Z">&#x432;&#x447;&#x435;&#x440;&#x430; &#x432; 12:30</span>

      
    </header>

    <h1 class="post__title post__title_full">
      <span class="post__title-text">PubSub &#x43F;&#x43E;&#x447;&#x442;&#x438; &#x431;&#x435;&#x441;&#x43F;&#x43B;&#x430;&#x442;&#x43D;&#x43E;: &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438; NOTIFY &#x432; PostgreSQL</span>
    </h1>


      <ul class="post__hubs post__hubs_full-post inline-list">
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/hi/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;&#x412;&#x44B;&#x441;&#x43E;&#x43A;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&apos;); }">&#x412;&#x44B;&#x441;&#x43E;&#x43A;&#x430;&#x44F; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x44C;</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/javascript/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;JavaScript&apos;); }">JavaScript</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/postgresql/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;PostgreSQL&apos;); }">PostgreSQL</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/programming/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;&apos;); }">&#x41F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;</a>, 
          </li>
          <li class="inline-list__item inline-list__item_hub">
            <a href="https://habr.com/ru/hub/nodejs/" class="inline-list__item-link hub-link " title="&#x412;&#x44B; &#x43D;&#x435; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x442; &#x445;&#x430;&#x431;" onclick="if (typeof ga === &apos;function&apos;) { ga(&apos;send&apos;, &apos;event&apos;, &apos;hub&apos;, &apos;post page&apos;, &apos;Node.JS&apos;); }">Node.JS</a>
          </li>
      </ul>

    <ul class="post__marks inline-list"><li class="inline-list__item inline-list__item_post-type"><span class="post__type-label" title="&#x41E;&#x431;&#x443;&#x447;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x43C;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;">Tutorial</span></li></ul>

    <div class="post__body post__body_full">
      <div class="post__text post__text-html" id="post-content-body" data-io-article-url="https://habr.com/ru/post/484978/">&#x415;&#x441;&#x43B;&#x438; &#x432;&#x430;&#x448;&#x438; &#x43C;&#x438;&#x43A;&#x440;&#x43E;&#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x44B; <u>&#x443;&#x436;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442; &#x43E;&#x431;&#x449;&#x443;&#x44E; &#x431;&#x430;&#x437;&#x443; PostgreSQL</u> &#x434;&#x43B;&#x44F; &#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445;, &#x438;&#x43B;&#x438; &#x435;&#x439; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x430; &#x43D;&#x430; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;&#x445;, &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; <b>&#xAB;&#x434;&#x435;&#x448;&#x435;&#x432;&#x43E;&#xBB; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43E;&#x431;&#x43C;&#x435;&#x43D;&#x430; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438;</b> (PubSub) &#x43C;&#x435;&#x436;&#x434;&#x443; &#x43D;&#x438;&#x43C;&#x438; &#x431;&#x435;&#x437; &#x438;&#x43D;&#x442;&#x435;&#x433;&#x440;&#x430;&#x446;&#x438;&#x438; &#x432; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x443; Redis, RabbitMQ-&#x43A;&#x43B;&#x430;&#x441;&#x442;&#x435;&#x440;&#x430; &#x438;&#x43B;&#x438; &#x432;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x438; &#x432; &#x43A;&#x43E;&#x434; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; <a href="https://habr.com/ru/post/326880/">&#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; MQ-&#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x44B;</a>.<br>
<br>
&#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x44B; <b>&#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C;</b> <a href="https://habr.com/ru/post/483014/">&#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x44B; &#x411;&#x414;</a>, &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x44D;&#x442;&#x43E; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x435; &#x43D;&#x430;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x44B;&#x435; &#x440;&#x430;&#x441;&#x445;&#x43E;&#x434;&#x44B; &#x441;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x43D;&#x430; <a href="https://habr.com/ru/company/postgrespro/blog/459250/">&#x437;&#x430;&#x43F;&#x438;&#x441;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x43E;&#x433;&#x43E;</a>, &#x430; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x435;&#x449;&#x435; &#x438; &#x43D;&#x430; <a href="https://habr.com/post/481866/">&#x437;&#x430;&#x447;&#x438;&#x441;&#x442;&#x43A;&#x443; &#x43E;&#x442; &#x443;&#x436;&#x435; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x442;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E;</a>.<br>
<br>
&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x44C; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x43C;&#x44B; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x43C; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x437;&#x43C;&#x430; <a href="https://postgrespro.ru/docs/postgresql/12/sql-notify">NOTIFY</a>/<a href="https://postgrespro.ru/docs/postgresql/12/sql-listen">LISTEN</a>, &#x430; &#x43C;&#x43E;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44E; &#x441;&#x43E;&#x431;&#x435;&#x440;&#x435;&#x43C; &#x434;&#x43B;&#x44F; Node.js.<br>
<br>
<img src="https://habrastorage.org/webt/er/e_/dv/ere_dvhj_y3sjkypbqeezzg_xn4.png"><br>
<br>
&#x41D;&#x43E; &#x43D;&#x430; &#x44D;&#x442;&#x43E;&#x43C; &#x43F;&#x443;&#x442;&#x438; &#x43B;&#x435;&#x436;&#x430;&#x442; &#x433;&#x440;&#x430;&#x431;&#x43B;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44F; &#x430;&#x43A;&#x43A;&#x443;&#x440;&#x430;&#x442;&#x43D;&#x43E; &#x43E;&#x431;&#x43E;&#x439;&#x442;&#x438;.<br>
<a name="habracut"></a><br>
<h2>&#x41E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;&#x430;</h2><br>
<h4>LISTEN</h4><br>
<pre><code class="sql">LISTEN &#x43A;&#x430;&#x43D;&#x430;&#x43B;</code></pre><blockquote>&#x41F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x449;&#x435;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x443; libpq, &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443; LISTEN &#x43A;&#x430;&#x43A; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x443;&#x44E; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x443; SQL, &#x430; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x43E;&#x43D;&#x43E; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x438;&#x43E;&#x434;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x44E; PQnotifies, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C;, &#x43D;&#x435; &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x438;&#x43B;&#x438; &#x43B;&#x438; &#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F;.</blockquote>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x43F;&#x438;&#x448;&#x435;&#x442;&#x435; &#x43D;&#x435; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; PG, &#x430; &#x443;&#x436;&#x435; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x432; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x432;, &#x432;&#x44B; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x438;&#x43C;&#x435;&#x442;&#x44C; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430; &#x43A; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x443; &#x44D;&#x442;&#x43E;&#x439; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438;.<br>
<br>
&#x41D;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x442;&#x430;&#x43A;&#x443;&#x44E; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;&#x443; &#x443;&#x436;&#x435; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43B;&#x438; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x441; &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; &#x440;&#x435;&#x43A;&#x43E;&#x43C;&#x435;&#x43D;&#x434;&#x430;&#x446;&#x438;&#x44F;&#x43C;&#x438; &#x43F;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x435; <a href="https://postgrespro.ru/docs/postgresql/12/libpq-async">&#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;</a> &#x438; <a href="https://postgrespro.ru/docs/postgresql/12/libpq-notify">&#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x439;</a>, &#x432;&#x44B; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x435; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x432; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x43C; &#x43A;&#x43E;&#x434;&#x435;. &#x415;&#x441;&#x43B;&#x438; &#x43D;&#x435;&#x442; &#x2014; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E; <b>&#x43F;&#x435;&#x440;&#x438;&#x43E;&#x434;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x442;&#x44C; <code>SELECT 1</code></b> &#x43D;&#x430; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x438;, &#x442;&#x43E;&#x433;&#x434;&#x430; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x435;&#x442; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x43E;&#x43C; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430;:<blockquote>&#x412; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x441;&#x442;&#x430;&#x440;&#x44B;&#x445; &#x432;&#x44B;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x445; libpq &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x438;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x435;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x439; &#x43E;&#x442; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B; NOTIFY &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C; &#x2014; &#x43F;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x43D;&#x43E; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x44B;, &#x43F;&#x443;&#x441;&#x442;&#x44C; &#x434;&#x430;&#x436;&#x435; &#x43F;&#x443;&#x441;&#x442;&#x44B;&#x435;, &#x430; &#x437;&#x430;&#x442;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x442;&#x44C; PQnotifies &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x430; PQexec. &#x425;&#x43E;&#x442;&#x44F; &#x44D;&#x442;&#x43E;&#x442; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x432;&#x441;&#x451; &#x435;&#x449;&#x451; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442;, &#x43E;&#x43D; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x443;&#x441;&#x442;&#x430;&#x440;&#x435;&#x432;&#x448;&#x438;&#x43C; &#x432;&#x432;&#x438;&#x434;&#x443; &#x43D;&#x435;&#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x43E;&#x440;&#x430;.</blockquote>&#x421; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x437;&#x440;&#x435;&#x43D;&#x438;&#x44F;, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, <a href="https://postgrespro.ru/docs/postgresql/12/app-psql">psql</a> &#x44D;&#x442;&#x43E; &#x432;&#x44B;&#x433;&#x43B;&#x44F;&#x434;&#x438;&#x442; &#x432;&#x43E;&#x442; &#x442;&#x430;&#x43A;:<br>
<br>
<pre><code class="plaintext">_tmp=# LISTEN test;
LISTEN
_tmp=# SELECT 1;
 ?column?
----------
        1
(1 row)

Asynchronous notification &quot;test&quot; with payload &quot;abc123&quot; received from server process with PID 63991.
</code></pre><br>
&#x415;&#x441;&#x43B;&#x438; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x439; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x441;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x43D;&#x430; &#x43C;&#x430;&#x43A;&#x441;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x437;&#x430;&#x434;&#x435;&#x440;&#x436;&#x43A;&#x443; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x430;&#x445; 1 &#x441;&#x435;&#x43A; &#x2014; &#x441; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x432;&#x430;&#x43B;&#x43E;&#x43C; &#x438; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;. &#x417;&#x430;&#x43E;&#x434;&#x43D;&#x43E;, &#x44D;&#x442;&#x43E;&#x442; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x43F;&#x43E;&#x43C;&#x43E;&#x433;&#x430;&#x435;&#x442; <b>&#x43C;&#x43E;&#x43D;&#x438;&#x442;&#x43E;&#x440;&#x438;&#x442;&#x44C; &#xAB;&#x436;&#x438;&#x432;&#x43E;&#x441;&#x442;&#x44C;&#xBB; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F;</b>, &#x443;&#x431;&#x435;&#x436;&#x434;&#x430;&#x44F;&#x441;&#x44C;, &#x447;&#x442;&#x43E; &#x43D;&#x438;&#x43A;&#x442;&#x43E; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439;&#x43D;&#x43E; &#x43D;&#x435; &#x43E;&#x431;&#x43E;&#x440;&#x432;&#x430;&#x43B; &#x435;&#x433;&#x43E; &#x441;&#x43E; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x44B; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430; &#x447;&#x435;&#x440;&#x435;&#x437; <code>pg_terminate_backend</code>, &#x438;&#x43B;&#x438; &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x43E;&#x448;&#x435;&#x43B; &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x432;&#x43D;&#x435;&#x437;&#x430;&#x43F;&#x43D;&#x44B;&#x439; &#xAB;&#x43A;&#x440;&#x44D;&#x448;&#xBB; PG &#x431;&#x435;&#x437; &#x432;&#x441;&#x44F;&#x43A;&#x438;&#x445; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442;&#x43E;&#x432;.<br>
<br>
<h4>NOTIFY</h4><br>
<pre><code class="sql">NOTIFY &#x43A;&#x430;&#x43D;&#x430;&#x43B; [ , &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435; ]</code></pre><br>
<blockquote>&#x41A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x430; NOTIFY &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x435; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x43E;&#x439; &#xAB;&#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F;&#xBB; &#x432;&#x441;&#x435;&#x43C; &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442;&#x441;&#x43A;&#x438;&#x43C; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x43C;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x434;&#x43E; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x43B;&#x438; &#x432; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x439; &#x431;&#x430;&#x437;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; LISTEN &#x43A;&#x430;&#x43D;&#x430;&#x43B; &#x441; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x438;&#x43C;&#x435;&#x43D;&#x435;&#x43C; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430;.<br>
&#x2026;<br>
&#x421;&#x442;&#x440;&#x43E;&#x43A;&#x430; &#xAB;&#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F;&#xBB;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43D;&#x430; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x435; &#x441; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x435;&#x43C;,&#x2026; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x437;&#x430;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; <a href="https://postgrespro.ru/docs/postgresql/12/sql-syntax-lexical#SQL-SYNTAX-CONSTANTS">&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x43E;&#x439; &#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x430;&#x43D;&#x442;&#x43E;&#x439;</a>. &#x412; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x439; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; &#x435;&#x451; <b>&#x434;&#x43B;&#x438;&#x43D;&#x430; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x431;&#x44B;&#x442;&#x44C; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435; 8000 &#x431;&#x430;&#x439;&#x442;</b>.</blockquote>&#x422;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x430;&#x448;&#x435; &#xAB;&#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435;&#xBB; &#x432;&#x43D;&#x435;&#x437;&#x430;&#x43F;&#x43D;&#x43E; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x447;&#x442;&#x43E;-&#x442;&#x43E; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x43D;&#x43E;&#x435; &#x43E;&#x442; ASCII, &#x442;&#x43E; &#x43D;&#x430;&#x43C; &#x435;&#x433;&#x43E; <u>&#x43F;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44F; &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;</u>, &#x430; &#x435;&#x441;&#x43B;&#x438; &#x43F;&#x440;&#x435;&#x432;&#x44B;&#x441;&#x438;&#x442; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x432; 8000 &#x431;&#x430;&#x439;&#x442; (&#x43D;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x432;!) &#x2014; &#x442;&#x43E; <u>&#x440;&#x435;&#x437;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x431;&#x43B;&#x43E;&#x43A;&#x438; &#x438; &#x43F;&#x43E;&#x442;&#x43E;&#x43C; &#x441;&#x43A;&#x43B;&#x435;&#x438;&#x432;&#x430;&#x442;&#x44C;</u>. &#x41F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x43D;&#x430;&#x43C; &#x441;&#x442;&#x43E;&#x438;&#x442; &#x43F;&#x43E;&#x431;&#x435;&#x440;&#x435;&#x447;&#x44C; &#x43A;&#x430;&#x43A; &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x43D;&#x443;&#x44E; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430;, &#x442;&#x430;&#x43A; &#x438; &#x440;&#x435;&#x441;&#x443;&#x440;&#x441;&#x44B; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430; &#x43D;&#x430; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x438; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x431;&#x43B;&#x43E;&#x43A;&#x43E;&#x432; &#x2014; &#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43A; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x43E;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x443; &#x43A;&#x430;&#x43A; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435; &#x441;&#x43B;&#x443;&#x436;&#x435;&#x431;&#x43D;&#x43E;&#x439; &#xAB;&#x43E;&#x431;&#x432;&#x44F;&#x437;&#x43A;&#x438;&#xBB;, &#x43D;&#x43E; &#x43F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x438; &#x43D;&#x435; &#xAB;&#x437;&#x430;&#x434;&#x443;&#x448;&#x438;&#x442;&#x44C;&#xBB; &#x43A;&#x43B;&#x438;&#x435;&#x43D;&#x442;&#x441;&#x43A;&#x43E;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435;, &#x437;&#x430;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44F; &#x435;&#x433;&#x43E; &#x437;&#x430;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x443;&#x43F;&#x430;&#x43A;&#x43E;&#x432;&#x43A;&#x43E;&#x439; &#x441; <code>gzip -9</code>.<br>
<br>
&#x418;&#x437; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x43B;&#x44E;&#x441;&#x43E;&#x432; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x437;&#x43C;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x442;&#x430;&#x43A; &#x436;&#x435; &#x43E;&#x442;&#x43C;&#x435;&#x442;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x438;&#x432;&#x44F;&#x437;&#x43A;&#x443; &#x43A; &#xAB;&#x438;&#x441;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x43A;&#x443;&#xBB; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F;&#x2026;<br>
<blockquote>&#x2026; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x437;&#x431;&#x435;&#x436;&#x430;&#x442;&#x44C;, &#x435;&#x441;&#x43B;&#x438; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C;, &#x43D;&#x435; &#x441;&#x43E;&#x432;&#x43F;&#x430;&#x434;&#x430;&#x435;&#x442; &#x43B;&#x438; <b>PID &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x443;&#x44E;&#x449;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x430;</b> (&#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x432; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F;) &#x441; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; PID &#x441;&#x435;&#x430;&#x43D;&#x441;&#x430; (&#x435;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x437;&#x43D;&#x430;&#x442;&#x44C;, &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x432;&#x448;&#x438;&#x441;&#x44C; &#x43A; libpq). &#x415;&#x441;&#x43B;&#x438; &#x43E;&#x43D;&#x438; &#x441;&#x43E;&#x432;&#x43F;&#x430;&#x434;&#x430;&#x44E;&#x442;, &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442; &#x441;&#x435;&#x430;&#x43D;&#x441; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43E; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x445; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F;&#x445;, &#x442;&#x430;&#x43A; &#x447;&#x442;&#x43E; &#x435;&#x433;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x433;&#x43D;&#x43E;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;.</blockquote>&#x2026; &#x438; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43A;&#x438;:<br>
<blockquote>&#x41D;&#x435; &#x441;&#x447;&#x438;&#x442;&#x430;&#x44F; &#x444;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x445; &#x44D;&#x43A;&#x437;&#x435;&#x43C;&#x43F;&#x43B;&#x44F;&#x440;&#x43E;&#x432; &#x434;&#x443;&#x431;&#x43B;&#x438;&#x440;&#x443;&#x44E;&#x449;&#x438;&#x445;&#x441;&#x44F; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x439;, NOTIFY &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;, &#x447;&#x442;&#x43E; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x44E;&#x442; &#x432; &#x442;&#x43E;&#x43C; &#x436;&#x435; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x435;, &#x432; &#x43A;&#x430;&#x43A;&#x43E;&#x43C; &#x431;&#x44B;&#x43B;&#x438; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x44B;. &#x422;&#x430;&#x43A;&#x436;&#x435; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E; <b>&#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442; &#x440;&#x430;&#x437;&#x43D;&#x44B;&#x445; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x439; &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;&#x44E;&#x442; &#x432; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x435; &#x444;&#x438;&#x43A;&#x441;&#x430;&#x446;&#x438;&#x438; &#x44D;&#x442;&#x438;&#x445; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x439;</b>.</blockquote>&#x41C;&#x44B; &#x43D;&#x435; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x43C; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x441;&#x43F;&#x435;&#x446;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43E;&#x431;&#x44A;&#x435;&#x434;&#x438;&#x43D;&#x44F;&#x442;&#x44C;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x43D;&#x430;&#x448; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441; &#x43A;&#x430;&#x43A; &#x440;&#x430;&#x437; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x438;.<br>
<br>
&#x41D;&#x43E; &#x43F;&#x43E;&#x43C;&#x43D;&#x438;&#x442;&#x435;, &#x447;&#x442;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x43E;&#x43C; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43C;&#x435;&#x43D;&#x430; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x435;&#x441;&#x442;&#x44C; &#x435;&#x449;&#x435; &#x438; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x430;&#x44F; &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x44C;, &#x43D;&#x430;&#x448; NOTIFY &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x435; &#x43F;&#x43E; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x432;&#x43E;&#x43B;&#x435;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; <u>&#x43C;&#x43E;&#x433;&#x443;&#x442; &#x432;&#x43E;&#x437;&#x43D;&#x438;&#x43A;&#x43D;&#x443;&#x442;&#x44C; &#x441;&#x430;&#x439;&#x434;-&#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x44B;</u>:<br>
<blockquote>&#x422;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x44E;&#x442; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x435; &#x432;&#x43B;&#x438;&#x44F;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x443; NOTIFY. &#x412;&#x43E;-&#x43F;&#x435;&#x440;&#x432;&#x44B;&#x445;, &#x435;&#x441;&#x43B;&#x438; NOTIFY &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x438;, &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x435;&#x43B;&#x44F;&#x43C; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x444;&#x438;&#x43A;&#x441;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x438; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x432; &#x44D;&#x442;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;. &#x42D;&#x442;&#x43E; &#x440;&#x430;&#x437;&#x443;&#x43C;&#x43D;&#x43E;, &#x442;&#x430;&#x43A; &#x43A;&#x430;&#x43A; <b>&#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43F;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x438; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x432;&#x441;&#x435;&#x445; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434; &#x432; &#x43D;&#x435;&#x439; &#x430;&#x43D;&#x43D;&#x443;&#x43B;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F;, &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44F; NOTIFY</b>.</blockquote>&#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435;, &#x433;&#x434;&#x435; &#x437;&#x430;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x442;&#x440;&#x430;&#x43D;&#x437;&#x430;&#x43A;&#x446;&#x438;&#x439; &#x438; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x43E;&#x432;.<br>
<br>
<h4>AccessExclusiveLock on object 0 of class 1262 of database 0</h4><br>
&#x415;&#x441;&#x43B;&#x438; &#x432;&#x43D;&#x435;&#x437;&#x430;&#x43F;&#x43D;&#x43E; &#x432;&#x430;&#x448;&#x438; NOTIFY &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x438; &#x43F;&#x43E;&#x434;&#x442;&#x443;&#x43F;&#x43B;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x438; &#x432;&#x44B;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x43B;&#x43E;&#x433; &#x43E;&#x436;&#x438;&#x434;&#x430;&#x43D;&#x438;&#x435; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x431;&#x43B;&#x43E;&#x43A;&#x438;&#x440;&#x43E;&#x432;&#x43A;&#x438;, &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x432;&#x44B; &#x432;&#x441;&#x435;-&#x442;&#x430;&#x43A;&#x438; &#x443;&#x436;&#x435; &#xAB;&#x432;&#x44B;&#x440;&#x43E;&#x441;&#x43B;&#x438; &#x438;&#x437; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x438;&#x445; &#x448;&#x442;&#x430;&#x43D;&#x438;&#x448;&#x435;&#x43A;&#xBB;, &#x438; &#x43F;&#x43E;&#x440;&#x430; &#x437;&#x430;&#x434;&#x443;&#x43C;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E; &#xAB;&#x432;&#x437;&#x440;&#x43E;&#x441;&#x43B;&#x43E;&#x439;&#xBB; MQ.<br>
<br>
&#x412;&#x435;&#x434;&#x44C; &#x43E;&#x447;&#x435;&#x440;&#x435;&#x434;&#x44C; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x439; &#x445;&#x43E;&#x442;&#x44C; &#x438; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x432;&#x435;&#x43B;&#x438;&#x43A;&#x430; (8GB &#x432; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x445; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430;&#x445;), &#x43D;&#x43E; &#x432;&#x441;&#x435;-&#x442;&#x430;&#x43A;&#x438; &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x430;. &#x421;&#x43E;&#x433;&#x43B;&#x430;&#x441;&#x43D;&#x43E; <a href="https://www.postgresql.org/message-id/3598.1363354686%40sss.pgh.pa.us">&#x43E;&#x442;&#x432;&#x435;&#x442;&#x443; Tom Lane</a>:<br>
<blockquote><i>This lock is held while inserting the transaction&apos;s notify message(s), after which the transaction commits and releases the lock.</i></blockquote>&#x422;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x43E;&#x432; &#x43E;&#x431;&#x445;&#x43E;&#x434;&#x430; &#x43E;&#x441;&#x442;&#x430;&#x43D;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x435; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;:<br>
<br>
<ul>
<li><b>&#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C;, &#x43D;&#x43E; &#x440;&#x435;&#x436;&#x435;</b><br>
&#x422;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x430;&#x433;&#x440;&#x435;&#x433;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x43C;&#x44B;&#x435; &#x43F;&#x43E;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x438;, &#x435;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x43A;&#x430;&#x43A;&#x438;&#x435;-&#x442;&#x43E; &#x441;&#x447;&#x435;&#x442;&#x447;&#x438;&#x43A;&#x438;, &#x43D;&#x430; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x43E;&#x43C; &#x438;&#x43D;&#x442;&#x435;&#x440;&#x432;&#x430;&#x43B;&#x435;.</li>
<li><b>&#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x438;&#x439; &#x43E;&#x431;&#x44A;&#x435;&#x43C;</b><br>
&#x41D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x443;&#x434;&#x430;&#x43B;&#x44F;&#x442;&#x44C; &#x438;&#x437; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x445; JSON &#xAB;&#x434;&#x435;&#x444;&#x43E;&#x43B;&#x442;&#x43D;&#x44B;&#x435;&#xBB; &#x441; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x437;&#x440;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x439;.</li>
<li><b>&#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B;</b>, &#x432;&#x43E;&#x43E;&#x431;&#x449;&#x435; &#x431;&#x435;&#x437; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;<br>
&#x41A;&#x430;&#x43A; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442; &#x2014; &#x437;&#x430;&#x432;&#x435;&#x441;&#x442;&#x438; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x43E;&#x432;, &#x438;&#x43C;&#x44F; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x433;&#x43E; &#x443;&#x436;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43D;&#x435;&#x441;&#x442;&#x438; &#x441;&#x430;&#x43C;&#x43E; &#x43F;&#x43E; &#x441;&#x435;&#x431;&#x435; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x442;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x439; &#x441;&#x43C;&#x44B;&#x441;&#x43B;.</li>
<li>&#x432;&#x441;&#x435;-&#x442;&#x430;&#x43A;&#x438; <b>&#x432;&#x44B;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x443; &#x438;&#x437; &#x411;&#x414;</b></li>
</ul><br>
<h2>&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#xAB;&#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44B;&#x445;&#xBB; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x439;</h2><br>
<h4>&#x41A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#xAB;&#x442;&#x435;&#x43B;&#x430;&#xBB;</h4><br>
&#x412; &#x43E;&#x431;&#x449;&#x435;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;, &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x437;&#x430;&#x445;&#x43E;&#x442;&#x435;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x438; &#x43D;&#x435; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B;, &#x43D;&#x43E; &#x438; &#x440;&#x443;&#x441;&#x441;&#x43A;&#x438;&#x435; &#x431;&#x443;&#x43A;&#x432;&#x44B;, &#x438; &#xAB;&#x432;&#x441;&#x44F;&#x43A;&#x443;&#x44E; &#x431;&#x438;&#x43D;&#x430;&#x440;&#x449;&#x438;&#x43D;&#x443;&#xBB; &#x2014; &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x431;&#x44B;&#x43B;&#x43E; &#x431;&#x44B; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; <u>&#x43A;&#x43E;&#x43D;&#x432;&#x435;&#x440;&#x442;&#x430;&#x446;&#x438;&#x44E; &#x432; hex-&#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435;</u> &#x434;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438;. &#x418; &#x434;&#x430;, &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431; &#x432;&#x43F;&#x43E;&#x43B;&#x43D;&#x435; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442;:<br>
<br>
<pre><code class="sql">NOTIFY test, E&apos;\x20\x21&apos;</code></pre><br>
<pre><code class="plaintext">Asynchronous notification &quot;test&quot; with payload &quot; !&quot; received from server process with PID 63991.</code></pre><br>
&#x41D;&#x43E; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x438;&#x43C;&#x441;&#x44F; &#x441;&#x43D;&#x43E;&#x432;&#x430; &#x43A; &#x434;&#x43E;&#x43A;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x446;&#x438;&#x438;:<br>
<blockquote>&#x412;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x43F;&#x43E;&#x437;&#x430;&#x431;&#x43E;&#x442;&#x438;&#x442;&#x44C;&#x441;&#x44F;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x431;&#x430;&#x439;&#x442;&#x43E;&#x432;&#x44B;&#x435; &#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x432;&#x44B; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x451;&#x442;&#x435; &#x442;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E; &#x432; &#x432;&#x43E;&#x441;&#x44C;&#x43C;&#x435;&#x440;&#x438;&#x447;&#x43D;&#x43E;&#x439; &#x438; &#x448;&#x435;&#x441;&#x442;&#x43D;&#x430;&#x434;&#x446;&#x430;&#x442;&#x435;&#x440;&#x438;&#x447;&#x43D;&#x43E;&#x439; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x438;, &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x43B;&#x438; <b>&#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x44B;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B; &#x432; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x43D;&#x43E;&#x439; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x43A;&#x435;</b>. &#x41A;&#x43E;&#x433;&#x434;&#x430; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x442; &#x441; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x43A;&#x43E;&#x439; UTF-8, &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x438; &#x431;&#x430;&#x439;&#x442; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43F;&#x435;&#x446;&#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x441;&#x442;&#x438; Unicode &#x438;&#x43B;&#x438; &#x430;&#x43B;&#x44C;&#x442;&#x435;&#x440;&#x43D;&#x430;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x439; &#x441;&#x438;&#x43D;&#x442;&#x430;&#x43A;&#x441;&#x438;&#x441; Unicode, &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x432; &#x41F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; 4.1.2.3. (&#x412; &#x43F;&#x440;&#x43E;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B; UTF-8 &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E; &#x438; &#x432;&#x44B;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x445; &#x43F;&#x43E; &#x431;&#x430;&#x439;&#x442;&#x430;&#x43C;, &#x447;&#x442;&#x43E; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43D;&#x435;&#x443;&#x434;&#x43E;&#x431;&#x43D;&#x43E;.)</blockquote>&#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x434;&#x430;&#x436;&#x435; &#x441; &#x431;&#x430;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x43C; &#x43A;&#x430;&#x432;&#x44B;&#x447;&#x43A;&#x438;-&#x43B;&#x430;&#x43F;&#x43A;&#x438; &#x438;&#x437; win1251 &#x43C;&#x44B; &#x445;&#x43B;&#x435;&#x431;&#x43D;&#x435;&#x43C; &#x433;&#x43E;&#x440;&#x44F;:<br>
<br>
<pre><code class="sql">NOTIFY test, E&apos;\x98&apos;
-- ERROR:  invalid byte sequence for encoding &quot;UTF8&quot;: 0x98</code></pre><br>
&#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &quot;<i>&#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B; UTF-8 &#x432;&#x440;&#x443;&#x447;&#x43D;&#x443;&#x44E; &#x438; &#x432;&#x44B;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x438;&#x445; &#x43F;&#x43E; &#x431;&#x430;&#x439;&#x442;&#x430;&#x43C;</i>&quot; &#x43C;&#x44B; &#x43D;&#x435; &#x445;&#x43E;&#x442;&#x438;&#x43C;, &#x441;&#x440;&#x430;&#x437;&#x443; &#x434;&#x43E;&#x433;&#x43E;&#x432;&#x43E;&#x440;&#x438;&#x43C;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x442;&#x435;&#x43B;&#x43E; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; <b>&#x443;&#x43F;&#x430;&#x43A;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x43C; &#x432; base64</b> &#x43F;&#x440;&#x438; &#x43D;&#x430;&#x43B;&#x438;&#x447;&#x438;&#x438; &#x432; &#x43D;&#x435;&#x43C; &#x43B;&#x44E;&#x431;&#x44B;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x432; &#x437;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x430;&#x43C;&#x438; &#x434;&#x438;&#x430;&#x43F;&#x430;&#x437;&#x43E;&#x43D;&#x430; <code>\x20-\x7E</code> &#x438;&#x43B;&#x438; &#x43F;&#x440;&#x438; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x440;&#x430;&#x437;&#x431;&#x438;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x430; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x44B;. &#x421; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x44B;, &#x442;&#x430;&#x43A;&#x43E;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x443;&#x43F;&#x430;&#x43A;&#x43E;&#x432;&#x43A;&#x438; &#x43D;&#x435; &#x441;&#x43B;&#x438;&#x448;&#x43A;&#x43E;&#x43C; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x432;&#x435;&#x43B;&#x438;&#x447;&#x438;&#x432;&#x430;&#x435;&#x442; &#x438;&#x437;&#x431;&#x44B;&#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x441;&#x442;&#x44C; (&#x43A;&#x43E;&#x44D;&#x444;&#x444;&#x438;&#x446;&#x438;&#x435;&#x43D;&#x442; 4:3), &#x441; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x2014; &#x432; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x44F;&#x437;&#x44B;&#x43A;&#x435; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x43D; &#x43D;&#x430; &#x443;&#x440;&#x43E;&#x432;&#x43D;&#x435; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C;&#x43D;&#x44B;&#x445; &#x431;&#x438;&#x431;&#x43B;&#x438;&#x43E;&#x442;&#x435;&#x43A;, &#x438; &#x43E;&#x431;&#x435;&#x441;&#x43F;&#x435;&#x447;&#x438;&#x442; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x443;&#x44E; &#x43D;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x443;.<br>
<br>
&#x41D;&#x43E; &#x434;&#x430;&#x436;&#x435; &#x435;&#x441;&#x43B;&#x438; &#x443; &#x43D;&#x430;&#x441; &#x43D;&#x435;&#x442; &#xAB;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x43D;&#x44B;&#x445;&#xBB; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x432;, &#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x443;&#x43C;&#x435;&#x449;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;, &#x432;&#x441;&#x435; &#x440;&#x430;&#x432;&#x43D;&#x43E; &#x43E;&#x441;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x434;&#x43D;&#x430; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x2014; <b>&#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x430;&#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x444;&#x430;</b>:<br>
<blockquote>&#x427;&#x442;&#x43E;&#x431;&#x44B; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x44C; &#x430;&#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x444; &#x432; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x443;, &#x43D;&#x430;&#x43F;&#x438;&#x448;&#x438;&#x442;&#x435; &#x432; &#x43D;&#x435;&#x439; <u>&#x434;&#x432;&#x430; &#x430;&#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x444;&#x430; &#x440;&#x44F;&#x434;&#x43E;&#x43C;</u>, &#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;: &apos;&#x416;&#x430;&#x43D;&#x43D;&#x430; &#x434;&apos;&apos;&#x410;&#x440;&#x43A;&apos;. &#x417;&#x430;&#x43C;&#x435;&#x442;&#x44C;&#x442;&#x435;, &#x44D;&#x442;&#x43E; &#x43D;&#x435; &#x442;&#x43E; &#x436;&#x435; &#x441;&#x430;&#x43C;&#x43E;&#x435;, &#x447;&#x442;&#x43E; &#x434;&#x432;&#x43E;&#x439;&#x43D;&#x430;&#x44F; &#x43A;&#x430;&#x432;&#x44B;&#x447;&#x43A;&#x430; (&quot;).</blockquote><br>
<h4>&#x418;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44F; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;</h4><br>
&#x421;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x430;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430; &#x2014; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#xAB;&#x43F;&#x43E;&#x440;&#x435;&#x437;&#x430;&#x442;&#x44C;&#xBB; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x430; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43A; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x435; <b>&#x431;&#x43B;&#x43E;&#x43A;&#x438; &#x43F;&#x43E; 7999 &#x431;&#x430;&#x439;&#x442;</b>, &#x435;&#x441;&#x43B;&#x438; &#x435;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x432;&#x434;&#x440;&#x443;&#x433; &#x43F;&#x440;&#x435;&#x432;&#x44B;&#x441;&#x438;&#x43B; &#x44D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435;. &#x41F;&#x440;&#x438;&#x447;&#x435;&#x43C; &#x442;&#x430;&#x43A;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43D;&#x430; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x435;&#x43B;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x441;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x435;&#x433;&#x43E; &#x431;&#x435;&#x437; &#x43D;&#x430;&#x440;&#x443;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43A;&#x430; &#x438;&#x43B;&#x438; &#x43F;&#x43E;&#x43F;&#x430;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x432; &#x446;&#x435;&#x43F;&#x43E;&#x447;&#x43A;&#x443; &#xAB;&#x447;&#x443;&#x436;&#x438;&#x445;&#xBB; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x438;&#x437; &#x43D;&#x438;&#x445; &#x43D;&#x430;&#x434;&#x43E; &#x43A;&#x430;&#x43A;-&#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x438;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C;.<br>
<br>
&#x421;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;, &#x434;&#x432;&#x435; &#xAB;&#x43A;&#x43E;&#x43E;&#x440;&#x434;&#x438;&#x43D;&#x430;&#x442;&#x44B;&#xBB; &#x43D;&#x430;&#x43C; &#x443;&#x436;&#x435; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B; &#x2014; &#x44D;&#x442;&#x43E; <u>PID &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x430;-&#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x435;&#x43B;&#x44F;</u> &#x438; <u>&#x438;&#x43C;&#x44F; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430;</u>, &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x44F;&#x449;&#x438;&#x435; &#x432; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x438;. &#x410; &#x43F;&#x43E;&#x440;&#x44F;&#x434;&#x43E;&#x43A; &#x43F;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432; &#x43D;&#x430;&#x43C; &#x433;&#x430;&#x440;&#x430;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x442; &#x441;&#x430;&#x43C; &#x43F;&#x440;&#x43E;&#x442;&#x43E;&#x43A;&#x43E;&#x43B;.<br>
<br>
<div class="spoiler"><b class="spoiler_title">&#x421;&#x43E;&#x441;&#x435;&#x434;&#x438;-&#x43F;&#x438;&#x441;&#x430;&#x442;&#x435;&#x43B;&#x438;</b><div class="spoiler_text">&#x41C;&#x44B; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x440;&#x430;&#x441;&#x441;&#x43C;&#x430;&#x442;&#x440;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439;, &#x43A;&#x43E;&#x433;&#x434;&#x430; <i>&#x43D;&#x430; &#x43E;&#x434;&#x43D;&#x43E;&#x43C; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x438; &#x441; &#x411;&#x414;</i> (&#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x437;&#x430;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43E; &#x432; &#x440;&#x430;&#x43C;&#x43A;&#x430;&#x445; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43A;&#x43B;&#x430;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x441;&#x441;&#x430;) &#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B; &#x43E;&#x434;&#x43D;&#x43E;&#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x43E; <i>&#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x438;&#x441;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x432; &#x430;&#x434;&#x440;&#x435;&#x441; &#x43E;&#x434;&#x43D;&#x43E;&#x433;&#x43E; &#x438; &#x442;&#x43E;&#x433;&#x43E; &#x436;&#x435; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430;</i>. &#x422;&#x435;&#x445;&#x43D;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;, &#x44D;&#x442;&#x43E; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x435;&#x439; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x438;&#x434;&#x435;&#x43D;&#x442;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x430; &#x432; &#x437;&#x430;&#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43A;&#x435; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x2014; &#x43D;&#x43E; &#x43B;&#x443;&#x447;&#x448;&#x435; &#xAB;&#x440;&#x430;&#x441;&#x448;&#x430;&#x440;&#x438;&#x442;&#x44C;&#xBB; &#x435;&#x434;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x44B;&#x439; PubSub-&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442; &#x432;&#x43D;&#x443;&#x442;&#x440;&#x438; &#x441;&#x432;&#x43E;&#x435;&#x433;&#x43E; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x44F;.<br>
</div></div><br>
<h4>&#x41E;&#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;&#x430;</h4><br>
&#x427;&#x442;&#x43E;&#x431;&#x44B; &#x441;&#x43E;&#x431;&#x440;&#x430;&#x442;&#x44C; &#x446;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440; &#x438;&#x437; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x438;&#x445; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x43D;&#x430;&#x43C; &#x43D;&#x430;&#x434;&#x43E; &#x437;&#x43D;&#x430;&#x442;&#x44C; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442; &#x435;&#x433;&#x43E; &#x43E;&#x43A;&#x43E;&#x43D;&#x447;&#x430;&#x43D;&#x438;&#x44F;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x434;&#x432;&#x430; &#x442;&#x438;&#x43F;&#x43E;&#x432;&#x44B;&#x445; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x430;:<br>
<br>
<ul>
<li>&#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x446;&#x435;&#x43B;&#x435;&#x432;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x430; (&#x432; &#x431;&#x430;&#x439;&#x442;&#x430;&#x445; &#x438;&#x43B;&#x438; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445;) &#x432; &#x43F;&#x435;&#x440;&#x432;&#x43E;&#x43C; &#x438;&#x437; &#x43D;&#x438;&#x445;</li>
<li>&#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x43A;&#x430; [&#x43D;&#x435;]&#x43F;&#x43E;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x435;&#x433;&#x43E; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x432; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C; &#x438;&#x437; &#x43D;&#x438;&#x445;</li>
</ul><br>
&#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43C;&#x44B; &#x43F;&#x438;&#x448;&#x435;&#x43C; &#x432;&#x441;&#x435;-&#x442;&#x430;&#x43A;&#x438; PubSub, &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x439; &#x443; &#x43D;&#x430;&#x441; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x438;&#x43C;&#x438; &#x438; &#x440;&#x435;&#x437;&#x435;&#x440;&#x432;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x431;&#x430;&#x439;&#x442; &#x43F;&#x43E;&#x434; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x443; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x430; &#x43D;&#x435;&#x432;&#x44B;&#x433;&#x43E;&#x434;&#x43D;&#x43E;. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x441;&#x44F; &#x432;&#x442;&#x43E;&#x440;&#x44B;&#x43C; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x43C;, &#x437;&#x430;&#x440;&#x435;&#x437;&#x435;&#x440;&#x432;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x432; <u>&#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x430;</u> &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x444;&#x43B;&#x430;&#x433;&#x430; &#x43F;&#x440;&#x43E;&#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D;&#x438;&#x44F;/&#x43E;&#x43A;&#x43E;&#x43D;&#x447;&#x430;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;&#x430;.<br>
<br>
<h4>&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x43E;&#x432;</h4><br>
&#x427;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#xAB;&#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F;&#xBB; &#x43A;&#x430;&#x43A; &#x43E;&#x431;&#x44B;&#x447;&#x43D;&#x44B;&#x435; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x44B;&#x435; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438;, &#x442;&#x430;&#x43A; &#x438; JSON-&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x44B;, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x43C; <u>&#x435;&#x449;&#x435; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;-&#x43F;&#x440;&#x438;&#x437;&#x43D;&#x430;&#x43A;</u> &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x440;&#x430;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43D;&#x430; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x430;&#x442;&#x435;&#x43B;&#x44F;.<br>
<br>
&#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43C;&#x44B; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x43B;&#x438; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#xAB;&#x43D;&#x435;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&#xBB; &#x432; base64, &#x434;&#x43B;&#x44F; &#x444;&#x43B;&#x430;&#x433;&#x43E;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x432;&#x437;&#x44F;&#x442;&#x44C; &#x43B;&#x44E;&#x431;&#x44B;&#x435; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B;, &#x43D;&#x435; &#x432;&#x445;&#x43E;&#x434;&#x44F;&#x449;&#x438;&#x435; &#x432; &#x44D;&#x442;&#x43E;&#x442; &#x43D;&#x430;&#x431;&#x43E;&#x440;.<br>
<br>
&#x418;&#x442;&#x43E;&#x433;&#x43E;, &#x443; &#x43D;&#x430;&#x441; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x43B;&#x438;&#x441;&#x44C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43C;&#x44B;&#x445; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;:<br>
<br>
<pre><code class="plaintext">-- &quot;&#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x430;&#x44F;&quot; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x432;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x430;
!simple string
-- &quot;&#x43A;&#x43E;&#x440;&#x43E;&#x442;&#x43A;&#x438;&#x439; &#x438; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439;&quot; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;
@{&quot;a&quot;:1}
-- &#x43D;&#x435;&#x444;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442; &#x432; base64
#&lt;segment&gt;
-- &#x437;&#x430;&#x432;&#x435;&#x440;&#x448;&#x430;&#x44E;&#x449;&#x438;&#x439; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442; &#x432; base64
$&lt;segment&gt;
</code></pre><br>
&#x41A;&#x430;&#x43A; &#x432;&#x438;&#x434;&#x43D;&#x43E;, &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x430;&#x43D;&#x430;&#x43B;&#x438;&#x437;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x438; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x430; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x43B;&#x438;&#x448;&#x44C; &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x43F;&#x43E;&#x43D;&#x44F;&#x442;&#x44C;, &#x447;&#x442;&#x43E; &#x43D;&#x443;&#x436;&#x43D;&#x43E; &#x441; &#x43D;&#x438;&#x43C; &#x434;&#x430;&#x43B;&#x44C;&#x448;&#x435; &#x434;&#x435;&#x43B;&#x430;&#x442;&#x44C;.<br>
<br>
<h2>&#x41F;&#x438;&#x448;&#x435;&#x43C; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44E; PubSub</h2><br>
&#x41D;&#x430;&#x448;&#x435; &#x43F;&#x440;&#x438;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43D;&#x430; Node.js, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x434;&#x43B;&#x44F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; PostgreSQL &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x441;&#x44F; <a href="https://www.npmjs.com/package/pg">&#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x43C; node-postgres</a>.<br>
<br>
<div class="spoiler"><b class="spoiler_title">&#x41F;&#x438;&#x448;&#x435;&#x43C; &#x441;&#x442;&#x430;&#x440;&#x442;&#x43E;&#x432;&#x44B;&#x439; &#x43A;&#x430;&#x440;&#x43A;&#x430;&#x441;</b><div class="spoiler_text">&#x414;&#x43B;&#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x434;&#x438;&#x43C; PubSub &#x43A;&#x430;&#x43A; &#x43D;&#x430;&#x441;&#x43B;&#x435;&#x434;&#x43D;&#x438;&#x43A;&#x430; <a href="https://nodejs.org/dist/latest-v12.x/docs/api/events.html#events_class_eventemitter">EventEmitter</a>, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x438;&#x43C;&#x435;&#x442;&#x44C; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x433;&#x435;&#x43D;&#x435;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x441;&#x43E;&#x431;&#x44B;&#x442;&#x438;&#x44F; &#x432; &#x430;&#x434;&#x440;&#x435;&#x441; &#x442;&#x435;&#x445;, &#x43A;&#x442;&#x43E; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43B;&#x441;&#x44F; &#x43D;&#x430; &#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x44B;&#x435; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x44B;:<br>
<br>
<pre><code class="javascript">const util = require(&apos;util&apos;);
const EventEmitter = require(&apos;events&apos;).EventEmitter;

const PubSub = function(connection, interval, skipSelf) {
  // &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C; &#x443;&#x436;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44E;&#x449;&#x435;&#x435; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x435;
  this.connection = connection;

  // &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x43C;&#x441;&#x44F; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x43E;&#x439; &#x43D;&#x430; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x441;&#x435;&#x445; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x439;
  this.connection.on(&apos;notification&apos;, p._onmessage.bind(this));

  // &#x43D;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x442;&#x44C; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x442; &#x441;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x441;&#x43E;&#x435;&#x434;&#x438;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x441; &#x411;&#x414;
  this.skipSelf = skipSelf;

  // &#x437;&#x430;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C; &quot;&#x430;&#x43D;&#x442;&#x438;&#x444;&#x440;&#x438;&#x437;&quot;
  setInterval(() =&gt; {
    this.connection.query(&apos;SELECT 1&apos;);
  }, interval);

  // &#x442;&#x443;&#x442; &#x431;&#x443;&#x434;&#x435;&#x43C; &#x445;&#x440;&#x430;&#x43D;&#x438;&#x442;&#x44C; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x44B; &quot;&#x43D;&#x435;&#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x445;&quot; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x439;
  this.slices = {};
};

util.inherits(PubSub, EventEmitter);

const p = PubSub.prototype;
</code></pre></div></div><br>
<div class="spoiler"><b class="spoiler_title">&#x420;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x435;&#x43C; &#x441; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430;&#x43C;&#x438;</b><div class="spoiler_text">&#x41F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; LISTEN/UNLISTEN &#x43D;&#x438;&#x43A;&#x430;&#x43A; &#x43D;&#x435; &#x440;&#x443;&#x433;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x43F;&#x43E;&#x432;&#x442;&#x43E;&#x440;&#x43D;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x43A;&#x435; &#x43D;&#x430; &#x43A;&#x430;&#x43D;&#x430;&#x43B; &#x438;&#x43B;&#x438; &#x43E;&#x442;&#x43F;&#x438;&#x441;&#x43A;&#x435; &#x43E;&#x442; &#x442;&#x43E;&#x433;&#x43E;, &#x43D;&#x430; &#x447;&#x442;&#x43E; &#x43C;&#x44B; &#x43D;&#x435; &#x431;&#x44B;&#x43B;&#x438; &#x43F;&#x43E;&#x434;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x44B;, &#x442;&#x43E; &#x438; &#x443;&#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44F;&#x442;&#x44C; &#x43D;&#x438;&#x447;&#x435;&#x433;&#x43E; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x43C;.<br>
<br>
<pre><code class="javascript">// &#x435;&#x441;&#x43B;&#x438; &#x432; &#x438;&#x43C;&#x435;&#x43D;&#x438; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430; &#x43A;&#x430;&#x43A;&#x43E;&#x439;-&#x442;&#x43E; &quot;&#x43D;&#x435;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x442;&quot;, &#x435;&#x433;&#x43E; &#x43D;&#x430;&#x434;&#x43E; &#x437;&#x430;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x44C; &#x432; &#x43A;&#x430;&#x432;&#x44B;&#x447;&#x43A;&#x438;
// &#x441;&#x430;&#x43C; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B; &#x434;&#x432;&#x43E;&#x439;&#x43D;&#x44B;&#x445; &#x43A;&#x430;&#x432;&#x44B;&#x447;&#x435;&#x43A; - &#x438; &#x442;&#x430;&#x43A; &#x43D;&#x435; &#x434;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x438;&#x43C;&#x435;&#x43D;&#x438; &#x43A;&#x430;&#x43D;&#x430;&#x43B;&#x430;
const quot = str =&gt; /^[_a-z][0-9a-z_\$]*$/.test(str) ? str : `&quot;${str}&quot;`;

p.subscribe = function(channel) {
  this.connection.query(`LISTEN ${quot(channel)}`);
  return this;
};

p.unsubscribe = function(channel) {
  this.connection.query(`UNLISTEN ${quot(channel)}`);
  return this;
};
</code></pre></div></div><br>
<div class="spoiler"><b class="spoiler_title">&#x41F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x447;&#x430; &#x438; &#x43F;&#x440;&#x438;&#x435;&#x43C; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F;</b><div class="spoiler_text"><pre><code class="javascript">const PAYLOAD_LIMIT  = 8000 - 1;
const PAYLOAD_FL_STR = &apos;!&apos;;
const PAYLOAD_FL_OBJ = &apos;@&apos;;
const PAYLOAD_FL_SEQ = &apos;#&apos;;
const PAYLOAD_FL_FIN = &apos;$&apos;;
const PAYLOAD_SZ_HEAD = 1;
const PAYLOAD_SZ_DATA = PAYLOAD_LIMIT - PAYLOAD_SZ_HEAD;

// &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &quot;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x435;&quot; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B;
const reASCII = /^[\x20-\x7E]*$/;

// &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x430;
p.publish = function(channel, payload) {
  let query = `NOTIFY ${quot(channel)}`;
  if (payload !== null &amp;&amp; payload !== undefined) {
    // &#x43A;&#x43E;&#x434;&#x438;&#x440;&#x443;&#x435;&#x43C; &#x442;&#x438;&#x43F; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; - &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x430; &#x438;&#x43B;&#x438; &#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;
    let str = typeof payload == &apos;string&apos;
      ? PAYLOAD_FL_STR + payload
      : PAYLOAD_FL_OBJ + JSON.stringify(payload);
    if (str.length &gt; PAYLOAD_LIMIT || !reASCII.test(str)) {
      // &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x43C; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x44B; base64-&#x43F;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x44F;
      const b64 = Buffer.from(str).toString(&apos;base64&apos;);
      for (let pos = 0, len = b64.length; pos &lt; len; pos += PAYLOAD_SZ_DATA) {
        let fin = pos + PAYLOAD_SZ_DATA;
        let seg = fin &gt;= len
          ? PAYLOAD_FL_FIN + b64.slice(pos)
          : PAYLOAD_FL_SEQ + b64.slice(pos, fin);
        this.connection.query(`${query}, &apos;${seg}&apos;`);
      }
    }
    else {
      // &#x432;&#x441;&#x435; &#x443;&#x43C;&#x435;&#x441;&#x442;&#x438;&#x43B;&#x43E;&#x441;&#x44C; &#x432; &#x43E;&#x434;&#x438;&#x43D; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442; &#x441; &#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C;&#x44B;&#x43C;&#x438; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430;&#x43C;&#x438;?
      // &#x43D;&#x435; &#x437;&#x430;&#x431;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x44D;&#x43A;&#x440;&#x430;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x430;&#x43F;&#x43E;&#x441;&#x442;&#x440;&#x43E;&#x444;
      str = str.replace(/&apos;/g, &quot;&apos;&apos;&quot;);
      this.connection.query(`${query}, &apos;${str}&apos;`);
    }
  }
  else {
    // &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x439; &#x441;&#x438;&#x433;&#x43D;&#x430;&#x43B; &#x432; &#x43A;&#x430;&#x43D;&#x430;&#x43B; &#x431;&#x435;&#x437; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F;
    this.connection.query(query);
  }
  return this;
};

// &#x43F;&#x440;&#x438;&#x435;&#x43C; &#x438; &#x441;&#x431;&#x43E;&#x440;&#x43A;&#x430;
p._onmessage = function(msg) {
  const {processId, channel, payload} = msg;

  // &#x43F;&#x440;&#x43E;&#x43F;&#x443;&#x441;&#x43A;&#x430;&#x435;&#x43C; &quot;&#x441;&#x432;&#x43E;&#x438;&quot;
  if (processId == this.connection.processID &amp;&amp; this.skipSelf) {
    return;
  }

  // &quot;&#x43A;&#x43E;&#x43E;&#x440;&#x434;&#x438;&#x43D;&#x430;&#x442;&#x44B;&quot; &#x438;&#x441;&#x442;&#x43E;&#x447;&#x43D;&#x438;&#x43A;&#x430;
  const id = `${processId}:${channel}`;

  let rv;
  // &#x442;&#x438;&#x43F; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442;&#x430;
  let fl = payload.charAt(0);

  if (fl == PAYLOAD_FL_SEQ || fl == PAYLOAD_FL_FIN) {
    // base64
    const str = payload.slice(PAYLOAD_SZ_HEAD);
    const slices = this.slices;

    let b64;
    if (fl == PAYLOAD_FL_FIN) {
      // &#x441;&#x43E;&#x431;&#x438;&#x440;&#x430;&#x435;&#x43C; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x439;&#x43D;&#x435;&#x440;
      if (slices[id]) {
        slices[id].push(str);
        b64 = slices[id].join(&apos;&apos;);
        delete slices[id];
      }
      else {
        b64 = str;
      }
    }
    else {
      // &#x434;&#x43E;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x441;&#x435;&#x433;&#x43C;&#x435;&#x43D;&#x442; &#x432; &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432;
      if (slices[id]) {
        slices[id].push(str);
      }
      else {
        slices[id] = [str];
      }
    }

    if (b64) {
      rv = Buffer.from(b64, &apos;base64&apos;).toString();
      fl = rv.charAt(0);
    }
  }
  else {
    // &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x430;/&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;
    rv = payload;
  }

  if (rv !== undefined) { // &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &apos;&apos;
    let res = {
      processId
    , channel
    };
    if (rv) {
      // &#x440;&#x430;&#x441;&#x43F;&#x430;&#x43A;&#x43E;&#x432;&#x43A;&#x430; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x441;&#x43E;&#x43E;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x438;&#x438; &#x441; &#x442;&#x438;&#x43F;&#x43E;&#x43C;
      let data = rv.slice(1);
      res.payload = fl == PAYLOAD_FL_OBJ ? JSON.parse(data) : data;
    }

    this.emit(channel, res);
  }
};
</code></pre></div></div><br>
<div class="spoiler"><b class="spoiler_title">&#x41D;&#x435;&#x43C;&#x43D;&#x43E;&#x433;&#x43E; &#x442;&#x435;&#x441;&#x442;&#x43E;&#x432;</b><div class="spoiler_text"><pre><code class="javascript">const pg = require(&apos;pg&apos;);

const pgsql = new pg.Client({
  host : &apos;example-db&apos;
, port : 5432
, user : &apos;postgres&apos;
, password : &apos;postgres&apos;
, database : &apos;_tmp&apos;
});

pgsql.connect(err =&gt; {
  let psA = new PubSub(pgsql, 1000);
  let psB = new PubSub(pgsql, 1000);

  let chA = &apos;channel:A&apos;;
  let chB = &apos;channel:B&apos;;
  psA.subscribe(chA);
  psB.subscribe(chB);

  psA.on(chA, (msg) =&gt; {
    console.log(&apos;A:rcv&apos;, msg);
  });
  psB.on(chB, (msg) =&gt; {
    console.log(&apos;B:rcv&apos;, msg);
  });

  psB.publish(chA);
  psB.publish(chA, &apos;simple string&apos;);
  psB.publish(chA, &apos;&#x43C;&#x430;&#x43C;&#x430; &#x43C;&#x44B;&#x43B;&#x430; &#x440;&#x430;&#x43C;&#x443;&apos;);
  psB.publish(chA, {a : 1});
  psA.publish(chB, &apos;&#x43C;&#x430;&#x43C;&#x430; &#x43C;&#x44B;&#x43B;&#x430; &#x440;&#x430;&#x43C;&#x443; 100 &#x440;&#x430;&#x437; &apos;.repeat(100));
});
</code></pre></div></div><br>
&#x412;&#x441;&#x435; &#x434;&#x43E;&#x441;&#x442;&#x430;&#x442;&#x43E;&#x447;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43B;&#x435;&#x433;&#x43A;&#x43E; &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43D;&#x430; &#x43B;&#x44E;&#x431;&#x43E;&#x43C; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x43C; &#x42F;&#x41F;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x43C;&#x43E;&#x43C; &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x435;, &#x432;&#x437;&#x44F;&#x432; &#x437;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x443; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;&#x44B; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x430;&#x441;&#x438;&#x43D;&#x445;&#x440;&#x43E;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438;:<br>
<br>
<ul>
<li><a href="http://initd.org/psycopg/docs/advanced.html#asynchronous-notifications">Python</a></li>
<li><a href="https://tapoueh.org/blog/2018/07/postgresql-listen-notify/">Go</a></li>
<li><a href="https://omniti.com/seeds/stop-collaborate-and-listen-notify.html">Perl</a></li>
<li><a href="https://blog.lelonek.me/listen-and-notify-postgresql-commands-in-elixir-187c49597851">Elixir</a></li>
</ul></div>
      
    </div>

    

    <dl class="post__tags">
      <dt class="post__tags-label">&#x422;&#x435;&#x433;&#x438;:</dt>
      <dd class="post__tags-list">    <ul class="inline-list inline-list_fav-tags js-post-tags">
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bpostgresql%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">postgresql</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bjavascript%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">javascript</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Blisten%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">listen</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bnotify%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">notify</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bjson%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">json</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bnodejs%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">nodejs</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bpubsub%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">pubsub</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5B%D1%83%D0%B2%D0%B5%D0%B4%D0%BE%D0%BC%D0%BB%D0%B5%D0%BD%D0%B8%D1%8F%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">&#x443;&#x432;&#x435;&#x434;&#x43E;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x44F;</a></li>
        <li class="inline-list__item inline-list__item_tag"><a href="https://habr.com/ru/search/?q=%5Bmessage%20queue%5D&amp;target_type=posts" rel="tag" class="inline-list__item-link post__tag  ">message queue</a></li>
    </ul>
    <button type="button" class="btn btn_outline_grey btn_mini hidden js-fav-edit-link" data-type="2" data-id="484978" onclick="show_edit_tags(this)">&#x414;&#x43E;&#x431;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43C;&#x435;&#x442;&#x43A;&#x438;</button>
</dd>
    </dl>
  </div>